{
  "id": 11165,
  "events": [
    12736
  ],
  "name": "Stand Up For Yourself! With Amy Miller",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/amylogobordermedium.jpg",
  "photoUrl": "/api/img/show-images/show-standupforyourselfwithamymiller-300x300.jpg",
  "sortOrder": 25,
  "bio": "<p>Stand Up For Yourself! is a hybrid stand-up comedy, therapy, and morning talk show. The show began last year at Helium Comedy Club and was an instant success! It&#039;s a combination of laughs, and real talk + hilarious and revealing games, audience participation, and general humiliation. As a person obsessed with talk shows in the vein of Wendy Williams, Steve Harvey, and other shows hosted by someone with no official therapy training just doling out love and life advice to broken people, I thought...what people are more broken then comics? The show and hosting style allow a comfortable space for comics to do their regular set, and then sit down reveal some of their deepest secrets. In shows past, we&#039;ve had guests admit to a range of life events all the way from butt stuff to cancer diagnoses to suicidal thoughts to molestation to being completely clueless about love. And somehow we manage to keep it funny.</p>\n<p>Audience members love it, as they&#039;re encouraged to ask questions, ask for life advice, and try to help the comics. They&#039;re also encouraged to participate in a regular call and response of the show title with the host.<br />\n&quot;STAND UP&quot;<br />\n&quot;FOR YOURSELF!&quot;</p>\n<p>Some popular past segments:</p>\n<p>- &quot;Gettin&#039; Posi with Pasi&quot; - a regular segment in which Portland comic Adam Pasi compliments as many people in the room as he can in 2 minutes. Makes people feel so good!<br />\n- Blind Leading the Blind - This is when a comic with a terrible relationship history gives love advice to people in the crowd<br />\n- &quot;Eli-ke or E-don&#039;t like it&quot; - A segment with bi-racial Portland comedian Jeremy Eli in which I projected things that are stereotypically enjoyed by either white people or black people, and made him choose<br />\n- A Walk in the Woods - Comic and Audience are led into an extended psychological test (lights down, Enya playing) many of us took at 5th grade slumber parties</p>\n<p>I&#039;d love to try this format with comics I only know a little bit about, as I think the unfamiliarity would lend itself to even more ridiculous findings.</p>\n<p>Oh, and there is a plant. And a producer on a god mic à la Gelman or Letterman Liz. It&#039;s so fun!</p>\n",
  "copy": "<p>After seeing a stand-up comedy show, did you ever leave asking yourself &quot;What is wrong with these people?&quot; Equal parts &quot;Iyanla: Fix My Life&quot; and &quot;Between Two Ferns,&quot; Stand-Up For Yourself is the first hybrid stand-up comedy and therapy morning talk show that happens at night. Your favorite comics do their material and then sit down for some tough love interviews, games, and audience interactions.</p>\n<p>Bring your own questions! Make them as personal as you want, I don&#039;t care! Audience participation encouraged. Prizes! Surprise guests! Games! Maybe some tears! People will laugh. </p>\n<p>Lives will be changed. Comics will get fixed.</p>\n<p>Hosted by the modern day Dr. Shirley, Amy Miller!</p>\n",
  "pageUrl": "11165-stand-up-for-yourself-with-amy-miller",
  "iTunesUrl": ""
}