{
  "id": 11212,
  "events": [],
  "name": "Arguments and Grievances",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/aandg.jpg",
  "photoUrl": "/api/img/show-images/show-argumentsandgrievances-300x300.jpg",
  "sortOrder": 9999,
  "bio": " Arguments and Grievances Comedy Debates pits comedians against each other on such topics as “McRib vs. MacBeth” and “Hugs vs. Drugs”—with audiences deciding the victor.  Each show is recorded and then released as a podcast. It combines joke writing, responding to and roasting your opponent and good old fashioned pandering to create a show where almost anything can happen. The show has been happening in both Denver and Chicago for years and has consistently been one of the most popular comedy shows in both the cities. The format is really simple. Each debate consist of two comedians who get two five minute rounds to make their case on why their topic is better then their opponents and then the crowd decides the victor. ",
  "copy": "Touring regularly and hosted monthly at Chicago favorite Schuba’s Tavern, Arguments &amp; Grievances is a live comedy series and podcast featuring comedians debating outlandish topics with audiences choosing the victor. An outrageous enterprise exploring the heated issues of the day, including: &quot;Hugs vs. Drugs&quot;, &quot;Dr. Dre vs. Dr. Seuss&quot;, and &quot;Batman vs. Spiderman&quot;, Arguments and Grievances is an impressive showing of live comedy, absurdity, and engaging fun.The series and podcast is produced entirely by Chicago comedians Kevin White, Zach Peterson, Goodrich Gevaart, and Kevin Brody. Half comedy show, half rhetorical fight to the death, Arguments and Grievances is an impressive showing of live comedy, absurdity, and engaging fun.\r\n\r\n &quot;2014 BEST OF CHICAGO - VARIETY SHOW&quot; - Chicago Magazine\r\n\r\n&quot;It&#039;s smart, high-stakes tomfoolery disguised in a brilliant, faux-brainy conceit....This show is a riot.&quot;\r\n- Jason Heidemann, Chicago Tribune \r\n\r\n&quot;...it&#039;s funny, really funny.” \r\n- Allison Kelley, The Chicagoist\r\n\r\n&quot;This excellent debate series enlists some of the city&#039;s funniest underground comedians.” \r\n- Keith Griffith, Chicago Reader",
  "pageUrl": "11212-arguments-and-grievances",
  "iTunesUrl": ""
}