{
  "id": 11246,
  "events": [],
  "name": "Sisters From Other Misters",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/second_city_sfom_cake_batter_4x6-2.jpg",
  "photoUrl": "/api/img/show-images/show-sistersfromothermisters-300x300.jpg",
  "sortOrder": 9999,
  "bio": "A Sketch Comedy Show with real Magic and a Puppet!  \r\n\r\nSISTERS FROM OTHER MISTERS (Nicole Nasca &amp; Amanda Talbot) is a two-woman show that uniquely blends sketch comedy, classically trained magic, and not-so-classically trained ventriloquism.  Think Absolutely Fabulous meets David Copperfield meets Jeff Dunham’s worst nightmare.\r\n\r\nThe Balls Sisters, two senior sisters in their twilight years, retell their life&#039;s story in an interview backstage during America’s Got Talent.  Pearl Balls (Amanda Talbot - Second City, Magic Castle Hollywood) is a British magician who never knew her father and is her mum Molly Balls’s favorite daughter.  Kitty Kitty Balls (Nicole Nasca - Second City, UCB) is an American ventriloquist who never knew her different father and is Molly Balls’s least favorite daughter.  The Balls sisters grew up with just each other after being both abandoned by Molly Balls, only to have their bond shattered over a mistaken love triangle between Pearl Balls and Phil (Kitty Kitty’s saucy puppet).  We see the sister’s journey and struggle to reconcile with each other and make it big in show business through a series of sketches from their Vaudevillian roots to today’s TV reality shows.\r\n\r\nSISTERS FROM OTHER MISTERS is written and performed by Nicole Nasca &amp; Amanda Talbot and premiered on the Second City Hollywood main stage and is an official selection of Cake Batter’s Funny Women Festival Los Angeles.\r\n",
  "copy": "Pearl and Kitty Kitty grew up under the Vaudevillian stage...\r\n\r\nTheir mother left them for a clown,\r\nNot knowing their fathers never got them down.\r\nRaised by a drunken sailor named Bill,\r\nAll they have is magic and a puppet named Phil.\r\nAlways the very best of friends,\r\nFollow these start from start to end.",
  "pageUrl": "11246-sisters-from-other-misters",
  "iTunesUrl": ""
}