{
  "id": 11252,
  "events": [],
  "name": "Comedy Llama",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/12139929_1007147636014295_6518943341654027305_o.jpg",
  "photoUrl": "/api/img/show-images/show-comedyllama-300x300.jpg",
  "sortOrder": 9999,
  "bio": "Comedy Llama is a chat show featuring a round robin of NYC&#039;s best comedians chatting with hosts Sam Haft &amp; Tommy Kang about two topics picked for each episode.\r\n\r\nWhile the premise is basic, it leaves room for some major hilarity as the free associations create deep and totally unexpected conversation tangents. For example, &quot;kids &amp; gentrification&quot; leads to a debate about whether or not you&#039;d masturbate your cat - and &quot;pizza &amp; booty&quot; leads to a story about pretending to be an Indian tarot psychic. We&#039;re beloved by our small and dedicated listener-base, and received a rave review from the Queens Chronicle, which said, &quot;while you will laugh harder than you have at most podcasts, you’ll also experience something endlessly creative and honest[...] When watching Comedy Llama, you’re witnessing craftsmanship at its most fundamental. For hardcore fans to casual observers, there’s nothing better.&quot;\r\n\r\nAs of our fourth season we now broadcast live Sunday nights at 10pm on Radio Free Brooklyn, a podcast network with an average of 2300 listeners.",
  "copy": "WHAT IS COMEDY LLAMA?\r\n\r\nBased out of NYC, Comedy Llama is what happens when a storytelling podcast meets a live-audience comedy show. A comedic confessional booth for the NYC comedy scene&#039;s best and brightest, Comedy Llama has elicited laughs, tears, and family secrets. If we had a dollar every time someone on the podcast said, &quot;I&#039;ve never told anyone that before,&quot; then we could afford most of a bag of movie theater Raisinettes.\r\n\r\nHosted by Sam Haft &amp; Tommy Kang\r\nPast guests include Pete Lee, Taylor Negron, Carole Montgomery, Monroe Martin, Mike Cannon, Derek Gaines, Danny Tamberelli, Michael Kosta, &amp; more.\r\nEdited by the patient and talented Andy Myers.",
  "pageUrl": "11252-comedy-llama",
  "iTunesUrl": ""
}