{
  "id": 11328,
  "events": [],
  "name": "Spilt Milk Comedy Show",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/spilt_milk_logo.jpg",
  "photoUrl": "/api/img/show-images/show-spiltmilkcomedyshow-300x300.jpg",
  "sortOrder": 9999,
  "bio": "Our strong theme is we are a clean comedy show featuring local comics and authors!  We have been selling out shows regularly in SW Portland for 3 years, as the draw for clean comedy is alive and well in Portland!  Our show could offer festival goers something different, as well as provide an opportunity for our regular followers to take in the festival.  We can pack a house!\r\nWe have a host, and 5-6 performers, each doing between 5-10 min, with a headliner doing about 15-20 minutes.  The show moves quickly, is well produced and organized, and we&#039;d love to be a part of Bridgetown!",
  "copy": "Betsy Kauffman and Joanie Quinn couldn&#039;t stay up late enough to watch, much less perform in, many of the comedy shows around Portland. So they started one of their own. &quot;Spilt Milk -- you&#039;ll laugh &#039;til you cry!&quot; was their solution. It&#039;s the &quot;Spilt MIlk: you&#039;ll laugh &#039;til you cry!&quot; comedy show at O&#039;Connors in Multnomah Village. It starts promptly at 7 p.m., and it&#039;s clean. &quot;We used to say it had to be £ber-clean; now we say it&#039;s PG-13,&quot; says Quinn.\r\n\r\n&quot;We know our audience, these are our people,&quot; says Kauffman. &quot;We all need time afterwards to go home and fold laundry.&quot;  It&#039;s a winning formula. The showcase started out as a one-night monthly event almost three years ago. Now the show draws a full house each month.  Kauffman and Quinn perform in many of the shows and give other comics and authors, most of them women, a place to perform.\r\n\r\nQuinn had always aspired to be a comedian. She took a stand-up class in Los Angeles, decades ago, when she was 25. After that she got married, moved to Portland and became enmeshed in raising four kids. &quot;An 8 year old through a junior in college; the comedy never ends,&quot; she says.\r\n\r\nKauffman took a stand up comedy class in 2006. &quot;You can take a class in anything&quot;, says Kauffman.  &quot;I was the only student who did all the homework.&quot;  By the time the class finished, she had a five-minute set.  &quot;I thought I was going to throw up,&quot; she says. &quot;I was thinking really fast. It was exhilarating and terrifying.&quot;\r\n\r\nIn 2012, they decided to start their own showcase. They run it as a business. Quinn does the promotions; Kauffman does the books. They pay comics who appear and, says Kauffman, &quot;we&#039;re organized. We start, and end, on time.&quot;  And both founders still get a huge thrill from performing.\r\n\r\n&quot;Betsy and Joanie take comedy very seriously,&quot; says Nikki Schulak, an author who has performed at Spilt Milk several times. &quot;They&#039;ve created a niche for people who need to get home in time to put their kids to bed. It works for a different crowd - and they pay us. That&#039;s awesome. It&#039;s respectful and professional. They believe in the comics they bring in.&quot;  \r\n\r\n&quot;Such a great evening!  All the performers are so different from each other, it makes for a unique, fun show!&quot; praised Cheryl Backlund, recent audience member.\r\n\r\nSpilt Milk Comedy takes place at O&#039;Connors Cafe and Bar, in SW Portland.  Our 2016 dates are Fri Jan 22, Fri Feb 12, Thur Mar 10, Fri April 8, Fri May 13, and Thur June 16.  Tickets are sold in advance at www.brownpapertickets.com/event/304474.  Website: www.spiltmilkpdx.com",
  "pageUrl": "11328-spilt-milk-comedy-show",
  "iTunesUrl": ""
}