{
  "id": 11405,
  "events": [],
  "name": "My Diary",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/jonathan_screen_shot.png",
  "photoUrl": "/api/img/show-images/show-mydiary-300x300.jpg",
  "sortOrder": 9999,
  "bio": "\r\nMy Diary is a show I&#039;ve been doing for a year at UCB, The Improv and Comedy Central Stages. It&#039;s just got an extended run at UCB and will be featured on Bravo&#039;s &quot;Vanderpump Rules&quot;.\r\nIt&#039;s a very special and unique show where comedians, writers and actors share diary entries from their past. But it&#039;s so much more... The performers are given free reign to recount from their entries as they see fit. We have had power point presentations, songs, dances, re-enactments, Face Times, raps, conference calls and traditional reading. It&#039;s a very special and unique show because audiences are given a chance to see a completely different side of comedians they know and love. While it&#039;s always very funny, it also has a very real and very vulnerable aspect to it which is completely compelling for audiences.  This show is full of surprises and a lot of fun. \r\nPast guests include:  Matt Braunger, Alice wetterlund, Eric Andre, Jonathan Ames (creator of bored to death/Blunt talk/ the moth) Brent Weinbach, Nick Thune, Beth Stelling, Kate Berlant, Greg Barris, Jonah Ray, Erin McGathy, Kate Freund, Curt Neil, Eric Dadourian, Timm Sharp, Mary Holland,  Milana Vayntraub, Courtney Paruso, Whitmer Thomas, Nicole Byer, John Ennis, Anna Seregina, Eliza Skinner, \r\n\r\n\r\n\r\n\r\nShould you want to see extra footage from other shows apart from the video URL below; I&#039;m attaching links from  a couple other shows since they vary \r\n\r\nComedy Central stages ft: Nicole Byer, Brent Weinbach, Whitmer Thomas, Jade Catta Pretta, and Alana Johnston - https://vimeo.com/148427621\r\n\r\nUCB Sunset ft: Jonathan Ames (Bored to death/Blunttalk) Timm Sharp, Mary Holland, Jeannie Darst, Eric Dadourian, Kate Freund, Rebecca Drysdale - https://vimeo.com/148518275\r\n\r\n",
  "copy": "Have you ever wanted to know what&#039;s in the deep dark pages of your favorite comedians diaries? \r\n\r\nWell now you will. And you&#039;ll regret it.\r\n\r\nIf you want to hear salacious, emotionally fraught, hilariously horrible moments from our diaries, this show is for you. \r\n\r\nMy Diary is the show where comedians reveal their most private moments publicly. Heaven help us all\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n* I make posters for each show, so I will have posters made up for the festival should we get in. The photo I&#039;m attaching is a sample from a past show",
  "pageUrl": "11405-my-diary",
  "iTunesUrl": ""
}