{
  "id": 11431,
  "events": [],
  "name": "The Imaginary Radio with Drennon Davis",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/irp_bridgetown_icon.jpg",
  "photoUrl": "/api/img/show-images/show-theimaginaryradiowithdrennondavis-300x300.jpg",
  "sortOrder": 9999,
  "bio": "The Imaginary Radio Program in some form has come to Bridgetown before, so you should have some idea of what to expect.  The current version of the show is now a monthly show that runs the first Sunday of every month at The Satellite in Los Angeles.  The full show includes Drennon Davis, and a slate of guest comedians and musicians, putting on an 90-120 minutes of sketch/music/improv as Drennon guides the audience through a series of &quot;stations&quot; each landing on a new song, spoken word parody or commercial parody. \r\n\r\nDrennon works with each booked guest to come up with a specific item for the show. Whether that&#039;s a pre-existing bit that they can plug into, and improvised song off a particular theme, a series of call in jokes (utilizing the other show guests as callers), or something wholly original that the guest would like to do themselves. \r\n\r\nIt&#039;s an opportunity for comedians and musicians alike to do something funny outside of stand up.  Past examples of these include: James Adomian reading &quot;Twas The Night Before Christmas&quot; in character as Jesse Ventura; Seane Keane doing a This American Life parody as Ira Glass talking about the plot of American Pie; Rachel Bloom performing her songs with backing from Drennon; Eliza Skinner on a call in show improvising songs based on caller suggestions; music mashups of two disparate artists such as Genuweinfeld (Genuwine and Seinfeld) or Jim Morrissey (Jim Morrison and Morrissey).\r\n\r\nThere are regular acts in most shows (Nick Stargu, Karen Kilgariff, Sean Keane) that Drennon often uses as well as numerous artists who have done it before either in Los Angeles or its many tour locations. There&#039;s no show like it anywhere.",
  "copy": "Songs and sketches loop together in this live show created and hosted by Drennon Davis (Conan, Last Comic Standing, Adam Devine&#039;s House Party). Featuring live songs, sketch comedy, and lots of special appearances by some of the funniest character and musical comics in the business. \r\n\r\nThe Los Angeles Comedy Bureau says the Imaginary Radio Program &quot;not only lives up to its name, but exceeds expectation in what you could possibly think it is.&quot; \r\n\r\nDrennon Davis was recently named one of LA Weekly&#039;s Top 10 Comedy Acts to Watch (2014) and Best Comedy Duo (2015, with Karen Kilgariff), as well as one of Splitsider&#039;s Top 10 Up &amp; Coming Acts in LA (2015). Davis has brought The Imaginary Radio Program to comedy festivals all over the world, including the Edinburgh Fringe Festival, SXSW, Riot LA Alternative Comedy Festival, Bridgetown Comedy Festival, Vancouver Comedy Festival, the Oddball Comedy Festival, and many more.\r\n",
  "pageUrl": "11431-the-imaginary-radio-with-drennon-davis",
  "iTunesUrl": ""
}