{
  "id": 11489,
  "events": [],
  "name": "Garbage People!",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/title.jpg",
  "photoUrl": "/api/img/show-images/show-garbagepeople-300x300.jpg",
  "sortOrder": 9999,
  "bio": "Chanukah 2014 I was still whining about the death of a bar show I had run for 3 months with Eden Nault. Holiday party at my friend Rebecca’s house by Hawthorne yielded a possible new venue (The Waypost) and a guy who would rather be a comedian than the musical guest (Hutch Harris) it was a great stroll around Peacock Lane, and the following month Kickstand Comedy Space and The Waypost said yes at the same time!\r\n\r\nArt followed me around until I could do something with it. The comic book artist who became a podcaster turned into the conductor of a beautifully ugly emotional orchestra.\r\n  Garbage People asks my favorite comedians to tell a story of fucking up, getting numb, blacking out, losing teeth, getting arrested, or dumping someone like a jerk. At the outset of each show I ask the audience to clap if you’ve ever fallen down, failed, or made an ass of yourself--and then I tell them congratulations! if you sat in silent judgment while other people clapped, you’re a Garbage Person, too!\r\n\r\nGarbage People will have a birthday show with Bri Pruett and Crystal Kordowski on January 16, we will be in Denver on February 12, back in Portland for post-Valentine’s heartbreak on February 20 with Nathan Brannon and Adam Pasi, in Los Angeles in my friend Miranda King’s backyard in March, and then Garbage Island will pull up to NYC in April with Mike Daisey. Mike had the most-downloaded episode of This American Life ever, where he traveled to Hong Kong to study how our phones and gadgets are made by slaves who suffer terribly. Ira Glass became enraged when he found out that Daisey had told some of the stories from his own perspective -- that of a rich, rotund, white, American businessman -- to give them more currency. He lied. He’s one of my heroes and I have seen his amazing spoken word shows and taken classes from him at the TBA festival.",
  "copy": "Garbage People! is the comedy storytelling show where your favorite funny people tell fucked-up true stories about how horrible they&#039;ve been. \r\n  &quot;Garbage people takes the villain of the story, which is usually some terrible boss or neighbor or ex, and puts them onstage\r\nlike Richard III confessing his mistakes and motivations to the audience,&quot; says creator Brodie Kelly. &quot;Tell us the story where YOU\r\nare the bad ex, where YOU fuck up.&quot;\r\n  The show has been going for a year in Portland &amp; will be touring the country starting in 2016.",
  "pageUrl": "11489-garbage-people",
  "iTunesUrl": ""
}