{
  "id": 11546,
  "events": [],
  "name": "So You Think You Can Rant",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/rant-show-banner.jpg",
  "photoUrl": "/api/img/show-images/show-soyouthinkyoucanrant-300x300.jpg",
  "sortOrder": 9999,
  "bio": "An high energy and ridiculous ensemble show for stand ups and improvisers based in Toronto\r\n\r\nhttp://empirecomedylive.com/so-you-think-you-can-jfl42/\r\n\r\nIn 2015, So You Think You Can Rant was a breakout hit at Comedy Bar&#039;s annual festival of New Formats, and went on to be included in Toronto&#039;s Big City Improv Festival, and peripherally as part of Toronto&#039;s JFL42\r\n\r\nBasic format\r\n\r\nEach participant pulls two topics out of the bucket 5 minutes before their set, and they can choose whichever one they prefer. They then get 5-6 minutes to rant/talk off the cuff about that topic (or wherever they may tangentially roam with it).\r\n\r\nFor example, the performer might pull &quot;The Gym&quot;, and from there they might go on a rant about: going to the gym, people they hate at the gym, fitness culture in general, the worship of unrealistic body images, or just a story about that time they farted really loudly in yoga class. Topics are kept general to allow performers to choose their own trajectory. Politics instead of President Obama, Pop Culture instead of Taylor Swift.\r\n\r\nIt can be deep, juvenile, and everything in between. They can also do 2-3 minutes on each topic if they prefer. Most seem to prefer doing both.\r\n\r\nSo You Think You Can Rant works well as a late night party show since the sets are fairly short, and the performances are as much fun to watch for the performers as they are for the audience.\r\n\r\nSeveral Toronto comics who have already submitted for this year&#039;s festival in Bridgetown have participated before and can host the show if you choose to include it &amp; them as part of your programming.\r\n(DeAnne Smith, Andrew Ivimey, Amanda Brooke Perrin, and Mark Little (if he&#039;s submitted)). If you don&#039;t accept them for the fest, I can come out and run it myself.\r\n\r\n\r\n\r\n**Quick note about Empire Comedy Live, we&#039;ve presented Matt Braunger twice before (2013 &amp; 2014) , and working on dates for 2016. I know this doesn&#039;t tell you anything about the show, but Matt can at least tell you that we&#039;re not total maniacs.  More on our other events at: http://empirecomedylive.com/artists/\r\n\r\n\r\n",
  "copy": "A hit show from Toronto&#039;s Festival of New Formats at Comedy Bar!\r\n\r\nSo You Think You Can Rant features a fun ensemble of intelligent, opinionated, &amp; quick witted comedians who are surprised with their topic 5 minutes before taking the stage\r\n\r\nThen they hit the stage, their topic and the audience with everything they’ve got!\r\n\r\nRidiculousness ensues",
  "pageUrl": "11546-so-you-think-you-can-rant",
  "iTunesUrl": ""
}