{
  "id": 11574,
  "events": [],
  "name": "Dungeon",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/remi_bridgetown.jpg",
  "photoUrl": "/api/img/show-images/show-dungeon-300x300.jpg",
  "sortOrder": 9999,
  "bio": "Dungeon is comedy, Dungeons &amp; Dragons style. Players face off against devious Dungeon Master Remi Treuer in adventures sure to make you laugh, gasp, and cheer.\r\n\r\nMost role-playing game themed shows are similarly formatted. People sit around a table and play Dungeons &amp; Dragons, riffing on what&#039;s happening. The mechanics of the game are opaque, and the show is firmly aimed at people already expert in the language of role-playing games. In Dungeon, the adventure IS the comedy. The rules are simple and clear, even to people entirely unfamiliar with Dungeons &amp; Dragons or other role-playing games. A single player-comedian is led through a short adventure prompted by Remi the Dungeon Master, who crafts each set to the comedian, their character, and the moment-to-moment events of their adventure.\r\n\r\nProduction value such as costumes, projected die rolling, and custom fantasy portraits of the comedians on stage adds to an atmosphere of fun and adventure. Dungeon’s level of crowd engagement is very high, as well. The adventures draw the audience in, and they hang on every die roll, slowly ratcheting up the tension and humor until everyone is on the player’s side, pulling for their victory, or their hilarious doom.\r\n\r\nIn addition to the three adventure sections, the are also three 6-10 minute stand-up sets. These are used as a breather and palette-cleanser between adventures. The comedians in these slots DO NOT have to be geek-oriented. The format of the show is as follows: Introduction - Stand-up - Adventure - Stand-up - Adventure - Stand-up - Adventure - Close.\r\n\r\nIn October 2014 Dungeon established itself in Atlanta at the Hangar performance space, where it was a monthly show.  Dungeon continues to perform month at its current home at the Highland Inn Ballroom. Dungeon has toured and been featured at Crom Comedy Festival in Omaha, NE, Epic Comedy Hour’s 4-year Anniversary Show in Huntsville, AL and the Harry Potter-focused CONjuration in Atlanta, GA. It was praised in 2014 end of year lists on both laughbutton.com and brightestyoungthings.com.",
  "copy": "Dungeon is comedy, Dungeons &amp; Dragons style! Players face off against devious Dungeon Master Remi Treuer in adventures sure to make you laugh, gasp, and cheer! Featuring a variety of incredible stand-up comedians!\r\n\r\nAfter establishing itself in Atlanta at the Hangar performance space and its current home at the Highland Inn Ballroom, Dungeon has toured and been featured at Crom Comedy Festival in Omaha, NE, Epic Comedy Hour’s 4-year Anniversary Show in Huntsville, AL and the Harry Potter-focused CONjuration in Atlanta, GA. It was praised on 2014 end of year lists on both laughbutton.com and brightestyoungthings.com",
  "pageUrl": "11574-dungeon",
  "iTunesUrl": ""
}