{
  "id": 11700,
  "events": [],
  "name": "We Still Like You",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/wslypodcast.jpg",
  "photoUrl": "/api/img/show-images/show-westilllikeyou-300x300.jpg",
  "sortOrder": 9999,
  "bio": "We Still Like You is a show about shame. Since February of 2014, We Still Like You has been a live comedy show in Chicago based around the confession of shameful things that comedians have done in the past. We do our best to establish our show as a space where performers can joke about the things that make them feel shameful and thus move forward and conquer that shame. \r\n\r\nEach show features 7 performers and is hosted by various combinations of our 5 producers. After each story, the crowd is directed to raise a toast and chant &quot;We still like you!&quot; so that the performer can feel the crowd&#039;s acceptance of whatever they&#039;ve done in the past. We also have a brief Q&amp;A after each story so that we can tie up any loose ends before presenting our live art (drawn by producer J. Michael Osborne) that has been inspired by the performer&#039;s set. We&#039;ve had confessions about everything from sexuality to pranks gone wrong to involvement with cults. We Still Like You is equal parts hilarious and cathartic as our performers find humor in some of the most unexpected places.  We believe that we&#039;ve spent the last two years creating a unique and special environment and we would love to be able to share that environment with you.",
  "copy": "Do you have a story from your past that makes you feel weird? We Still Like You is a show centered around sharing those stories and conquering the shame those stories hold, whilst surrounded by friends and strangers. Featuring a lineup of some of Chicago’s best comedians and improvisers, We Still Like You is all about sharing. Because if we’re all assholes, then none of us are. We Still Like You is a safe place for storytellers to laugh at their most humiliating moments and take power away from their shame, so after every story the audience gives a hearty cheer of “WE STILL LIKE YOU!” \r\n\r\nWe Still Like You has travelled all over the country, having performed in The Orlando Indie Comedy Festival, The Green Gravel Comedy Festival, and Hell Yes Fest in New Orleans. The show now has a Los Angeles chapter produced by comedian Andy Sell.\r\n\r\nThe show is also a podcast, releasing new episodes twice a month on iTunes.\r\n\r\nThe show is produced by Tyler Snodgrass, J. Michael Osborne, Danii Gallegos, Dan Sheehan, and Shannon Noll.\r\n",
  "pageUrl": "11700-we-still-like-you",
  "iTunesUrl": ""
}