{
  "id": 11742,
  "events": [],
  "name": "Church Night",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/160115_churchnight_small.jpg",
  "photoUrl": "/api/img/show-images/show-churchnight-300x300.jpg",
  "sortOrder": 9999,
  "bio": "Church Night is a comedy act based in Washington, DC. They have featured at The Bentzen Ball Comedy Festival (curated by Tig Notaro), Edinburgh Festival Fringe, and released their first web series, Church Night TV, in November 2015. \r\n\r\nChurch Night parodies a Middle-America church service, but the content is better suited for a late night in a cheap motel. In its monthly incarnation, Church Night takes the form of a variety show featuring rotating stand-up comedy, burlesque, and/or musical acts. Between the guest performances, Church Night characters titillate the congregation with spiritual sketches, praise music, and crowd participation (the good kind, not the shitty kind that no one likes). The service ends with the infamous Shots n’ Tots Communion. While the promise of a free shot of whiskey and a single tater tot may get people in the door, the church staff is what keeps them coming back.\r\n\r\nThe Reverend Dr. Stevedore Maybelline Bidet Esq. delivers the word with a zealous passion he usually only reserves for cats. Don’t worry, he’s licensed in theology, veterinary science, cat optometry, and cat law, so it’s totally legit. Kathy Piechota, the sensual, Midwestern youth minister keeps the services running smoothly. She keeps the kids in line because she knows how to talk shit and is not afraid to lie. The scantily clad and mute altered boy, Randy St. Oates Jr., lights the candles, does whatever Bidet and Kathy tell him to, and then blows the candles out in the end. They’re good, faithful Americans who sometimes act like idiots, but that&#039;s only because they&#039;re dumb. They call upon the Lord for His guidance, but he&#039;s usually not there.\r\n\r\nChurch Night is created by Linsay Deming, Landon Letzkus, and Jeremy Frank. They started as a variety show in April 2013 at iconic, neighborhood dive bar and alt-comedy hub, The Wonderland Ballroom. Having built a fervent following with consistently sold-out monthly shows, they relocated to historic rock venue, Black Cat, in December 2014. In addition to the monthly services, the Church Night characters host comedy and rock shows, perform sketches, and create weird, interactive experiences for unexpecting audiences.",
  "copy": "Church Night is a variety show of biblical proportions featuring stand-up comedy, sketches, music, and everyone’s favorite: shots and tots communion. This sell-out show from Washington, DC parodies a Sunday church service, but the content is better suited for a late night in a cheap motel. Reminiscent of “A Prairie Home Companion” on acid, Church Night’s eccentric, religious satire will delightfully destroy your memories of church. It’s about coming together, at the same time, in the name of the Lord. Prepare your shit, people, because you’re going to leave this service feeling #blessed. AMEN!\r\n\r\nChurch Night featured at The Bentzen Ball Comedy Festival (curated by Tig Notaro) in 2014 and 2015, performed a run at Edinburgh Festival Fringe 2015, and released their first web series, Church Night TV, in 2015. They’ve opened for Tim Heidecker, Brett Gelman, Eugene Mirman, Kate Berlant, Dave Hill, and more. Church Night is created by Linsay Deming, Landon Letzkus, and Jeremy Frank. ",
  "pageUrl": "11742-church-night",
  "iTunesUrl": ""
}