{
  "id": 11826,
  "events": [],
  "name": "Virgin Sacrifice",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/smaller_vs_poster.jpg",
  "photoUrl": "/api/img/show-images/show-virginsacrifice-300x300.jpg",
  "sortOrder": 9999,
  "bio": "Virgin Sacrifice\r\nA night of Stand-Up Comedy\r\nComedians sacrifice one Stand-Up Virgin!\r\nYou never forget your first set!\r\n\r\nLights up. Nicole Blaine, host and creator, explains to the audience what they are about to see. First up, top comedians from late night TV and Comedy Central will perform. Then, after 70 minutes of watching the pros make it look easy, one person, who has never done stand-up before and was never planning on doing it in their lifetime, will perform for the first (and most likely last) time in their life. On stage. Alone. While you watch. Virgin Sacrifice! You never forget your first set!\r\n\r\nNicole gives the audience background information on our Virgin. This is a person who has a “normal” career. Previous Virgins have been doctors, lawyers, bankers, bartenders, and grandfathers. They are booked months ahead of time, and Nicole helps them prepare for their big night. They invite everyone they know. Every show has sold out for over two years. No one wants to miss Anne from accounting’s once in-a-lifetime attempt to be funny. \r\n\r\nThe Virgin sits in the audience during the show. After the professional comics perform, Nicole interviews them about their first time doing stand up. They tell the audience their first joke or other memorable “firsts.” They offer the Virgin advice before their big moment. \r\n\r\nThe Virgin headliner finally takes the stage. The entire room is on the edge of their seats. The Virgin is visibly shaking. The first joke lands. Laughter. Success. Adrenaline for all. It’s a night to remember. Forever.\r\n\r\nFormer Virgin Ted Nicholson sums it up best: “That was the best night of my adult life. After being a Virgin, I decided to go back to work on the music career I abandoned ten years ago. Virgin Sacrifice changed my life.”\r\n\r\n*On an important side note, Bridgetown has a special place in my heart. Portland has been the hometown of my little brother for the last 10 years. He is what every little brother encompasses; your best friend and biggest enemy. He’s the only person who understands how crazy our parents are and has always been my rock when getting through tough family times. He is a psychotherapist who has never performed on a stage in his lifetime. He was a nerdy, introverted smelly kid with only 3 friends growing up. He blossomed into a successful, strong yuccie. Who happens to think he is funnier than me. There is nothing I want more than to take my brother’s virginity. On stage. In front of all his friends. Well, you know what I mean…. \r\n\r\nI think the Brother Bridgetown Virgin Sacrifice would be my best sacrifice yet. It would be an honor to be a part of the festival and sacrifice a few local Portlanders. It’s a huge dream for me to be included in something so great and respected in the comedy community. I truly appreciate your consideration. \r\n\r\nThank you.\r\n\r\nNicole Blaine\r\n",
  "copy": "Created and produced by husband and wife team Mickey and Nicole Blaine, Virgin Sacrifice is a live stand-up comedy show that features headlining comics and one ordinary person, the “Virgin.” Past comics on the Virgin Sacrifice stage include Howie Mandel, Damon Wayans, Jeff Garlin, David Koechner, Kevin Pollak, Pete Holmes, Andy Kindler and Bryan Callen, as well as fan favorites from television and movies. After a night of comedy from the pros, the Virgin takes the stage. Despite varying backgrounds: from medicine, real estate and bartending, to law, graphic design and more, each Virgin shares a quick wit and the courage to face their fears. The Virgins rehearse and prepare for months before confronting this once-in-a-lifetime opportunity. \r\n\r\nDifferent than traditional comedy club shows, Virgin Sacrifice provides a nurturing environment for people out of their comfort zones. After the professional comics perform, they each talk to the Virgin, offering them advice and sharing stories of their own first performances. The audience consistently supports and encourages the Virgin, resulting in a successful performance and unforgettable adrenaline rush.\r\n\r\nProducer and host, Nicole Blaine, gives you a glimpse into the ordinary lives of ordinary people as they do something extraordinary: perform stand up comedy alongside the best comics in the business. Blaine is “a remarkable performer with brains, beauty and rich comic delivery,” reported LA Weekly.  She has been a featured stand-up comic on NBC’s Today Show and E’s That Morning Show.  She has been part of Boston’s Women in Comedy Festival, performing alongside Jane Lynch and Lily Tomlin, and the International FringeNYC Festival. Her honest (and crass) observations showcase her (according to Backstage West) “humor, passion, dazzling charm and a naturalness that many performers, or even civilians, would kill for.” \r\n\r\n“Arguably, the best stand-up show in L.A. It’s sad, really, that Nicole’s able to take someone who’s never done stand-up before and make them look this good. We schlep and we grind, and she somehow fairy godmothers a Virgin into a headliner. And then there’s also a famous headliner. This show has too much.” (Sean Casey, Westside Comedy Theater)\r\n\r\n“Nicole says it’s a chance for someone to do stand-up for the first and last time. But the crowd and show are so supportive… She may not know she’s creating a monster. Or another great stand-up comic. Same thing.” (Jackie Kashian - @Midnight, Conan)\r\n\r\n“I enjoyed myself considerably more than I thought I would, or should have.” (Kevin Pollak - The Usual Suspects, Mom)\r\n\r\nTickets have sold out for every Virgin Sacrifice since its inception in July, 2013. For more information visit www.VirginSacrificeShow.com. ",
  "pageUrl": "11826-virgin-sacrifice",
  "iTunesUrl": ""
}