{
  "id": 11831,
  "events": [],
  "name": "The Workout Room",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/workoutroom.jpg",
  "photoUrl": "/api/img/show-images/show-theworkoutroom-300x300.jpg",
  "sortOrder": 9999,
  "bio": "&quot;The Workout Room&quot; is the brain child of Greg Edwards (star of the YouTube series &quot;Thug Notes&quot;), but is produced by several LA comedians.  The theme is &quot;new material only,&quot; which sounds super risky, but because we book great comedians (as does your festival), we find it has led to some amazing nights where sometimes the comics would all randomly stick to one theme based on something the host mentioned, sometimes the comics would do a slew of new jokes or stories they wrote for that one show, and sometimes comics would work on something that wasn&#039;t even technically comedy and get super real.  The theme presents a challenge, but also a relief to the comedian - while yes, they&#039;re not doing their &quot;A-list&quot; sets, they&#039;re also free from the pressure of all that comes with it, and this ultimately creates an engaging and beautiful atmosphere for both the comedians and the audience, as everyone gets to be on the &quot;ground floor&quot; of a joke writing process.  \r\n\r\nThe show has always been great, but has potential to be amazing drawing from a stellar Bridgetown lineup.  A favorite show in the LA scene, It used to run from the backyard of Leah Kayajanian (one of the producers).  Since it was forced to move (aka Leah&#039;s eviction), the show has popped up randomly around LA because friends of the show offer up their spaces.  No matter where and when we pop up, the show always brings a devout following of comedians and friends.\r\n",
  "copy": "Want to see your favorite comedians get those big laughs, even without their A-list material?   The Workout Room challenges our comics with just one theme: NEW MATERIAL ONLY.  Untested.  Unfiltered.  Fresh.  Real.  Comedy fans get a chance to see some of the best comedians in the business on the ground floor of their joke writing process.",
  "pageUrl": "11831-the-workout-room",
  "iTunesUrl": ""
}