{
  "id": 11860,
  "events": [],
  "name": "Death of Glitter : Genderf#ck Cabaret",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/deathofglitter.jpg",
  "photoUrl": "/api/img/show-images/show-deathofglittergenderfckcabaret-300x300.jpg",
  "sortOrder": 9999,
  "bio": "Death of Glitter: Genderf#ck Cabaret was created in 2015 by Jayson &quot;Alanna&quot; Giardinelli and Lisa &quot;Delta Flyer&quot; Quiriconi as a way to raise funds for Portland-based non-profits that support non-gender conforming folks. Combining drag, comedy, acrobatics, and music, Death of Glitter is a down and dirty, hilarious cabaret for a cause. We have raised money for the following groups: TransActive (support for transgender youth), Bradley Angle (serving victims of domestic violence), AIDS Walk Portland, SAGE (resources for LGBTQ seniors), and more. \r\n\r\nHosted by Delta Flyer, the show is an outlet for performers of various experience levels and gender expressions. The show has packed the show room at Crush Bar consistently, and is now the club&#039;s featured event every second Saturday of the month. Our Facebook group (https://www.facebook.com/groups/1522233011371007/) is over 200 members strong, and are an engaged and loyal audience. We get a lot of &quot;repeat customers&quot; at each show, and each performer has fans who get super excited to see their favorite perform. Usually we encourage the audience to throw tips for the performers, but if we get into Bridgetown Comedy Festival, we won&#039;t do that if it seems like it would be out of place. Bridgetown would be an amazing opportunity to add some glitter to the festival, and to increase exposure for the show to get even more audience members to help donate to good local causes. The drag and cabaret we do is funny, not strictly glamorous, and Delta keeps the flow with comedy, improv, and crowd work.\r\n\r\nWe have a resident DJ to do music cues, but we are open to using house crew if needed. The beauty of our show is that we can customize and change the length as needed. We&#039;re usually an hour show, with a 15 minute intermission for costume changes, but we can cram a lot into a half an hour if we are placed in a showcase with other shows/performers. We&#039;re flexible!\r\n\r\n**please note, Sunday 6/5 is the only day the entire cast is available. We cannot perform any other day :(",
  "copy": "Death of Glitter: Genderf#ck Cabaret was created in 2015 by Jayson &quot;Alanna&quot; Giardinelli and Lisa &quot;Delta Flyer&quot; Quiriconi to raise funds for gender non-conforming non-profits in Portland, and surrounding areas.  Combining drag, comedy, acrobatics, and music, Death of Glitter is a down and dirty cabaret for a cause.\r\n\r\nOur MC, Delta Flyer, is a sassy stewardess who will get your tray tables up, because you&#039;re headed for some glittery turbulence!  From the deep, deep, sea comes our lovely pirate wench, Darcy Blows. Drink up, me hearties, for she has surfaced for her weekly mating frenzy.  Narcissistic space babe Mars is an intergalactic scientist sent here to study human anal pollination. Originally from the 9th circle of Hell, the vile demon, Anastasia Euthanasia, was summoned here via an Ouija board at a middle school slumber party. Judy Precious is a canasta-playing senior citizen by day, but by night she becomes an exotic, erotic, private dancer. And, finally, be amazed by the strength and skill of Death of Glitter’s Acro-Yogis, who are twisted in the most beautiful way. We are full of surprises, so there may even be some special guests!\r\n\r\nEvery second Saturday of the month at Crush Bar, the cast of Death of Glitter will fulfill your dreams with screams and queens!",
  "pageUrl": "11860-death-of-glitter--genderfck-cabaret",
  "iTunesUrl": ""
}