{
  "id": 11883,
  "events": [],
  "name": "Bad News LIVE",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/bnpromo.jpeg",
  "photoUrl": "/api/img/show-images/show-badnewslive-300x300.jpg",
  "sortOrder": 9999,
  "bio": "Hey Bridgetown! Bad News LIVE, here...your #1 show in indie political comedy.  Chuck Ludwig, professional devil&#039;s advocate and host of Bad News, presents an irreverent comedy show featuring a rotating panel of guest comedians from across the political spectrum. (We&#039;d be happy to feature comedians on the panel who will be performing at the festival.) Panelists riff on trending topics in news, politics, current events, and pop culture. Whether it’s the latest gaffe from a presidential candidate or real talk about gun violence, every episode proves that “we’ve got issues.”  And comics. And comics WITH issues!\r\n\r\nChuck and the panel don’t try to solve our most pressing problems, but they&#039;ll make fun of them until someone more qualified does. Combining elements of The Daily Show, Tough Crowd, Politically Incorrect, and Chelsea Lately,  Bad News has something for every news geek and pop culture freak: comedic monologues, panel discussions, satirical sketches, interactive games, correspondent segments, and our signature Good News/Bad News that closes each show. \r\n\r\nA typical run of show looks like this:\r\n- Opener/audience warm up comic (12-15 min)\r\n- Host introduces show to audience; monologue (Chuck Ludwig: 3-5 min)\r\n- Panel. Chuck introduces panel to audience; will ask the comics 5-7 questions on the provided topics (politics, news, current events, pop culture). We encourage comics to prepare some jokes in advance (or use jokes from your act) but have found the real gold comes from riffing off each other and the host in the moment. (Panelists: 40-45 min)\r\n- Roll pre-recorded sketch for the audience (3-5 min)\r\n- Chuck leads the panel in an interactive game (Chuck and Panelists: 5-7 min)\r\n- Bad News/Good News Outro (Chuck: 2-3 min)\r\n\r\nBad News is filmed live each month in front of sold-out studio audiences at the famous ACME Comedy Theater in Hollywood, California. Comic panelists have included: \r\n- Adam Yenser (Emmy Award-winning writer for Ellen) \r\n- Thomas Dale (E&#039;s Chelsea Lately, Comedy Central’s Adam Devine’s House Party) \r\n- Aida Rodriguez and Zainab Johnson (NBC’s Last Comic Standing)\r\n- Dave Merheje (Just For Laughs)\r\n- Joe Dosch and Olivia Grace (The World Famous Comedy Store’s Roast Battle)\r\n- Marcella Arguello (Carson Daly) \r\n- Neel Nanda (Oxygen&#039;s Funny Girls) \r\n- Laura Crawford (Boston Comedy Festival)\r\n- Alex Hooper (Nerdist&#039;s The Meltdown with Jonah &amp; Kumail, NBC&#039;s New Girl) \r\n- Teddy Tutson, Ed Greer, and more hilarious comedians without TV credits! (Humblebrag: We are super excited to have Ian Edwards on the show in March.)\r\n\r\nNamed one of 38 Awesome Things to Do in Los Angeles by “We Like LA” (October 2015), the broad appeal of Bad News attracts educated, urbane, tech-savvy viewers from 18-36 who are in tune with the latest trends in comedy, current events, and the endless search for truth.\r\n\r\nBad News LIVE is brought to you by Executive Producers and Co-Creators Chuck Ludwig and Julianne Simitz.\r\nWritten by Chuck Ludwig, Shaan Joshi, and Julianne Simitz.\r\nDirected by Ward Swan. \r\nProduced by Daniel Judd.",
  "copy": "Bad News LIVE...join us for a live taping of the #1 show in indie political comedy.  \r\n\r\nCome hang as Chuck Ludwig--professional devil&#039;s advocate and host of Bad News--presents an irreverent comedy show featuring a rotating panel of guest comedians from across the political spectrum. Panelists riff on trending topics in news, politics, current events, pop culture, and more. Whether it’s the latest gaffe from a presidential candidate or real talk about gun violence, every episode proves that “we’ve got issues.”  And comics. And comics WITH issues!\r\n\r\nChuck and the panel don’t try to solve the most pressing problems of the day; they&#039;ll just make fun of them until someone more qualified does. Combining elements of The Daily Show, Tough Crowd, Politically Incorrect, and Chelsea Lately,  Bad News has something for every comedy fan, news geek, or pop culture freak: comedic monologues, panel discussions, satirical sketches, interactive games, correspondents’ segments, and our signature Good News/Bad News tag that closes each show. \r\n\r\nNamed one of 38 Awesome Things to Do in Los Angeles by “We Like LA” (2015), join us in our live studio audience as Bad News brings the grit and glam of Hollywood to Hawthorne.\r\n",
  "pageUrl": "11883-bad-news-live",
  "iTunesUrl": ""
}