{
  "id": 11934,
  "events": [],
  "name": "We Watch Wrestling Podcast",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/www_-_copy.jpg",
  "photoUrl": "/api/img/show-images/show-wewatchwrestlingpodcast-300x300.jpg",
  "sortOrder": 9999,
  "bio": "Every pro wrestling podcast is either a review &amp; recap show, a news &amp; rumor show or a retro &amp; nostalgia show. They have snarky hosts and bad attitudes. We Watch Wrestling is none of that. We keep it positive and we keep it fun. At it&#039;s heart this is a comedy show. Three friends, all comedians who have performed at Bridgetown individually, discuss what it&#039;s like to be a wrestling fan today. One host is a brand new fan, so an aspect of the show is explaining wrestling to him. We hear from a lot of listeners that don&#039;t watch wrestling, they just love our dynamic, quite a few have even become wrestling fans because of us.\r\nSome listeners are lapsed fans with a reignited interest in the product. And a lot of our subscribers say they&#039;re not embarrassed to tell people they watch pro wrestling anymore because of us. The show is totally spontaneous, we tell stories, do voices, and have a lot of fun. It&#039;s just a very conversational, very funny and very honest, heartfelt show. We have achieved half a million downloads to date, have thousands of followers on Twitter and Facebook and a significant following in the pacific northwest. Please find links included to Issue #69 featuring some of the funniest moments from 2013-2014\r\n(WeWatchWrestling_Issue_69_Best_Of_WWW.mp3) and Issue #104 featuring popular recurring segment &quot;Asking Drive-Thru Clerks Who&#039;s Their Favorite Wrestler&quot; (WeWatchWrestling_Issue_104.mp3)(48min 35sec in), a segment we would very much love to do in Portland, a city with a rich history of pro wrestling and pro wrestling fans. Past guests have included Ron Funches (#116), Dan Soder (#33), and former WWE world champ Dolph Ziggler (#51).\r\n",
  "copy": "We Watch Wrestling is Matt McCarthy (Conan, Pete Holmes Show), Tom Sibley (BBC America), and Vince Averill (Comedy Central). Three standup comedians who watch wrestling. Vince is a lifelong fan and an encyclopedia of wrestling knowledge, Tom just started watching wrestling at age 30, and Matt is a former WWE writer who still thinks wrestling is real. You don’t even have to watch wrestling to like We Watch Wrestling, it’s a celebration, an education, and an honest account of how it feels to be a professional wrestling fan, for better or worse.",
  "pageUrl": "11934-we-watch-wrestling-podcast",
  "iTunesUrl": ""
}