{
  "id": 11960,
  "events": [],
  "name": "Infauxmation!",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/infauxmation_sexpot.jpg",
  "photoUrl": "/api/img/show-images/show-infauxmation-300x300.jpg",
  "sortOrder": 9999,
  "bio": "Infauxmation! is an improv show with three comedian panelists riffing on the lighter side of the news. Bizarre stories from legitimate sources like Vice, the BBC, CNN and the Huffington Post have ranged from Christian body building swingers to extraordinary drug mishaps to whatever the hell happened in Florida this week. So whether you’re a news junky who’s tired of the doom and gloom of the front page or just a lover of comedy, Infauxmation! is guaranteed to bring you laughs.\r\n\r\nEvery show features brand new stories and one-time-only material from the panel of comedians. In addition to commentary on news stories, over the course of the 90-minute show each of the three comedian panelists does a seven-minute set, producer and host Brent Gill highlights three especially strange stories, and the audience has a chance to actually meet one of the news makers themselves…or at least a comedian’s impersonation of one. \r\n\r\nIn its home state of Colorado, each showing of Infauxmation! draws an audience of about 150 young to middle-aged professionals looking to escape the weight of the day’s news. Infauxmation! is a mainstay at the Denver Comedy Works, and travels to it’s other home in New York at The Creek and the Cave every fifth Friday. The show features the best industry comedians which have included The Grawlix (Adam Cayton-Holland, Ben Roy, and Andrew Orvedahl), Nick Vatterott, Ben Kronberg, Andy Sandford, and Sam Tallent. \r\n\r\nLook no further for a show with the feel of Chelsea Lately, the integrity of The Daily Show, and the crass hilarity of @Midnight.",
  "copy": "Infauxmation! is the Denver based improvised comedy show featuring a panel of comedians riffing on the lighter side of the news. Join host Brent Gill, a panel of comedians, and an occasional topical guest as they analyze the week’s headlines, jab at their favorite stories, and pretend to know more than they do.\r\n\r\nIf Chelsea Lately got knocked up in a threesome with @Midnight and The Daily Show, Infauxmation! is their lovable bastard child.\r\n\r\nLike the news but hate the negativity? Tired of being bombarded by stories about death, destruction, and disease? Ever read a headline and think, is that a real news story? Then this show is right up your alley. From Christian body building swingers to extraordinary drug mishaps to whatever the hell happened in Florida this week. So whether you’re a news junky who’s tired of the doom and gloom of the front page or just a lover of comedy, Infauxmation! is your go-to source for the second-page news. Come laugh with four funny friends joking their way through some of humanities more ridiculous moments.",
  "pageUrl": "11960-infauxmation",
  "iTunesUrl": ""
}