{
  "id": 12030,
  "events": [],
  "name": "2 Girls 1 Pup",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/monique_and_comet_1yr.jpg",
  "photoUrl": "/api/img/show-images/show-2girls1pup-300x300.jpg",
  "sortOrder": 9999,
  "bio": "2 Girls 1 Pup is the comedy show you can bring your dog to! Normally set in a pet store, it was recently named one of the &quot;10 Best New Standup Shows in LA&quot; by LA Weekly and is appearing at Riot LA this year. We&#039;ve been getting all sorts of write ups on sites like Interrobang, Comedy Cake, LA Weekly and in dog publications like This Dog&#039;s Life. Point is, we&#039;ve hit on something! It&#039;s not just a cutsey comedy show in a pet store; it&#039;s really funny and smart comedy that happens to be one you can take your dog to. It&#039;s perfect for a market like Los Angeles... or Portland. The show includes standup (appearances have included Ian Karmel, Iliza Shlesinger, Beth Stelling, Baron Vaughn, Dave Anthony, Jake Weisman, Sara Schaefer, Janine Brito, Debra DiGiovani and more), as well as variety acts like pet psychics, magicians (Justin Willman is a huge fan!), characters and more, as well as themed games and segments. It&#039;s hosted by Monique Madrid (All Jane No Dick, Second City, Splitsider) and a guest co-host (the &quot;other girl&quot;) and portions of every show go to a local animal rescue, so it&#039;s a cool way to reach out and make a difference in the community. Every 2 Girls 1 Pup event includes a pre-show red carpet with PUParazzi for the dogs and their two-legged humans to pose on, as well as raffle prizes from local businesses with a portion of the proceeds going to that local animal charity. A Bridgetown Festival show could be hosted by just me (which I often do) or co-hosted by a local woman in the comedy scene. Sometimes (like with Riot) we have a house band - an amazing acoustic duo &quot;Kindred Throats.&quot; This isn&#039;t a must-have, but they&#039;re an awfully fun addition!\r\n\r\nAudiences literally thank me for giving them an event they can bring their dogs to after every performance. It&#039;s not just a show, it&#039;s an event. And it&#039;s an absolute blast! Plus, it&#039;s also a weekly podcast (recently mentioned in Splitsider!), so I&#039;d love the opportunity to interview local dog celebrities, dog-friendly businesses, and other dog-related experts in the Portland area to feature on the PUPcast. It&#039;s fairly easy set up in terms of tech because really all we need (besides mics) is a dog-friendly venue. Beyond that, we&#039;re used to performing in a pet store, so any stage is a luxury!\r\n\r\nP.S. I have so many more awesome photos to share if you&#039;re interested! \r\nP.S.S. The number of performers on the stage would depend on if we had the house band, and if our variety act was one person or a group, so the amount listed below is an estimate. \r\nP.S.S.S The number of crew would also either be 2 as listed or possibly 3 if we were able to bring our PUParazzi. But it&#039;s not a MUST. ",
  "copy": "2 Girls 1 Pup is the comedy show you can bring your dog to! Recently named one of the “10 Best New Stand-Up Shows in L.A.” by LA Weekly, the comedy/variety show features hilarious dog-loving comics, themed games, raffle prizes and more. Hosted by producer Monique Madrid (Riot LA, The Second City, Splitsider), Comet the Pup, and a guest female co-host, audiences are highly encouraged to bring their own dogs to the show. Plus, join us for the pre-show red carpet event - PUParazzi included! Portions of the ticket sales benefit a local animal shelter. Also check out 2 Girls 1 Pup’s weekly PUPcast, featuring comedians talking about their four-legged friends, as well as special interest dog-guests like groomers, pet psychics, vets and Hollywood animal trainers. New episodes come out every Monday on iTunes and Stitcher.",
  "pageUrl": "12030-2-girls-1-pup",
  "iTunesUrl": ""
}