{
  "id": 12044,
  "events": [],
  "name": "Sup Doc Podcast",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/supdoclogo1400x1400.jpg",
  "photoUrl": "/api/img/show-images/show-supdocpodcast-300x300.jpg",
  "sortOrder": 9999,
  "bio": " At this point and as far as we can tell we are the only comedy/discussion/interview podcast devoted to documentaries. We have a loyal following and have listeners all over the world. We have now recorded 2 LIVE shows and they both went very well. We screen a doc (both have been 30 min docs) and have a panel of 3 interesting people (in this case comedians) to discuss it. Our last LIVE show was recorded in SF Sketchfest 2016 with comedians Emily Heller, Chris Thayer and David Gborie. \r\n\r\nIt&#039;s interactive too because we can take questions from the audience. People love documentaries and comedians so it&#039;s a great mix! \r\n\r\n",
  "copy": "‘Sup Doc, is a biweekly podcast devoted to discussing documentaries, and the show’s hosts, comedians Paco Romane and George Chen, deconstruct current and classic documentaries with guests as varied as the documentaries they cover.\r\n\r\nHere are just a few or our guests and the docs we have discussed:\r\nComedian Todd Glass about Religulous (the Bill Maher doc)\r\nComedian/performer Jamie DeWolf, great grandson of L. Ron Hubbard, about Going Clear: Scientology and the Prison of Belief\r\nMaximum Fun/Bullseye’s Jesse Thorn about Errol Morris’ Fast Cheap and Out Of Control\r\nBrent Hodge the director of I Am Chris Farley. \r\nMusician Dan Deacon about The Rolling Stones doc Gimme Shelter\r\nComedians Emily Heller, Chris Thayer, David Gborie about Heavy Metal Parking Lot (recorded LIVE for SF Sketchfest)\r\nComedian/Musician Stephe Lynch about Smashing Machine.\r\nDrummer/Musician for Jawbreaker Adam Pfahler about Montage of Heck: The Kurt Cobain doc.\r\nand more!\r\n\r\n&quot;Quality premise and production out of the gate&quot; - CourtingComedy.com \r\n“…These guys are super funny and I really like listening to their stories and conversations. Check it out!…” – iTunes review\r\n“…Kudos to Paco and George for this brilliant idea…” – iTunes review\r\n“…a must listen if you enjoy documentaries…” – iTunes review\r\n“…Comics and docs, great combo…” – iTunes review\r\n“…amazingly in-depth and hilarious…” – iTunes review\r\n“…comedic, well-versed conversations about documentaries…” – iTunes review\r\n&quot;...even when I haven&#039;t seen the films this podcast is entertaining...&quot; - iTunes review\r\n\r\nPaco Romane was twice voted Best Comedian in SF, and has appeared in numerous national commercials, films and plays. He is the producer of one of San Francisco&#039;s longest running comedy shows The Romane Event.\r\nGeorge Chen is a writer and comedian who has performed at SF Sketchfest, Put Your Hands Together, Huebel and Scheer’s Crash Test, The Porchlight Storytelling Series, and SFMoMA. Producer and engineer Will Scovill also engineers the podcasts Tales From The Swan Hotel and Give Me Fiction.",
  "pageUrl": "12044-sup-doc-podcast",
  "iTunesUrl": ""
}