{
  "id": 12056,
  "events": [],
  "name": "Dawson&#039;s Queef Presents: Are You Afraid of the Dark?",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/dq_afraid-of-the-dark_oct2015.jpg",
  "photoUrl": "/api/img/show-images/show-dawson039squeefpresentsareyouafraidofthedark-300x300.jpg",
  "sortOrder": 9999,
  "bio": "Hi Bridgetown,\r\n\r\nThis is Mat Montgomery, sound- &amp; fogman for Dawson&#039;s Queef. Going into this pitch, &quot;DQ&quot; as they&#039;re telling me to abbreviate as such, wanted a more objective viewpoint on their &quot;Are You Afraid of the Dark?&quot; show submitted for your approval. As their emotionally removed technician, I&#039;m here to provide it, fully aware I am too a beneficiary in the event DQ gets booked for the 9th annual Bridgetown festival.\r\n\r\nFor most of &quot;Dawson&#039;s Queef Presents: Are You Afraid of the Dark?,&quot; it feels just like the Nickelodeon show. From the textbook variety of preteens surrounding the campfire, to the highly predictable reveals and overcooked dialogue, it’s an uncanny revival completely improvised and initiated with an audience suggestion. Inevitably, the true essence of Queef filters in. A relationship turns abusive, jokes heighten five-fold, and tones shift wildly. What was once an innocently spooky story goes amok with eroticism, anger, and unadulterated good cheer. Of course, I accompany the whole thing with bone-chilling sound design that the performers can only hope to justify on the fly.\r\n\r\nThese are all tenets of our original format as a troupe: a long-form improvised teenage dramedy that goes after 90s/early millenium teen shows such as The O.C., Degrassi, and Dawson&#039;s Creek (of course). The whole result becomes something closer to Strangers With Candy, or The Lonely Island’s The Bu, two shows that brought the members&#039; comedic sensibilities together when the six of them began performing as college freshman in 2008. As soon as we realized how much of a blast everyone was having with the improvised teen drama, we couldn’t resist tackling other episodic shows of rote structure within different genres. After “Law and Order,” “Seinfeld,” and “Game of Thrones”, it’s now time to ask Bridgetown, “Are you afraid of the Queef?” \r\n\r\nWe hope you enjoy the live spookfest we submitted herein. It should speak for itself. There&#039;s also our original scripted &quot;Dawson&#039;s Queef&quot; pilot on FunnyorDie for you to check out here: http://FunnyOrDie.com/m/9j10\r\n\r\nDawson&#039;s Queef is comprised of Ben Backhaus, Michael Margetis, Michael Skarsten, Sam Lowy, Tyler Thursby and me (sound &amp; fog), all currently residing and performing in the Phoenix, AZ area [save us from the inexorable Sonoran heatwave].\r\n\r\nNote: The five members of DQ will be the only performers in the show, but are open to having a fellow Bridgetown comedian open/host the show, or even join in on the improv towards the end for a lightning-fast episode [thus we put down 1 opening below for other performers].\r\n\r\nThanks for your time &amp; heart,\r\n\r\nMat",
  "copy": "Dawson&#039;s Queef is an improvised teen dramedy that takes all the awkward hormonal tropes from 90s teenage TV canon [Boy Meets World, 7th Heaven, Dawson&#039;s Creek] and packs them into a high-energy long-form narrative show. Their &quot;Are You Afraid of the Dark&quot; show takes a spooky turn as the performers gather &#039;round the campfire to tell a scary story, then recreate it live alongside music cues ad libitum!\r\n\r\nDawson&#039;s Queef spawned in Tempe, Arizona in June 2011. In addition to monthly shows across the Phoenix area, Queef has gone on to perform showcases at the 2012 UCB Del Close Marathon, Second City Hollywood, and M.i. Westside Theater in Santa Monica. Queef has also performed a variety of other themed improvised live shows that go beyond &quot;Are You Afraid of the Dark?&quot; and the WB catalogue, including &quot;Law &amp; Order&quot;, &quot;Seinfeld&quot;, and &quot;Game of Thrones.&quot; But regardless of format, the performers bring a subversive edge and emotive commitment to the proceedings that is singular to Queef.\r\n\r\nDawson&#039;s Queef is Ben Backhaus, Michael Margetis, Michael Skarsten, Sam Lowy, Tyler Thursby and Mat Montgomery (sound &amp; fog).",
  "pageUrl": "12056-dawsons-queef-presents-are-you-afraid-of-the-dark",
  "iTunesUrl": ""
}