{
  "id": 12063,
  "events": [],
  "name": "Recycled Babies Sketch Comedy",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/img_0788.jpg",
  "photoUrl": "/api/img/show-images/show-recycledbabiessketchcomedy-300x300.jpg",
  "sortOrder": 9999,
  "bio": "I would also love to pitch a Recycled Babies  show for Bridgetown . (possibly a blend of sketch, stand-up, and video pieces, or just members doing stand up interspersed with RB Videos) . \r\n\r\nSome of our members (such as Dwayne Perkins) have performed at Bridgetown before,  and one of our members (Samantha Ketcherside) has very strong roots in the Portland area and would literally pack these shows!   \r\n\r\nBelow  is a one sheet regarding the group.  Recently we were finalists at Seattle Sketch Fest , shot a promo piece for Paint Care, appeared at Sketchmelt at Meltdown, perform regularly at the Comedy Central Stages,  and are up for our own new media series with football.com (Demos can be sent) \r\n\r\nWhat I picture for the show could be very simple. \r\n\r\nIntro or Cold Open Sketch\r\nVideo\r\nStand up piece\r\nStand up piece\r\nVideo\r\nStand up Piece\r\nStand up Piece\r\nVideo \r\nClosing sketch.\r\n\r\nThis is a similar format the we used for our summer spectacular at the CC stages and it seemed to go over well.  We can simply  do straight stand up and show some of our videos, or  we can  write a show based around bridgetown to give a full through  line for the show.\r\n\r\nThe Stand up performers who would perform would be Dwayne Perkins , Ian Harris, Michael Magid, and Claude Stuart. (Note instead of members you could fill these slots with festival attendees and just play RB videos in between or  a combo of both. pretty flexible :)     \r\n\r\nThanks for taking the time and look forward to hearing from you! \r\n\r\nSincerely, Recycled Babies\r\n\r\n\r\n\r\n",
  "copy": "Recycled Babies is a silly sketch comedy squad with a “dark” heart. The group blends loveably damaged characters in somewhat familiar situations skewed to the absurd and twisted. The intertwined universe where these sketches live allows the funny to come before the conscience.\r\n\r\n \r\n\r\nThe cast of Recycled Babies is a blend of established and rising stand-up comedians, actors and comedy writers.",
  "pageUrl": "12063-recycled-babies-sketch-comedy",
  "iTunesUrl": ""
}