{
  "id": 12060,
  "events": [],
  "name": "Comedy in English",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/fahimhostelpacked.jpg",
  "photoUrl": "/api/img/show-images/show-comedyinenglish-300x300.jpg",
  "sortOrder": 9999,
  "bio": "The show&#039;s concept is pretty simple. 3 comedians (4 if you include myself) perform 15 minutes in front of an intl. crowd (pref ESL) to see if their material is truly universal and can cross cultural and language barriers :) (\r\n\r\nSome examples of Past Comedians include:  Asif Ali (Star of Mr. Robinson on NBC), Jay Montepare (Host of HGTV&#039;s Ellen&#039;s Design Challenge), and Dwayne Perkins (Comedy Central Presents Dwayne Perkins) etc.) \r\n\r\n(Note: I tend to do between 20-45 at the end of the night depending on how good the crowd is, but that can be adjusted and not necessary for the festival)  We&#039;ve been averaging between 25-40plus (which holds about 50 at most) in the room depending on the week, and it&#039;s almost 99 percent so far been from the guests of the hostel.\r\n\r\nIf the festival were to be interested in the concept; I would suggest doing it as a partnership with the Hosteling International Location in Portland. Either doing the show there , or bussing in hostel guests to retain the authenticity of the theme. Could be great cross promotion between Bridgetown and HI!  If HI would not be interested; then I&#039;m sure another Hostel in the area would be as HI does not own the intellectual property. \r\n\r\nFinally ; we are also working a couple established producers on an agreement to develop the show as a new media series, and have already drawn interest from several aggregators to live stream the concept in the near future.  If said deal is in place prior to the festival; we would be interested in filming some of the episodes at the festival if that so interests you. \r\n\r\nBelow is our upcoming Feb Schedule. Thanks for taking a look and look forward to hearing from you!\r\n\r\nSincerely,\r\nMichael Magid\r\n\r\n\r\nTues Show\r\n\r\n2/2-  Dave Ross (IFC&#039;s Women)    , Marcella Arguello (  Carson Daly)  , Merril Davis (  Girls Behaving Badly)   (guest set Sammy Obeid  Conan O Brien)\r\n\r\n2/9-  Paige Weldon (The Meltdown at Nerdist) ,  Whitmer Thomas (Workaholics) , Josh Nasar ( Sons of Anarchy )\r\n\r\n2/16- Chris Cope (Big Sky Comedy), Tim Vargulish (The Comedy Studio),  Nicole Blaine (Virgin Sacrifice)\r\n\r\n2/23-  Matt Ingebretson (Good Heroin)  David Rosenberg Note: This guy -http://www.rosie2000.tumblr.com/   ( Rosie2000)  ,  Jason Gillearn ( HBO&#039;s Aspen Comedy)\r\n\r\n\r\n\r\nSat Show\r\n\r\n2/6 - Karl Hess (Montreal&#039;s JFL)  , Simon Gibson (Chatterbox Comedy)   ,  Nadine Rajabi (Shaws of Sunset w Nadine)\r\n\r\n2/13-  Jake Weisman (IFC&#039;s Women), Greg Santos (The Muppets)   ,  Lou Perez (Impractical Jokers)\r\n\r\n2/20   Michael Monsour (Cap City Comedy) , Michael Mattera (Camp) ,  Danny Lobell (Maron&#039;s WTF)\r\n\r\n2/27- Grant Lyon ( Comics Unleashed) , Johan Miranda (Chatterbox Comedy) ,  Julia Prescott (Mad TV)\r\n",
  "copy": "Comedy in English.  The Show is a concept show where 3 established comedians (as well as a host) attempt to perform 15 minutes in front of an international audience, and find out whether their material is truly &quot;Universal&quot;!  (Some examples of Past Comedians include:  Asif Ali (Star of Mr. Robinson on NBC), Jay Montepare (Host of HGTV&#039;s Ellen&#039;s Design Challenge), and Dwayne Perkins (Comedy Central Presents Dwayne Perkins) etc.)\r\nAdmission is Free, however donations are encouraged.\r\nHostelling International USA is a non-profit organization that has been promoting travel and intercultural exploration to people of all ages since 1934. HI USA is a member of Hostelling International, a network of 4,000 hostels in over eighty countries.\r\n",
  "pageUrl": "12060-comedy-in-english",
  "iTunesUrl": ""
}