{
  "id": 12147,
  "events": [],
  "name": "Dave Maher Coma Show",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/comashow1_green4_601x800.jpg",
  "photoUrl": "/api/img/show-images/show-davemahercomashow-300x300.jpg",
  "sortOrder": 9999,
  "bio": "At the end of 2014, after a few years of mismanaging my Type I diabetes and abusing drugs and alcohol, I lapsed into a diabetic coma that lasted almost a month. After three weeks, my family came within a legal technicality of taking me off of life support. My friends and the comedy community in Chicago presumed I was dead and posted their eulogies of me on Facebook. Then I woke up. &quot;Dave Maher Coma Show&quot; is the story of that experience and its aftermath. The format of the show is about 50% storytelling, 40% stand-up and 10% theater. I tell the story chronologically but with a stand-up approach that keeps it from being maudlin or overly sentimental. There are several bits that break up the pace of a more traditional storytelling or stand-up show, like an awards segment in which I share the &quot;Best Eulogy&quot; and &quot;Worst Eulogy&quot; (among other categories I share like &quot;Most Awkward Interaction With an Acquaintance&quot;) and an intentionally rigged Q&amp;A game segment near the very end of the show that I call &quot;Better Questions.&quot; It&#039;s a fun, revealing, honest and hopefully enlightening show on a heavy topic unlike any other show I know. ",
  "copy": "During the late autumn of 2014, stand-up comedian Dave Maher was unwittingly hurtling towards a diabetic coma, which left him unconscious for several weeks. On November 13th,  he was pronounced dead (by his friends on social media), and upon waking up a few days later, he found himself like Tom Sawyer at his own internet funeral.\r\n\r\nIn his critically acclaimed one man show, &quot;Dave Maher Coma Show,&quot; Maher reflects on life and online death, plus all the jokes and questions spawned by his experience: What&#039;s the grossest part of coming out of a coma? What&#039;s the best way to flirt with nurses in physical rehab? What now?\r\n\r\n&quot;Dave Maher Coma Show&quot; appears after highly successful and regularly sold-out runs in late 2015 and early 2016 at the Annoyance Theatre in Chicago. Press for the show’s initial run was overwhelmingly positive; Nina Metz of the Chicago Tribune said the show’s &quot;free-form sensibility is smart and hooks you in, with low-key but very honest comedy,&quot; while Benjamin Cannon at Gaper’s Block raved that “it feels like nothing short of an essential act for both audience and its eponymous performer, benefiting from a lean, relaxed style that hearkens back to the long-form works of Spalding Gray.”\r\n\r\nAbout Dave Maher: Raised in Oklahoma and Cincinnati, Dave Maher is a Chicagoan of a dozen years and as many apartments. He has acted and improvised comedy around Chicago since 2008, including a glorious stint at the now-defunct Upstairs Gallery. In 2013, he transcended improv and realized that stand-up is where his brand of energetic, intellectual and autobiographical intensity fits best. He tells stories and jokes at shows around Chicago, and he hosts the live show and podcast Back of the Party that features &quot;intimate public conversations with comedians and other artists about art, work and life&quot; the second Saturday of every month at a record store/boutique shop called Transistor.",
  "pageUrl": "12147-dave-maher-coma-show",
  "iTunesUrl": ""
}