{
  "id": 12151,
  "events": [
    12750
  ],
  "name": "You Had to Be There",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/you_had_to_be_there_promo_pic.jpg",
  "photoUrl": "/api/img/show-images/show-youhadtobethere-300x300.jpg",
  "sortOrder": 21,
  "bio": "<p>The simple explanation of &quot;You Had to Be There&quot; is that each performer does their set on stage for the audience AND for a random person on the internet via the webcam chat program Omegle. It&#039;s a simple idea, but it&#039;s the strangers who pop up on screen who really make the show. It&#039;s called &quot;You Had to Be There&quot; because the individuals and personalities who consistently &quot;arrive&quot; from wherever they are in the world tend to be the most interesting and bizarre weirdos you could ever hope for in the name of entertainment. You have to see it to believe it. </p>\n<p>&quot;You Had to Be There&quot; is very much a group experience because of the audience&#039;s inherent desire to participate in something so strange and transient. This community aspect of the show (if the performer invites it) always enhances the fun. It fosters a kind of team environment where the performer and audience are together meeting a new person who they have a limited time to figure out and try to make their friend.</p>\n<p>Here&#039;s a list of memorable interactions from previous shows:<br />\n1. A 17-year-old kid was asked randomly if he played guitar. As if from nowhere, he produced an already plugged-in Gretsch that was sitting at his feet. He was then asked if he could play Crazy Train and he instantly started shredding the song and the entire audience sang along. After playing, he said, &quot;Wow, I&#039;m 17 and just got to play for a bar of 50 people in Omaha that I wouldn&#039;t have been allowed in otherwise. Thank you so much. You made my night.&quot; It was magical. It’s a comedy show, but it&#039;s also really uplifting at times and that&#039;s another reason why I love it.<br />\n2. Another time, a comedian was telling his jokes to a man on screen and one of his jokes was about purchasing tombstones. The man on screen reaches down m- again as if fro out of nowhere - and pulls out a miniature coffin. Turns out, one of his hobbies is whittling small coffins. The audience lost it. The very next joke was about leather fetishism. The man - once again from out of nowhere - reached down and pulled out his leather whip and proceeded to grab his webcam to show the audience a hole in his wall that he made the other night from &quot;fucking too hard.&quot; Again, the audience lost their minds.<br />\n3. Juggalo art show. No explanation needed.</p>\n",
  "copy": "<p>Q: What is this?<br />\nA: You Had to Be There is a live stand-up comedy show where comedians perform on stage in front of a live audience as well as a random/live/interactive internet audience on Omegle.com.</p>\n<p>Q: Will there be nudity like on literally every other web chat service?<br />\nA: Nudity is a possibility, which is why this show is only for adults who can handle that sort of thing. If a naked person happens to show up on screen, we&#039;ll make a joke about it and move on with our lives.</p>\n<p>Q: Why should I go?<br />\nA: If you like shared experiences that involve laughter and fun and don&#039;t mind watching unique shows where magical things happen, then you should definitely check it out. Omegle chats lead to interactions with diverse and interesting characters from all around the globe. You never know who will come on the screen next and that is hopefully not an innuendo.</p>\n<p>The stories people walk away with after this show are often incredible and sometimes plain unbelievable. Whether it&#039;s a foster kid shredding Crazy Train, a Juggalo art show, or a freestyle rapper who whittles miniature coffins, the things you&#039;ll see on this show are guaranteed to surprise and amaze. If you find yourself having trouble conveying to your friends how crazy this show really is, remember just to tell them: You Had to Be There.</p>\n",
  "pageUrl": "12151-you-had-to-be-there",
  "iTunesUrl": ""
}