{
  "id": 12187,
  "events": [],
  "name": "Kelly Anneken&#039;s Lack of Variety Hour",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/lovcartoon_0.png",
  "photoUrl": "/api/img/show-images/show-kellyanneken039slackofvarietyhour-300x300.jpg",
  "sortOrder": 9999,
  "bio": "This is the monthly cabaret show I run in Oakland, CA. Each month revolves around a theme, and I choose jokes and songs to perform based on that theme. So, for example, a theme of &quot;Marriage/Weddings&quot; featured jokes about my own wedding, weddings I have attended, how to hate-tweet a wedding without getting caught, and marriage in general, plus performances of the songs White Wedding (Billy Idol), Hotel Yorba (The White Stripes), and I Believe in Love (Hair).\r\n\r\nIn addition, I perform several segments that tie into a slideshow I build (like a TED talk, but not at all educational). These are typically topical jokes or they tie into the theme.\r\n-4 Minute Movie: An entire movie condensed into 4 minutes of dialogue, all performed by me. Previous features include Valley of the Dolls, Requiem for a Dream, and A League of Their Own.\r\n-Manifesto Destiny: I practice for my two dream careers, humorously naming nail polish colors and writing misleading movie descriptions for cable channel guides.\r\n-Fame Swap: I&#039;m tired of not being famous, so I choose a celebrity I believe I could easily replace.\r\n\r\nExample slideshow is here: http://prezi.com/utmvvjwtpxwt/?utm_campaign=share&amp;utm_medium=copy&amp;rc=ex0share\r\n\r\nWith each guest comedian, I offer a chance to participate in a &quot;Dream Interview.&quot; They reveal who they would most like to be interviewed by, and then I help them rehearse the questions they&#039;d like to be asked.\r\n\r\nAs a monthly show, I feature one comic, but for festivals, I feature 4 comics doing 10 minute sets, plus 5 minute interviews. The theme will likely be one we&#039;ve done before, and comics will be encouraged to tailor their sets to fit in with the theme. I also have an accompanist, Michelle Alexander, who plays piano and the source of witty, Paul Schaefer-esque banter. \r\n\r\nThanks so much for considering me--I would love to bring this show to Portland.\r\n",
  "copy": "Join comedian Kelly Anneken to enjoy an evening of... Kelly Anneken! Anneken sings, slings jokes, and showcases the comedy stylings of her lucky guest comedians. It&#039;s a night of delight for anyone who enjoys laughter, originality, Kelly Anneken, or all of those things.",
  "pageUrl": "12187-kelly-annekens-lack-of-variety-hour",
  "iTunesUrl": ""
}