{
  "id": 12191,
  "events": [],
  "name": "Naughty Bits",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/screen_shot_2016-01-31_at_7.44.05_pm.png",
  "photoUrl": "/api/img/show-images/show-naughtybits-300x300.jpg",
  "sortOrder": 9999,
  "bio": "Our premise is that we give comics sex and dating advice based on their jokes. We&#039;ve been running the show since 2014, and we consistently sell out our monthly show in a theater seating appx 80 people.\r\n\r\nOur polished show can be broken out into 3 segments:\r\n1) A pre-recorded theme song by comedic musician Megan Simon + intros\r\n2) &quot;Sex news:&quot; a weekend update-style segment where we project our favorite sex and dating themed headlines and tell jokes about them (Begins 2:20 in video)\r\n3) Comics + Advice: comics (typically 4, though we&#039;ve successfully run between 3 and 5) tell sex and dating themed jokes and then sit down with us for &quot;advice&quot; (riffing/chatting about the set). It&#039;s a format that allows for both really funny spontaneous moments, and also more sincere discussions of sex and dating. \r\n\r\nWe have a unique premise and a format that allows us to easily plug in festival performers. We recently got a great response when we did the show at Hell Yes Fest, and ran a successful privately booked tour through Dallas, OKC and Tulsa.\r\n\r\nOur favorite aspect of the show is that honesty comics often express during our interviews allows for riffing to hit even harder. An excellent example of this can be seen in our tape at 27:42 through roughly 33:25, in which OKC comedian Josh Lathe shares with us his real point of view on his parent&#039;s relationship and allows the audience to really get to know him on an emotional level, just before telling a number of hilarious stories pointing out the importance of separate bedrooms for flatulent couples.",
  "copy": "Naughty Bits is a stand-up and sex advice show based out of Austin, TX. Comedians tell their best sex and romance jokes while sexperts Ella Gale &amp; Katie Stone give pointers on their *ahem* performance. \r\n\r\nWhat to expect: jokes and riffs on current &quot;sex news,&quot; great planned stand up comedy, hilarious off the cuff moments, and some very real talk about sex and relationships. Audience members are drawn in by the emotional honesty of performers, allowing space for the next joke to hit them even harder in the gut.",
  "pageUrl": "12191-naughty-bits",
  "iTunesUrl": ""
}