{
  "id": 12226,
  "events": [],
  "name": "RED FLAGS by LAURELLY",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/fullsizerender.jpg",
  "photoUrl": "/api/img/show-images/show-redflagsbylaurelly-300x300.jpg",
  "sortOrder": 9999,
  "bio": "SHOW:\r\nLauren Pritchard and Kelly Vrooman are &quot;LAURELLY&quot;, one of the fastest, genuinely hilarious improv duos performing today. They are the current improv CAGE MATCH champions at the iOWest Theatre (45 weeks and counting)! Their two-gal improv show is inspired by a real life &quot;Relationship Red Flag&quot; provided by an audience member.  LAURELLY then launches the audience through a whirlwind roller coaster of story lines and crazy characters.  One minute, they may be playing a sweet father/daughter scene, and the next minute they&#039;re playing every member of a high school band marching to stop a disastrous wedding from happening at Brony Con.  The real wow factor comes in the way Kelly and Lauren jump into each other&#039;s characters - rotating the cast of many between the two of them. In the end, LAURELLY brings redemption to the audience member&#039;s relationship red flag and saves the day! You&#039;ll definitely want to get on this twisty, thrilling ride - and find out what the Los Angeles improv scene has come to know as the &quot;It Duo&quot;!  \r\n\r\nFORMAT: \r\nRED FLAGS begins with some quick warm up introductions, crowd work, and then a suggestion, leading into the aforementioned  30-40 minute RED FLAG epic.  We then want to invite one or two Bridgetown improv performers we have never worked with (especially a guy who is ready to play in this world) onto the stage for a mini game, a 15 minute Red Flag telenovela on stage.    NOTE: LAURELLY also can do a full MUSICAL version of this to up the ante.  In December 2015, they did a completely improvised Holiday musical that felt so perfect even me (the manager) thought they had to have sketched it out - but nope - every lyric (Lauren and Kelly are professional singers) was improvised.  It gave Dickens a run for their money.\r\n\r\nPERFORMER BIOS:\r\nLauren Pritchard - started improvising in FL with Wayne Brady as a fetus in 1991. She now performs in LA at Improv Olympic, ComedySportz and UCB. She was a regular cast member on season 14 of MADtv.  Lauren is currently recurring on Disney Channel&#039;s Stuck in the Middle, Gamers Guide, and Jessie. She has also appeared on numerous other TV shows and stars in the Film The Engagement Claus (Christmas 2016)\r\n\r\nKelly Vrooman - is currently the star of The Chica Show on Sprout/NBC Kids and the face of national spots for Bounty and Microsoft.  Kelly is also a cast member of the sketch group, Tiny Muscles, at The Pack Theatre in Hollywood and her writing has been featured in The Huffington Post and WomensHealth.gov. ",
  "copy": "RED FLAGS is a fast-paced improv show about all disastrous relationships starring Los Angeles team LAURELLY.  Lauren Pritchard and Kelly Vrooman are &quot;LAURELLY&quot;, one of the fastest, genuinely hilarious improv duos performing today. Their two-gal improv show is inspired by a real life &quot;Relationship Red Flag&quot; provided by an audience member.  LAURELLY then launches the audience through a whirlwind roller coaster of story lines and crazy characters based on this relationship headed for doom.  One minute, they may be playing a sweet father/daughter scene, and the next minute they&#039;re playing every member of a high school band marching to stop a disastrous wedding from happening at Brony Con. The real wow factor comes in the way Kelly and Lauren jump into each other&#039;s characters - rotating the cast of many between the two of them. In the end, LAURELLY brings redemption to the audience member&#039;s relationship red flag and saves the day! You&#039;ll definitely want to get on this twisty-turny ride - and find out what the Los Angeles improv scene has come to know as the &quot;It Duo&quot;!  \r\n",
  "pageUrl": "12226-red-flags-by-laurelly",
  "iTunesUrl": ""
}