{
  "id": 12239,
  "events": [],
  "name": "The Slide Show",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/slide_show_pic.png",
  "photoUrl": "/api/img/show-images/show-theslideshow-300x300.jpg",
  "sortOrder": 9999,
  "bio": "The Slide Show presents a challenge to performers, create a funny story on stage utilizing the images projected on the screen behind them. The performer has 30 seconds to preface their story before the slides start, then eight random images (from a group of over 500 images) are projected on the screen for thirty seconds each, and then they have thirty seconds at the end to wrap up their story. The show is a lot of fun for the performers as they each try to come up with a unique framing for their story (things like: a person laying out their presidential platform, explaining a movie they just saw, relaying a crazy night out, telling a bedtime story, etc.) as well as fit the images into the context of what they are talking about. Often, there are sublime moments of synchronicity where images seem to pop up perfectly timed to what the person is saying. These moments are incredible, unique experiences for both the performer and the audience. \r\n\r\nThe show is great for performers because it requires no advanced preparation and does not require them to burn any material. I usually perform the show with 10 other comics and myself hosting which takes about 70-75 minutes (each set is exactly six minutes because of the timing of the slides) but it can be done with up to 14 people and still be completed in 90 or so minutes. \r\n \r\nThe Slide Show is one of the shows that has grown out of QED Comedy Laboratory, an experimental comedy show that I created and run with a different theme every week. We have staged this show a few times there as well as at the Scruffy City Comedy festival and I have toured with it, including at the Comedy Underground in Seattle.\r\n\r\nIt&#039;s a fun show that has never failed to please audiences and performers alike. \r\n",
  "copy": "In The Slide Show, comedians will have to make up a story based on eight random images shown for thirty seconds at a time on the screen behind them. ",
  "pageUrl": "12239-the-slide-show",
  "iTunesUrl": ""
}