{
  "id": 12237,
  "events": [],
  "name": "Comedy Roast of a Brewmaster ",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/brewmasterroast_flyer_with_blank_bottom.jpg",
  "photoUrl": "/api/img/show-images/show-comedyroastofabrewmaster-300x300.jpg",
  "sortOrder": 9999,
  "bio": "Hey Bridgetown! Our show is a Comedy Roast, we run it monthly here in the Bay Area (SF and Berkeley) and each time feature a different archetype as a guest of honor.  Then we find an actual professional from that field, write some hilarious jokes for them and have a good old fashion, no jokes barred, comedy roast! \r\n\r\nThis show is super fun, it&#039;s been going on for the last three years and we were just in SF Sketchfest!  We&#039;ve roasted everything from a Lawyer, Pothead and Street Kid to a Stripper, Drag Queen and Professional Wrestler.\r\n\r\nWe would love to come up with 4 of our best roasters and then add to that line-up with some locals.  As far as the guest of honor, we thought a Brewmaster would be a good topic for Portland, but are also flexible on that.  We can handle getting the guest of honor confirmed and set-up once there is a date.\r\n\r\nThank you for your consideration and I look forward to hearing back from you.\r\n\r\nBest,\r\n-Pete ",
  "copy": "San Francisco based RoastSF brings it&#039;s own brand of heart stopping, fall-to-the-floor laughing, no-jokes barred comedy roasts! Featuring monthly shows around the Bay Area and one offs across the country.  Join them as they bring 8 of the best INSULT comics together to mock each other and that night&#039;s controversial guest of honor. As always: drinking is encouraged, sensitivity…. is not.\r\n\r\nAs a special one off for the Bridgetown Comedy Festival, RoastSF presents:  Comedy Roast of a Brewmaster!\r\n\r\nThis month&#039;s guest of honor, a local Brewmaster who&#039;s spent his life dedicated to crafting the perfect vessels of inebriation.  How can you hate a brewmaster? Well, for one, you can be jealous.  Come see if he falls victim to the comics wacky mainstream perceptions or if he can take the abuse and stay sober enough to defend himself.  Sound mean?  It is! Don&#039;t worry though, the show will be as much about ripping on the Brewmaster as it is on those who love beer too much and those who, for some odd reason, hate it.  Also we made sure to get a Brewmaster whose a happy drunk!  So get ready to knock back a few cold ones, laugh your face off and oh yea DEFINITELY don&#039;t bring the kids because this one&#039;s gonna get sloppy.",
  "pageUrl": "12237-comedy-roast-of-a-brewmaster-",
  "iTunesUrl": ""
}