{
  "id": 12259,
  "events": [],
  "name": "I SHIT YOU NOT!",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/isynpromo.jpg",
  "photoUrl": "/api/img/show-images/show-ishityounot-300x300.jpg",
  "sortOrder": 9999,
  "bio": "&quot;I SHIT YOU NOT!&quot; is a monthly storytelling show and weekly podcast featuring comedians, storytellers and regular people sharing true and embarrassing tales, often dealing with failed restraint and bodily blunders. Since its inception in 2012 &quot;I SHIT YOU NOT!&quot; has set itself apart from other live lit and comedy shows by giving audiences a one-of-a-kind storytelling experience and was named one of the Best Shows in Chicago by The Chicago Reader in 2015!  \r\n\r\nThe live show takes place on the last Thursday of every month and is hosted/ produced by comedians Michael Sanchez (Comedians You Should Know) and Seth Davis (Laugh Factory, Zanies, and Seth and Mallory’s Kickback Comedy Show).  Monte Lamonte, a founding member of the show now lives in LA but is still apart of our family.  \r\n\r\nBeing apart of this show has been so much fun.  We have met people who thanked us for giving them a safe place to share their most embarrassing moments.  Even our mom’s come out to this show and talk about how much they love it.  The misconception about the show is that it is gross potty humor but it is amazing to see performers be so sweet and vulnerable while sharing some of their most intimate embarrassing memories.  The show is also just plain old fun.  Audiences at everyone of our shows are rooting harder for our performers than I have ever seen in any other medium and everyone walks away like they were all part of one big supportive party.  We are literally celebrating our embarrassment.  \r\n\r\nThe way our show works is Michael and Seth will host each show and then we bring on our storytellers.  Storytellers consist of comics, storytellers, improvisors, and your regular everyday average Joe/ Joanne.  Each show usually has 6 storytellers not including the hosts and it is our goal for every show to have 3 women and 3 men perform.  The other awesome aspect of our show is that each story is recorded and put on to our “POODCAST”.  The “POODCAST” is hosted by Michael Sanchez, Monte Lamonte, and Seth Davis.  We sit around reminiscing of funny memories and embarrassing personal tales.  It’s like hanging out with your buddies and talking and laughing the entire time.  Each “POODCAST” also features a performance from one of our storyteller’s live shows.  It’s really fun.\r\n\r\nOur shows also make great dates.  Randomly I looked us up on Yelp and read this review where this woman wrote, &quot;There&#039;s no better way to impress your date than to invite him to a night of poop stories. Showing that you&#039;re willing to laugh, clap and heckle at over an hour of filthy story telling will demonstrate that you&#039;re exactly the kind of cool girl he can take home to his kickball league...”  It’s funny because we usually find more women at our shows than men.   \r\n\r\nWe hope you’ll check out our show and consider us for your festival. Thanks!",
  "copy": "&quot;I SHIT YOU NOT!&quot; is a monthly storytelling show and weekly podcast featuring comedians, storytellers and regular people sharing true and embarrassing tales, often dealing with failed restraint and bodily blunders. Since its inception in 2012 &quot;I SHIT YOU NOT!&quot; has set itself apart from other live lit and comedy shows by giving audiences a one-of-a-kind storytelling experience and was named one of the Best Shows in Chicago by The Chicago Reader in 2015!  \r\n\r\nThe live show takes place on the last Thursday of every month and is hosted by comedians Michael Sanchez (Comedians You Should Know) and Seth Davis (Laugh Factory, Zanies, Seth and Mallory’s Kickback Comedy Show).\r\n\r\n\r\nWebsite: http://ishityounotshow.com \r\nPodcast: http://itunes.apple.com/us/podcast/the-poodcast!/id880376178",
  "pageUrl": "12259-i-shit-you-not",
  "iTunesUrl": ""
}