{
  "id": 12250,
  "events": [],
  "name": "The Gateway Show",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/new-gateway-logo-flat.png",
  "photoUrl": "/api/img/show-images/show-thegatewayshow-300x300.jpg",
  "sortOrder": 9999,
  "bio": "The show is a simple one - Stand up comics do what they do best for five to seven minutes each, in order. We then have the comics, the show and the audience take a quick five to ten minute intermission where the performers get VERY stoned. Then we reconvene and have the same performers go BACK up in the exact same order to attempt to do ANOTHER set while they are completely high. \r\n\r\nThe audience loves it and is VERY supportive. Sometimes when we pitch the show to comedians they think it will be a mean spirited show, but it is exactly the opposite. If you&#039;ve smoked pot before you have had an experience where you smoked too much and people just relate to that. If you&#039;ve never smoked then the entire experience is so absurd you can&#039;t help but laugh. We have never had a comic had a bad experience and we&#039;ve been doing the show for over a year now.\r\n\r\nWe&#039;ve done the show in Seattle, Portland, Bellingham, Walla Walla and Richland so far. This year we have Olympia, Tacoma and Salem ready to host the show. Now that smoking is fully legal in Portland this is a great chance to bring this show to the festival and have a truly West coast-only experience with comics from out of town. If the legality of smoking is a worry, we have also done entire shows with edibles before, but we have never run into any legal worries in any cities as we just have the comics leave the premises to get stoned.\r\n\r\nWe hope you decide to go with the show!\r\n\r\nPS. I know you didn&#039;t ask for any promo, but here is the show as featured on local Portland&#039;s NBC affiliate - http://www.kgw.com/news/943967",
  "copy": "Stop us if you&#039;ve heard this one before - some of our favorite comics in the nation hit our stage and do their best sets, then they get WAY too high, only to come back on stage to do another set completely baked out of their minds.",
  "pageUrl": "12250-the-gateway-show",
  "iTunesUrl": ""
}