{
  "id": 12282,
  "events": [],
  "name": "Crushes, Loves, &amp; One Night Stands",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/img_0010.jpg",
  "photoUrl": "/api/img/show-images/show-crusheslovesamponenightstands-300x300.jpg",
  "sortOrder": 9999,
  "bio": "CRUSHES, LOVES, &amp; ONE NIGHT STANDS\r\n\r\nThis show would be a great edition to the Bridgetown Comedy Festival because the theme is based entirely on what people think about most of the time; dating and relationships and the tragic comedy that occurs when trying to be with another person.  It&#039;s mainly storytelling based but we also allow comics to do their relationship material to mix things up.  And we are starting to have performers illustrate their stories, or provide other visual aids, to have a more multi-media approach.  The show is based on personal confessions so as hosts we take extra special care to make sure that we create a welcoming environment for all backgrounds, performers and audience alike.\r\n\r\nCRUSHES, LOVES, &amp; ONE NIGHT STANDS is a different kind of comedy experience that will stick with any audience long after they have left the show and would be a great edition to the Bridgetown Comedy Festival.",
  "copy": "CRUSHES, LOVES, AND ONE STANDS is a stand up/storytelling show devoted entirely to confessional dating experiences.  Hosts, Richard Toomer and Gabby Poccia, invite comics, storytellers, and other dynamic personalities to share their hilarious hook up stories, first crush memories, and funny thoughts on relationship in general.  Come laugh at the lengths we&#039;ll go through to not be alone, the tragedies and victories that occur in the pursuit of others, or just come and feel better knowing there are others who Facebook stalked their exes this week.  Whether you&#039;re a sentimental kitten or a supersonic nymphonic tornado, you&#039;re bound to enjoy the affair.",
  "pageUrl": "12282-crushes-loves--one-night-stands",
  "iTunesUrl": ""
}