{
  "id": 12319,
  "events": [],
  "name": "Date Night: Comedians Give Dating Advice ",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/datenightnyc.jpg",
  "photoUrl": "/api/img/show-images/show-datenightcomediansgivedatingadvice-300x300.jpg",
  "sortOrder": 9999,
  "bio": "This is a showcase of comedians answering anonymous dating, relationship &amp; sex questions with the wisdom and ridiculous insight only a comedian has. It&#039;s an improv and &quot;anything can go&quot; experience that keeps you engaged.The comedians weave their own dating experiences, stories, and jokes with random and unexpected questions. It&#039;s stand up comedy with a TWIST! After a run on tour, the show found it&#039;s home for over 6 months on every 4th Thursday 10PM at The Creek and The Cave (NYC) where it was nominated for &quot;Best New Show&quot;. It&#039;s new home is inside Sandy Station, in Salt Lake City, Utah where it&#039;s performed monthly. (The hosts &amp; founders moved to SLC from NYC, which is the normal comedy trajectory of course). The show was also taken on tour to test out it&#039;s concept, and had great shows in Seattle at the Comedy Underground, Portland, Oregon at Kickstand Comedy and other less awesome towns. The show was founded, hosted and is produced by comedy duo: Doug &amp; Teresa Wyckoff, and we&#039;ve had great comedians on the show from Mark Normand to Ben Kronberg. DIfferent comedians with different styles, bringing unplanned magic to the stage. \r\n\r\nThe audience writes down relationship/sex/dating questions on cards, comedians pull out the cards during their set and improv their sets based on the questions they receive. \r\n\r\nYou can learn more about the show here:\r\nhttp://www.theheandsheshow.com/what-is-date-night/",
  "copy": "Comedians answer YOUR dating &amp; relationship questions. Your favorite comedians answering YOUR anonymous Relationship, Dating and Sex questions with the wisdom and insight only a comedian has. It&#039;s an &quot;anything can happen&quot; stand up comedy experience. We weave our own dating experiences, stories, and jokes with YOUR random and unexpected questions. ",
  "pageUrl": "12319-date-night-comedians-give-dating-advice-",
  "iTunesUrl": ""
}