{
  "id": 12362,
  "events": [],
  "name": "Sexpot Comedy",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/andy_juett_kayvan_silly_picture_day.jpg",
  "photoUrl": "/api/img/show-images/show-sexpotcomedy-300x300.jpg",
  "sortOrder": 9999,
  "bio": "Sexpot Comedy is the knockdown, drag out leader of Denver&#039;s comedy scene and the architect and producing arm of 30 live shows and 16 podcasts a month, an original webseries and a free porprietary radio stream (SEXPOT RADIO.) The coup de gras of these  shows is the Sexpot Comedy monthly show and GQ Magazine agrees naming SEXPOT COMEDY ONE OF THE 5 FUNNIEST NIGHTS IN AMERICA in the August 2015 Comedy Issue with Amy Schumer. It&#039;s the busiest, most anticipated show of the month with pre-show shenanigans by Jim Hickox before the show. Jim routinely taunts and challenges the audience with bizarre videos and typed messages on the 30 foot screen at the oriental theater to the point that if there are &#039;bad actors&#039; in the crowd, they will be skewered at Jim&#039;s request as the smart comedy mob at Sexpot Comedy&#039;s shows won&#039;t tolerate it. Then the show kicks off with stand up or a sketch by Andy Juett and an array of comedy cohorts, a Sexpot Comedy video and then it&#039;s right into the best of Denver mixed with today&#039;s biggest national comedic names including: Kumail Nanjiani, T.J. Miller, Matt Braunger, Kate Berlant, Rory Scovel, Nikki Glaser, Beth Stelling, Aparna Nancherla, The Grawlix, Andy Kindler and more. Andy Juett and Kayvan Khalatbari started these secret cannabis friendly shows in Kayvan&#039;s pizza restaurants late at night with blacked out windows and free weed and pizza. They grew out of necessity into a monthly show at a theater that seats 400. The press and crowds agree: Sexpot Comedy is the best monthly show in Denver. Recent headline: &#039;MEET DENVER&#039;S UNABASHED LEADER OF COMEDY&quot; -ROOSTER MAGAZINE in reference to Andy Juett. Late to the actual standup game himself, Andy has 10,000 hours in producing, acting and writing. Juett has aggressively taken to the stage bringing Sexpot Comedy to SXSW, the Hollywood Improv, The Comedy Exposition of Chicago, CROM and CROM WEST and sold the most tickets at 2015&#039;s High Plains Comedy Festival which Juett co-founded. As one recent strange introduction portended, &#039;&#039;Juett is the Chris Hardwick of Denver and he&#039;s just getting started.&quot; Bridgetown Comedy Festival remains Sexpot Comedy&#039;s biggest live show goal. We humbly beseech consideration to make this dream a reality in 2016. NOTE: VIDEO SUBMISSION is JUST Andy&#039;s opener at 2015 High Plains. Matt Braunger or Charlene can speak to enthusiasm for the show.",
  "copy": "Sexpot Comedy is Denver&#039;s biggest monthly Show. Party starter Andy Juett leads the charge into a foray of video, sketch and pre-show antics via Denver stalwart Jim Hickox so get there early. From start to finish, Sexpot Comedy is a raging cannabis infused laugh fest that keeps things loose and unpredictable through some of the best standup has to offer. Guests are a smattering of Denver&#039;s finest and past national darlings like Kumail Nanjiani, Matt Braunger, Nikki Glaser, Beth Stelling, Rory Scovel and Kate Berlant. In the August 2015 Comedy Issue of GQ Magazine Sexpot Comedy was names one of the 5 FUNNIEST NIGHTS IN AMERICA. Born out of speakeasy free cannabis and pizza shows, Kayvan Khalatbari and Andy Juett have grown Sexpot Comedy into Denver&#039;s most influential scene contributor. Get ready to laugh and feel free to get lifted a Mile High. They&#039;ll do all the work. You just bliss out. Beware: Your sides WILL hurt. But you&#039;ll feel great.",
  "pageUrl": "12362-sexpot-comedy",
  "iTunesUrl": ""
}