{
  "id": 12371,
  "events": [],
  "name": "Cartoons &amp; Comedy",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/cartoons_logo.jpg",
  "photoUrl": "/api/img/show-images/show-cartoonsampcomedy-300x300.jpg",
  "sortOrder": 9999,
  "bio": "Cartoons &amp; Comedy is a fun nostalgic trip with lots of laughs.  I put together episodes of the best (and worst) cartoons from the 80&#039;s and early 90&#039;s and edit in the commercials from that time.  A panel of comedians riff on the show while the crowd enjoys free cereal.  Between and after the episodes I have the comics do short stand up sets with material related to growing up.  The show has been running for three years here in Denver and has been very well received.  At every show, someone yells out &quot;I had that toy!&quot; or &quot;Oh my god I totally forgot about that!&quot;  The mix of the cartoons, commercials and cereal really puts people back into a place of being a kid again.  It&#039;s a labor of love that has drawn such awesome guests as Chris Fairbanks, Sean Patton, Rory Scovel and Run Funches.  ",
  "copy": "Cartoons &amp; Comedy is a purely fun show for crowds and performers alike, a rare glimpse into childhood from the safely ironic distance of years past. The show offers a way to bond over shared memories and laugh at the absurdity we used to innocently accept at face value, all leavened by cheap beer and sugary cereal. Cartoons &amp; Comedy brings its childlike bonhomie and essential spirit while presenting the nimble riffs of Denver&#039;s funniest locals and drop-ins from comedy nerd heroes like Ron Funches, Rory Scovel and Power Violence. At the helm of this endeavor is Chris Baker, who hustles his cherubic ass off — cutting together a video package of old cartoons, wrestling videos and &#039;80s toy commercials, and booking a lineup of quick-witted comics. Join Baker along with local comics and special guests Mystery Science Theater-style mockery. ",
  "pageUrl": "12371-cartoons--comedy",
  "iTunesUrl": ""
}