{
  "id": 12412,
  "events": [],
  "name": "The Worst",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/group_photo_the_night_before_it_happened.jpg",
  "photoUrl": "/api/img/show-images/show-theworst-300x300.jpg",
  "sortOrder": 9999,
  "bio": "What is the worst? Well, some would say waiting in traffic, going to a parent teacher conference, or the films of Uwe Boll. The Worst, is a show dedicated to all of that. \r\n\r\nOur show started out as a bunch of stand up comedians who got bored of doing the same thing every night and thought that writing sketches would be fun. It has since transformed into a multimedia hodge podge of live sketches, stand up performances, musical acts, and videos ranging from man on the streets to mini documentaries. The whole show runs on a simple theme, basically if you&#039;ve ever referred to anything as &quot;the worst&quot; in exasperation, we probably have a sketch, or a video, or a musical number about just that. \r\n\r\nThe cast of The Worst formerly performed as Don&#039;t Watch This Show: Live, which was named the Best Comedic Variety Show by SF Weekly in 2013. We performed in SF Sketchfest for 3 years and even won their video contest in 2014. We performed as The Worst at two sold out showcases in this year&#039;s festival. But that doesn&#039;t really tell the whole story. The Worst is 8 people working on something they love, and apparently what we love is borderline-absurdist sketch comedy. We strive to raise the bar for what people expect from a sketch comedy show. No topic is too touchy nor obscure and no stage is safe from being covered in anything from corn flakes to fake blood. \r\n\r\nWe would also love to feature 1 or 2 guest comics to do sets during the course of the show and participate in a sketch or two.",
  "copy": "Founded in 2015 by stand-up comedians, The Worst strives to be something different. A variable engine of absurdity, parody, and obtuseness, with equal parts SNL, morning talk shows, and awkward high school stories The Worst offers an alternative to both traditional stand-up and the independent theater circuit by offering a little of both. \r\n\r\nThe Worst is: \r\n\r\nJustin Alan - A bearded bow tie aficionado has never sounded so funny. Justin Alan started telling jokes on stage in early 2011 and is going stronger than ever. Justin has been hustling hard from SF to NY to LA doing stand up, and is tapping into improv, writing, and acting as well. He hates spiders.\r\n\r\nSeamus Calder - Born and raised in San Francisco, Seamus has been active in theater for over a decade. An ordained minister, freelance writer, and a failed mayoral candidate sometimes he does stand up, sometimes he sleeps till noon. His hair is amazing, and he has never lost a game of Star Fox 64.\r\n\r\nBrian Fields - Brian grew up a hick boy in the southern part of Ohio. He bagged groceries during the summer. He became a professional poker player and made a bunch of money. He has a Ph.D. in Computers. Brian believes happiness is possible in this world, however ephemeral.\r\n\r\nSarah Longacre - As demonstrated by the length of time it took for this bio to be written, Sarah is a procrastinator who is allowed to be in the group because she lets us typecast her as small children and loose women. Her acting profession peaked at the age of 8 when she was cast in a musical production of Babes In Toyland, where she played the non speaking role of the creepy cat. Sarah sells market research by day and does whatever she feels like at night, including drinking wine and pestering her cat and husband. \r\n\r\nJacob Rubin - Jacob Rubin is an Oakland-based comedian, writer, and otherwise performer in whatever he&#039;s asked to do. He has performed at clubs all over California, including the Purple Onion, the SF Punchline, and the Comedy Store in Hollywood, but he has been seen hitting his head on door frames in venues all across the country. As of this writing, he has use of both of his legs, but you never know. \r\n\r\nEmily Van Dyke - Emily Van Dyke is 31 and still on her mom&#039;s cell phone plan. Originally from Indiana, The Crossroads of America, she has struggled to overcome a monotone voice, nearsightedness and the death of her late cat &quot;Patches&quot; to become a comic who has an apartment with a washer/dryer inside of it. Emily hosts the comedy dating show &quot;Flirting with Laughter,&quot; she was the winner of the 2013 Walk the Plank Comedy Competition and she performs in clubs and basements all the time. Also Emily Van Dyke is not related to Dick Van Dyke so don&#039;t be an idiot and ask her that. ",
  "pageUrl": "12412-the-worst",
  "iTunesUrl": ""
}