{
  "id": 12487,
  "events": [
    12655
  ],
  "name": "An Evening With Aimee Mann and Ted Leo (and Friends!)",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/aimee_ted.jpg",
  "photoUrl": "/api/img/show-images/show-aneveningwithaimeemannandtedleoandfriends-300x300.jpg",
  "sortOrder": 2,
  "bio": "Collectively and individually, Aimee Mann and Ted Leo have more years of musical experience under their belts than most.  You might call them “lifers.”  But they were first drawn into each others circles by the late, great Scott Miller (Game Theory/Loud Family), who brought Ted to Aimee’s awareness back in 2001. Over the years, they became friendly, getting lunch when Ted was in Los Angeles or Aimee was in New York, guesting on this or that comedy or music show together, etc., but they truly bonded over a misspelled word and a hashtag on Twitter, “#dumbie.” Their mutual appreciation of such #dumb things and increased communication (140 characters at a time) eventually lead to a tour together, which lead to spending more time with each other’s music and in each other’s company, which lead to them guesting on each other’s songs nightly on tour, and another mutual appreciation via a chance over-hearing in a hotel room in Chicago, as Aimee came to collect Ted to go get lunch again (they like lunch): early Thin Lizzy.  Inspired by the folksy but edgy rock melodicism and spooky, soulful atmosphere of songs like “Honesty is no Excuse” (which they, in fact, began covering), Aimee sent Ted the stem of a new song just one week after their first tour together had ended.  They began writing together, and “The Both” (originally called #BOTH, because it made them laugh) was born.  They completed what was first slated to be an EP over the course of the next couple of months, but growing ever closer and ever more fulfilled working together, The Both began to take shape as a real and ongoing concern, and the EP became an LP, released April 15, 2014.  They continued to tour with each of their separate concerns (though even then, mostly together) throughout the remainder of 2013, but also played shows as The Both.\r\n\r\n\r\nFor their Bridgetown performance, Aimee and Ted will welcome musician and comedian friends from the festival lineup and beyond for a can&#039;t-miss night of entertainment.",
  "copy": "An Evening With Aimee Mann and Ted Leo (and Friends!)",
  "pageUrl": "12487-an-evening-with-aimee-mann-and-ted-leo-and-friends",
  "iTunesUrl": ""
}