{
  "id": 15752,
  "events": [],
  "name": "Iron Palindromist, or Palindrome Fight",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/iron_palindromist_logo.png",
  "photoUrl": "/api/img/show-images/show-ironpalindromistorpalindromefight-300x300.jpg",
  "sortOrder": 25,
  "bio": "<p>This show is a real-time palindrome-creation battle modeled after Iron Comic and Iron Chef. Several top comics with palindromic chops have 55 minutes to create one or more original palindromes from an audience suggestion, while the audience hears more traditional comedy sets. Then they vote by applause for the winner. 90 minute show.</p>\n<p>Competitors: Myq Kaplan, Zach Sherwin, Dax Jordan, and Mark Saltveit have signed on. All have performed at Bridgetown before and will apply personally.  </p>\n<p>Kaplan and Saltveit will be competing in Will Shortz&#039; second World Palindrome Championship March 24th and 25th, 2017 in Stamford CT, and Saltveit is the reigning world champion. Dax competed in an Iron Palindromist event in 2012. Sherwin has judged the SymmyS Awards for Palindrome Excellence the last two years.</p>\n<p>If the show is accepted, we&#039;ll invite Demetri Martin (who has also judged the SymmyS) to participate as well.</p>\n<p>There should be considerable hype about palindromes surrounding the second World Palindrome Championship in late March. A documentary film crew is preparing a feature on it. Here is their short:  <a href=\"https://vimeo.com/119999700\">https://vimeo.com/119999700</a></p>\n",
  "copy": "<p>WARY, ALPINE ZEN: I PLAY RAW!</p>\n<p>The world needs more good palindromes, so we&#039;re going to make some -- based on audience suggestions. Top palindromist comedians, including Myq Kaplan (Conan, Letterman, Comedy Central), Zach Sherwin (&quot;Epic Rap Battles of History&quot;), Dax Jordan (Bob and Tom Show) and Mark Saltveit (the reigning World Palindrome Champion), will race to write reversible one-liners, while &quot;straight&quot; comics do more traditional sets. After an hour, the audience will decide the winner.</p>\n",
  "pageUrl": "15752-iron-palindromist-or-palindrome-fight",
  "iTunesUrl": ""
}