{
  "id": 15827,
  "events": [
    17197
  ],
  "name": "Brew Haha: The Comedy Show Drinking Game",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/brew_haha_logo.jpg",
  "photoUrl": "/api/img/show-images/show-brewhahathecomedyshowdrinkinggame-300x300.jpg",
  "sortOrder": 19,
  "bio": "<p>Brew HaHa: The Comedy Show Drinking Game is an interactive stand-up comedy show featuring two simultaneous drinking games, one for the audience and one for the comics. For the comics, each comic drinks one full drink for every set preceding theirs (ex, if a comic goes 4th, they will have three drinks before their set). At the beginning of their set, each comic will chug for the amount of rules broken by the comic before them (ex. If comic #2 breaks 6 rules, comic #3 drinks for 6 seconds). For the audience, we create rules that go along with stand up comedy. Every time a comic breaks a rule, a drink sign lights up and the audience takes a sip. It&#039;s hilarious and freaks the comics out.<br />\nWe&#039;ve been running Brew for almost four years, and have loved every second of it. We get about 300 people to our backyard each month for the show, have brought it to a number of comedy festivals (Bridgetown, RiotLA, JashFesht), and in 2016 made a Brew Haha pilot for MTV!</p>\n",
  "copy": "<p>One part comedy show, two parts drinking game, Brew Haha is a hilarious interactive mix of standup comedy and your favorite pre- party ritual. At the beginning of every show, the hosts introduce the crowd to a set of rules created specifically for that show. When comics, unbeknownst to them, break a rule, the audience drinks. A giant light-up “drink” sign will help you play along. A second game, specifically for the performers, ensures that as the audience gets toastier, so do the comedians. Come experience the show that a super famous comedian once called &quot;the worst idea for a show ever.&quot;</p>\n",
  "pageUrl": "15827-brew-haha-the-comedy-show-drinking-game",
  "iTunesUrl": ""
}