{
  "id": 15926,
  "events": [
    17187
  ],
  "name": "Late Late Breakfast",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/tyler_danny.jpg",
  "photoUrl": "/api/img/show-images/show-latelatebreakfast-300x300.jpg",
  "sortOrder": 20,
  "bio": "<p>Hosted and co-created by lovable scamps Tyler Jackson and Danny Maupin, Late Late Breakfast is a fast-paced mixed-format standup show that audiences across the country have embraced. Brightest Young Things has said, &quot;It&#039;s weird and chaotic and fun and silly and smart and everything standup comedy lacks.&quot;</p>\n<p>Every show is a wildly different experience and features top comedians telling jokes while facing unique themed challenges that could be anything from having an impromptu puppet show or pie fight, to undergoing a lie detector test, giving a guided tour in a trolley car, or pitching in a baseball game involving the entire audience. </p>\n<p>Expect anything and everything out of the ordinary, all of it held together by solid, hilarious standup comedy.</p>\n<p>Late Late Breakfast has been featured on the New York Comedy Festival, The Comedy Exposition, Crom Comedy Fest, Hell Yes Fest, Accidental Comedy Fest, and many more since its inception in 2013. We are frequently featured as a top comedy show in publications like The Interrobang, The Daily Dot, Time Out, and the Chicago Tribune. We also shot a television pilot in June! This has all helped us develop a streamlined version of our normal show that works incredibly well at festivals!</p>\n",
  "copy": "<p>Late Late Breakfast is the perfect comedy show for a drunken, weird Saturday afternoon. Hosted and co-created by lovable scamps Tyler Jackson and Danny Maupin, Late Late Breakfast is a fast-paced mixed-format standup show/open mic that the Chicago Reader has simply called &quot;Chaos.&quot; </p>\n<p>Every show is a wildly different experience and features a dizzying array of comedians telling jokes while facing randomized themed challenges that could be anything from having an impromptu puppet show or pie fight or Easter Pageant, to giving a guided tour in a trolley car or smashing fruit like Gallagher or pitching in a baseball game involving the entire audience. </p>\n<p>Expect anything and everything out of the ordinary, all of it held together by solid, hilarious standup comedy.</p>\n",
  "pageUrl": "15926-late-late-breakfast",
  "iTunesUrl": ""
}