{
  "id": 15978,
  "events": [],
  "name": "The Imaginary Radio Program",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/drennon_davisedinburgh_icon_-_leslie_winchester.jpg",
  "photoUrl": "/api/img/show-images/show-theimaginaryradioprogram-300x300.jpg",
  "sortOrder": 18,
  "bio": "<p>Drennon Davis's Imaginary Radio Program involves Drennon Davis and a group of guests performing an approximately 90 minute variety show where the concept relies around Drennon switching the radio dial to various stations that provide the context for sketches, songs, standup and other comedic pieces.  This show has appeared at Bridgetown in 2013 (many performers including Reggie Watts), and in 2015 (with Karen Kilgariff, Brendon Small, Dave Hill, Chris Fairbanks, Ron Lynch, and DJ Real).  The show revolves around comedians who have strong character work or thematic ideas.  For instance, James Adomian did Jesse Ventura reading \"Twas The Night Before Christmas\" in character.  Zach Sherwin has done it multiple times doing an \"anagram Tuesday\" song in which he raps words that are anagrams of the word of the week.  These are mixed in with Imaginary Radio Program regulars (often Nick Stargu aka DJ Real, or Sean Keane), as well as Drennon performing on his own.  Colaboration with Drennon is enouraged as he's great at adding backing vocals, soundtracks or other aspects to the show.  His work with comedian Ron Lynch is a great example of adding sound effects and staging to a work; his backing music to Open Mike Eagle is a great example of his adding a soundtrack to someone's performance.  In either case, Drennon usually talks with a performer before they do the show to figure out what they'd want to do and whether they'd want him involved. </p>\n<p> </p>\n<p> </p>\n",
  "copy": "<p>The Imaginary Radio Program, is an electric combination of music, comedy and beat-boxing where Drennon and a cast of insanely talented comics and musicians (plus a few very special guests) take you<br />\non a frenzied show that the Los Angeles Comedy Bureau writes \"not only lives up to its name, but exceeds expectation in what you could possibly think it is.\"</p>\n<p>IRP has toured to the Edinburgh Fringe Festival, SXSW, SF Sketchfest, Bridgetown Comedy Festival, Riot LA Alternative Comedy Festival, Moontower Comedy Festival and many other places.</p>\n<p>Past Guests have included:<br />\nReggie Watts, Peter Serafinowicz, Aisha Tyler, Maria Bamford, DJ Douggpound, Baron Vaughn, Karen Kilgariff, TJ Miller, DJ REAL, The Bots, Brent Weinbach, Moshe Kasher, Chip Pope, Walsh Brothers, Ron Lynch, Rachel Bloom, Paul Gilmartin, Eliza Skinner, Janet Varney, Sam Simmons, James Adomian, Jake Weisman and The Baby Boys.</p>\n<p> </p>\n<p>“If you venture into this awkward yet ultimately rewarding late-night show, you may well come out of it<br />\nthinking that Drennon Davis is a bit of a genius.”<br />\n- The Times (UK)</p>\n<p>“Tune in, for a show that's high on concept and adept in execution.”<br />\n- The Guardian</p>\n<p>“If Davis isn’t the world’s foremost radio impressionist he’s definitely tuned somewhere near the top…<br />\nThe Imaginary Radio Program may just be the most inspiring show about what you can create when<br />\nyour entire world revolves around radio, and not just your genitals.”<br />\n– Fest Magazine</p>\n",
  "pageUrl": "15978-the-imaginary-radio-program",
  "iTunesUrl": ""
}