{
  "id": 16074,
  "events": [],
  "name": "Talk Show the Game Show",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/img_6527-min.jpg",
  "photoUrl": "/api/img/show-images/show-talkshowthegameshow-300x300.jpg",
  "sortOrder": 11,
  "bio": "<p>Just picked up to TruTV as a series, Talk Show the Game Show showcases Guy’s mix of cultural observational comedy and personal narrative in a fun, quirky format. He’s known for strong takes, aggressive crowd work, and a willingness to share a bit too much of himself. </p>\n<p>Guy is best known for his appearances on <em>Chelsea Lately, @Midnight, The Nightly Show with Larry Wilmore, </em>and <em>The Meltdown with Jonah and Kumail. </em>He’s also written for lots of TV shows including <em>Another Period, Billy on the Street, The Mindy Project, </em>and <em>Awkward</em>. He’s written culture and political commentary for <em>Slate.com</em> and <em>The New York Times</em>, and his pop culture roundtable podcast <em>Pop Rocket</em> was named one of the best new podcasts of 2015 by iTunes. Guy’s debut comedy album, <em>Effable</em>, was #1 on iTunes and Billboard charts, and <em>The New York Times</em> called it “a contender for the best comedy special of 2015.”</p>\n<p>\n </p>\n",
  "copy": "<p>Comedian Guy Branum (<em>The Mindy Project, Chelsea Lately</em>) brings his distinct point of view to <em>Talk Show the Game Show,</em> a hilarious mashup of two beloved television formats that pits comedians and celebrities against each other for the title of “Best Guest of the Night.” Branum’s fast-paced, brilliantly farcical, competitive schmoozefest features celebrity contestants competing in various talk show-inspired challenges. They are then judged by a comedic panel who roasts their performances and awards points for best project plugging, name dropping and anecdote telling. truTV has ordered 16 half-hour episodes of the series, which is produced by Push It Productions with Wanda Sykes, Page Hurwitz and Branum serving as executive producers. It will premiere on the network in spring 2017.</p>\n",
  "pageUrl": "16074-talk-show-the-game-show",
  "iTunesUrl": ""
}