{
  "id": 16098,
  "events": [],
  "name": "Picture This!",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/picturethis_logo3_small.png",
  "photoUrl": "/api/img/show-images/show-picturethis-300x300.jpg",
  "sortOrder": 9,
  "bio": "<p>You guys know about Picture This! since it&#039;s been used as a reference for show submissions for the last few years. But the show has grown and refined in the last 4 years since we did the show at Bridgetown. We would love a chance to come back to Bridgetown like some of the other theme shows like Competitive Erotic Fan Fiction as our show is 100% unique every time we put the show on based on new comedian and animator mixes. We also had a PDX franchise of the show (ended at the end of 2015) so we have a strong base of animators and fans of the show that we would bring to the festival if we were doing a show for the festival. Brandie, Mike, Mike and I would really love to bring the live animated comedy sensation that Tig Notaro, the SF Sketchfest crew, the RIOT LA crew, the BoJack Horseman creators and more have enjoyed enough to bring them to their festivals and brands. Below is the rest of the updated info on the show:</p>\n<p>Picture This! has been going on monthly for over 5 years in Los Angeles with both the regular monthly show and special sponsored shows with sponsors like Bento Box Entertainment, Comedy Central’s Brickleberry, Adult Swim’s Mr. Pickles, Netflix’s BoJack Horseman, Cartoon Network and more! The show also has franchised monthly shows in New York, San Francisco and Portland. The show has also debuted in Washington DC at the Kennedy Center, Denver, New Orleans, Indiana, Iowa, Toronto, New Zealand and the following festivals:</p>\n<p>2013 Adelaide Fringe Festival<br />\n2013 Melbourne International Comedy Festival<br />\n2013 Bridgetown Comedy Festival<br />\n2014 San Francisco Sketchfest<br />\n2014 All Jane No Dick Comedy Festival<br />\n2015 Green Gravel Comedy Festial<br />\n2015 CROM Comedy Festival Denver<br />\n2015 Animation Block Party Festival<br />\n2015 Hell Yeah Fest<br />\n2015 New York Comedy Festival<br />\n2016 RIOT LA Comedy Festival<br />\n2016 SF Sketchfest<br />\n2016 Limestone Comedy Festival<br />\n2016 Animation Block Party Festival<br />\n2016 High Plains Comedy Festival<br />\n2016 Tig Notaro’s Bentzen Ball<br />\n2017 SF Sketchfest</p>\n",
  "copy": "<p>PICTURE THIS! is a new show from Brandie Posey &amp; Sam Varela: two girls who want to push the boundaries of what a comedy show can be. Picture This! is a live comedy show with stand-ups, voice actors and more performing while they are drawn live by some of the best animators, cartoonists, and other artists in the biz! The comedians don’t know what the animators are drawing and the animators don’t know how the comedians will react. </p>\n<p>It may be weird. </p>\n<p>It may different. </p>\n<p>But it will be FUNNY!</p>\n",
  "pageUrl": "16098-picture-this",
  "iTunesUrl": ""
}