{
  "id": 16642,
  "events": [
    17174
  ],
  "name": "A Good Trip with Shane Mauss",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/facebookaddrugs_0.jpg",
  "photoUrl": "/api/img/show-images/show-agoodtripwithshanemauss-300x300.jpg",
  "sortOrder": 9,
  "bio": "<p>Shane Mauss Presents</p>\n<p><strong>A GOOD TRIP</strong></p>\n<p>Comedian Shane Mauss has appeared on Conan, Jimmy Kimmel, Showtime, and has specials on both Comedy Central and Netflix, and interviews scientists for the podcast Here We Are.  Now he is touring around the country on a 100+ city tour with comedy show about psychedelics.  Part stand-up, part storytelling, and part Ted Talk combine for one of the most unique, informative, and funny comedy shows you will ever see.  (No psychedelic experience required)</p>\n<p>The show has been heard about on This comedy show about psychedelics has been heard about on Marc Maron's WTF, Pete Holmes' You Made It Weird, The Duncan Trussell Family Hour, The Joe Rogan Experience, Bertcast, Ari Shaffir's Skeptic Tank, Cracked Podcast, Put Your Hands Together, Doug Loves Movies, and more.</p>\n<p>This tour is sponsored by The Multidisciplinary Association for Psychedelic Studies (MAPS)</p>\n",
  "copy": "<p>Shane Mauss Presents</p>\n<p><strong>A GOOD TRIP</strong></p>\n<p>Comedian Shane Mauss has appeared on Conan, Jimmy Kimmel, and Showtime. He has specials on both Comedy Central and Netflix, and he interviews scientists for the podcast Here We Are.  Now he is touring around the country on a 100+ city tour with comedy show about psychedelics.  Part stand-up, part storytelling, and part Ted Talk combine for one of the most unique, informative, and funny comedy shows you will ever see.  (No psychedelic experience required)</p>\n<p>The show has been featured on Marc Maron's WTF, Pete Holmes' You Made It Weird, The Duncan Trussell Family Hour, The Joe Rogan Experience, Bertcast, Ari Shaffir's Skeptic Tank, Cracked Podcast, Put Your Hands Together, Doug Loves Movies, and more.</p>\n<p> </p>\n",
  "pageUrl": "16642-a-good-trip-with-shane-mauss",
  "iTunesUrl": ""
}