{
  "id": 16781,
  "events": [],
  "name": "Control Yourself",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/logo_jpeg_0.jpg",
  "photoUrl": "/api/img/show-images/show-controlyourself-300x300.jpg",
  "sortOrder": 25,
  "bio": "<p>I've been running my stand up showcase, Control Yourself, for 3full years now. Over the years, it's evolved into a weekly show and now every 1st Sunday of the month we record the show live and distribute it as a podcast.  CY has packed out Alberta Street Pub's 85 person venue on a weekly basis, for years. I would be honored to take the show to a larger venue outside of NE PDX and expand CY's reach in the scene. Since its first year running, CY has been named in the 'Top 5 Portland Comedy Showcases' which are voted on by the people. I am super proud of the work put into that stage and carefully hand select comics to create a well rounded perspective of voices. Too often local shows are booked with the same breath of comics stylings, yet at CY, audience members knows there will be a little something for everyone. Control Yourself showcase is a party, we get weird, there's an open mic after the show, the comedy lasts forever, it's always a highlight of at least 100 people's week.</p>\n<p> </p>\n<p>Thank you for your consideration!</p>\n<p>\nJoAnn Schinderle</p>\n",
  "copy": "<p>Control Yourself is ranked one of Portland's top comedy showcases and has been since its birthing 3years ago.  Single handedly ran by local comic JoAnn Schinderle (LaughsTV, VICE, Audible), CY brings an hour of organic laughs featuring touring headliner comics, local up &amp; comers,  &amp; traveling heavy hitters on a weekly basis. Now as a live show recorded podcast, the laughs don't have to stay in NE PDX! Control Yourself is found on iTunes, Soundcloud, and is part of the Rivercity Podcast Federation.  </p>\n<p>It's no joke that this show has merit. Control Yourself has been highlighted in Paste Magazine, and voted 'Top 5 PDX Comedy Showcases' three years in a row by the Willamette Week. Packed crowds are in for weekly treats to the likes of Baron Vaughn, Sara Schaefer, and Jared Logan, alongside local fresh faces. Eager audiences know to expect their evening to be spent in stitches.</p>\n<p>\"Hosted with exasperated verve by JoAnn Schinderle, the weekly showcase has an intimate basement-party vibe.\" ~ Matthew Singer, WW 'Top 5 PDX Comedy Showcases 2016'</p>\n",
  "pageUrl": "16781-control-yourself",
  "iTunesUrl": ""
}