{
  "id": 17115,
  "events": [],
  "name": "The Goddamn Comedy Jam",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/gdcj_logo.png",
  "photoUrl": "/api/img/show-images/show-thegoddamncomedyjam-300x300.jpg",
  "sortOrder": 3,
  "bio": "<p>Stand-up comedian Josh Adam Meyers along with the Goddamn Band, host the premiere comedy event: The Goddamn Comedy Jam (#GDCJ). A killer lineup of comedic entertainers come together to rock the stage and the mic in the only show that proves: every comedian wants to be a rock star.</p>\n<p>The Goddamn Comedy Jam is the intersection of comedy stardom and rock &amp; roll dreams. Comedians perform a stand up set and short story followed by a song of their choosing, accompanied by a live band. It is an unprecedented opportunity to shine as both a comedic star and rock God in the electrified atmosphere that can only be found at The Goddamn Comedy Jam.</p>\n<p>This show is a separately ticketed even at Crystal Ballroom on Thursday, May 4th. Tickets are on sale at <a href=\"http://www.crystalballroompdx.com/events/168154-The-Goddamn-Comedy-Jam\">http://www.crystalballroompdx.com/events/168154-The-Goddamn-Comedy-Jam</a></p>\n<p>THE COMEDY JAM premiered on Comedy Central March 22.</p>\n",
  "copy": "<p>Stand-up comedian Josh Adam Meyers along with the Goddamn Band, host the premier comedy event: The Goddamn Comedy Jam (#GDCJ). A killer lineup of comedic entertainers come together to rock the stage and the mic in the only show that proves: every comedian wants to be a rock star.</p>\n<p>The Goddamn Comedy Jam is the intersection of comedy stardom and rock &amp; roll dreams. Comedians perform a stand up set and short story followed by a song of their choosing, accompanied by a live band. It is an unprecedented opportunity to shine as both a comedic star and rock god in the electrified atmosphere that can only be found at The Goddamn Comedy Jam.</p>\n<p>This show is a separately ticketed event taking place at Crystal Ballroom on Thursday, May 4th. Tickets are on sale at <a href=\"http://www.crystalballroompdx.com/events/168154-The-Goddamn-Comedy-Jam\">http://www.crystalballroompdx.com/events/168154-The-Goddamn-Comedy-Jam</a></p>\n<p>THE COMEDY JAM premieres on Comedy Central March 22.</p>\n",
  "pageUrl": "17115-the-goddamn-comedy-jam",
  "iTunesUrl": ""
}