{
  "id": 5871,
  "events": [
    7811
  ],
  "name": "The Mystery Box Show",
  "sortOrder": 300,
  "bio": "The Mystery Box Show (http://www.mysteryboxshow.com) is a live storytelling series based in Portland, OR that focuses on stories of sex and sexuality. Following the traditions of live storytelling set by shows like The Moth and Kevin Allison&#039;s RISK!, The Mystery Box Show features real people sharing true personal stories about the many ways that sex influences our lives. \r\n\r\nStorytellers at The Mystery Box Show have included bestselling authors, nationally touring comedians, an editor from Playboy TV, a sex toy expert, members from the kink community, students, and professionals from all walks of life. With a primary focus on entertainment, it&#039;s often surprising how touching and heartfelt these stories can be while other stories may inspire listeners to chase after recently-awakened desires.\r\n\r\nPerforming since April of 2012, The Mystery Box Show has appeared regularly in Portland, OR as a bi-monthly show and putting in special appearances at events such as Wordstock and OMSI After Dark, as well traveling to the 2013 Arse Elektronika festival in San Francisco.  \r\n\r\nFor more information, please contact producers Eric Scheur (eric@mysteryboxshow.com) or Reba Sparrow (reba@mysteryboxshow.com)",
  "copy": "Get ready to unzip your storypants as some of your favorite comedians share true sexual stories from their lives, unscripted and without notes.  \r\n\r\nThe Mystery Box Show is Portland, Oregon&#039;s only storytelling event that focuses solely on tales of sex and sexuality. Past storytellers include nationally-touring comedians, best-selling authors of erotica, sex educators, adult video industry veterans, students, and professionals from all walks of life. With a primary focus on entertainment, these stories offer plenty of laughs, and truly vulnerable moments, spanning the spectrum from the vanilla to the uber-kinky, from the hilariously embarrassing to the heartbreakingly moving.\r\n\r\nJoin us for a special Bridgetown 2014 edition of The Mystery Box Show and find out just what secrets will be revealed!",
  "pageUrl": "5871-the-mystery-box-show"
}