{
  "id": 5909,
  "events": [
    7644
  ],
  "name": "Throwing Shade ",
  "sortOrder": 145,
  "bio": "Throwing Shade is the irreverent weekly political/absurdist comedy podcast &amp; Funny or Die web series hosted by Upright Citizens Brigade alums and Funny or Die writers Erin Gibson and Bryan Safi. Join Erin and Bryan and laugh at things you’re not supposed to, in person, for a night that we promise will be better than prom.\r\n\r\nConsistently in iTunes top ten comedy podcasts with a 5 star rating and with over 3 million downloads, Throwing Shade has cultivated a devoted and broad fan base - the LGBT community (homosensuals), savvy, smart ladies (feminasties), and straight dudes who “get it” (heterosensitives) - by using humor and absurdity to dismantle the unfair treatment of ladies and gays by politicians, the media, and people who don’t know any better.\r\n\r\nWinner of Podcast Awards “Best GLBT Podcast” 2013\r\nNamed one of Paste Magazine’s top 20 comedy podcasts of 2013\r\n&quot;Lacking any sort of filter, UCB veterans Erin Gibson and Bryan Safi are equal- opportunity offenders, discussing current events with a politically incorrect sense of humor. Their aggressively energetic personalities give the show a bit of a morning shock-jock feel, if shock jocks spent even more time talking about genitals.&quot; – The A.V. Club\r\n\r\n",
  "copy": "Throwing Shade is the irreverent weekly political/absurdist comedy podcast &amp; Funny or Die web series hosted by Upright Citizens Brigade alums and Funny or Die writers Erin Gibson and Bryan Safi. Join Erin and Bryan and laugh at things you’re not supposed to, in person, for a night that we promise will be better than prom. \r\n\r\nConsistently in iTunes top ten comedy podcasts with a 5 star rating and with over 3 million downloads, Throwing Shade has cultivated a devoted and broad fan base - the LGBT community (homosensuals), savvy, smart ladies (feminasties), and straight dudes who “get it” (heterosensitives) - by using humor and absurdity to dismantle the unfair treatment of ladies and gays by politicians, the media, and people who don’t know any better. \r\n\r\nIn 2013, in addition to their weekly podcast, Throwing Shade became Funny or Die’s first successful, long-form web series. \r\n\r\nLast year they sold out their first live tour, performing at The Elbow Room in San Fran, Chop Suey in Seattle, Kelly’s Olympian in Portland, The Empty Bottle in Chicago, Lee’s Liquor Lounge in Minneapolis, The Comedy Bar in Toronto, The Black Cat in D.C., The OBERON in Boston, and The Bell House in Brooklyn.",
  "pageUrl": "5909-throwing-shade-"
}