{
  "id": 5936,
  "events": [
    7807
  ],
  "name": "The Comedy Bull",
  "sortOrder": 300,
  "bio": "Competitive Stand Up with elements of improvisation \r\n\r\nEach competitor gets 4 minutes to perform comedy set and being judged by a panel of 3 judges chosen by the producer of the show.\r\n\r\nAfter 4 minute mark judges may (depending on quality /intensity of the set) allow the performer to continue longer or be stopped  and challenged  to perform one of the following improvisational tasks\r\n\r\n1.Crowd work - comedian asked to interact with the audience.\r\n\r\n2.Rant on the subject - subject is chosen by the judges from one of the suggestions given by  the audience (performer expected to come up with a funny rant on that subject).\r\n\r\n3.&quot;Corrida&quot;- AKA improvisational game of NEW CHOICE - each time the judges ring a bell   - previously said sentence has to be rephrased with the different choice of words \r\n\r\n4. Interpret an image - performer is required to comment /interpret on the random image  projected on screen at that time.\r\n\r\nDuring those tasks the performers are challenged to hold the interest/engagement of the audience for as long as possible \r\nPerformer which holds stage the longest ( time of the set before the interruption by the judges + time of the challenge before the interruption by the judges) wins competition and determined to be the funniest performer of the night. \r\n\r\nThree (3) strongest performers move to next round.\r\n\r\n   ",
  "copy": "The Comedy Bull show is a unique comedy format. Each comedian gets a chance to demonstrate their best comedy material and ability to work under pressure  Each performer is given time for the prepared material -and depending on the strength of it, with tasks to riff with audience, rant on the subject given by spectators, play improvisational games. Each comedian has to sweat for the time on stage.One who  makes you laugh harder -  tames &quot;The Comedy Bull&quot;. Our biggest winner is always the audience!",
  "pageUrl": "5936-the-comedy-bull"
}