{
  "id": 6347,
  "events": [
    7805
  ],
  "name": "Brew Haha: The Comedy Show Drinking Game",
  "sortOrder": 300,
  "bio": "Brew Haha is a Los Angeles based interactive comedy show/ drinking game featuring two games, 6 comedians, a couple characters, and, given the right venue, an amazing post show party. Each show has different rules, but operates under the same structure. Here is what one can expect when coming to a Brew HaHa:\r\n\r\n • The HOST of the night comes to the stage and tells the funniest, craziest stories from parties past.\r\n\r\n• The HOST then takes the comics inside (so they can’t hear the rules of the drinking game) and introduces the “Rule Master”. The RM teaches the audience about the “DRINK” sign (every time it lights up, a rule has been broken, and the audience takes a drink) and gives them the rules for the night. There are 5 set rules and 1 audience created rule. See below for some example rules. \r\n\r\n• The HOST comes back out, introduces all of the comics, and has them choose their order for the night out of a hat. Their place in the lineup determines the number of drinks they consume before their set. If you are comic #2, you have two drinks; if you are comic #6, six drinks.\r\n\r\n• The HOST then introduces JIMMY THE BARTENDER, who leads the comics and the audience in the bartenders toast, signifying the beginning of the show. The HOST introduces the first comic and the show begins.\r\n\r\n• During each set the rules broken are counted, and the comic who comes up next has to drink for that many seconds before they perform (ex. If comic #1 breaks 10 rules, comic #2 drinks for 10 seconds).\r\n\r\n• The show always ends with the hosts drinking for the amount of rules broken by the last comic. The rules are simple, but nobody is forced to participate, and the hosts ensure everyone gets home safe.\r\n\r\n• After the show, given the time and space…party time!\r\n\r\nExample Rules:\r\n\r\n• When a comic talks about a romantic relationship, past or present. \r\n• When a comic talks to a specific member of the audience.\r\n• When a comic tries to guess a rule.\r\n• When a comic talks about race.\r\n• When a comic uses a funny voice, or sings.",
  "copy": "The Brew HaHa is Los Angeles’ premiere interactive comedy show/drinking game. One part comedy show, two parts drinking game, Brew Haha is a homegrown cocktail of debauchery and laughter that will make one homesick for the college days. Started by budding comedians in early 2013, The Brew Haha has become an underground sensation to those in the know. Before the first comic goes on stage, rules for the game are explained only to the audience. When comics, unbeknownst to them, break a rule, a light signals and the audience drinks. The rules are simple, but nobody is forced to participate, and the hosts ensure everyone gets home safe. It is a show that evokes that impossibly cool, fun speakeasy one might see in a film or on TV. Except this one is all too real, the comics all too funny, people all too friendly. So if you get the chance, make sure you experience the show that a famous comedian once called &quot;the worst idea for a show ever.&quot;",
  "pageUrl": "6347-brew-haha-the-comedy-show-drinking-game"
}