{
  "id": 6537,
  "events": [
    7650
  ],
  "name": "Mary Mack&#039;s North Star Comedy Hour &amp; Meat Raffle",
  "sortOrder": 200,
  "bio": "Mary Mack&#039;s North Star Comedy Hour &amp; Meat Raffle*\r\n\r\nPerformed around various parts of the country for the last six years, The North Star Comedy Hour &amp; Meat Raffle is a variety show featuring good acts and bad meat--raffled off by a fake butcher.  Nationally touring Folk Humorist Mary Mack (usually paired with accordion player Tom Fosmire) is both band and host.  Complete with sing along theme song, this is an interactive comedy show featuring a variety of partially sober performers.  Genres represented in the past have included but are not limited to music, comedy, storytelling, poetry, regular dancing, angry dancing, pet education, French chanson de geste (a retrospective), and Spanish-American War reenactment.  \r\n*Performances usually have one vegan option, or at least some broth.\r\n ",
  "copy": "Mary Mack&#039;s North Star Comedy Hour &amp; Meat Raffle*\r\n\r\nThe North Star Comedy Hour &amp; Meat Raffle is a variety show featuring good acts and bad meat--raffled off by a fake butcher.  Nationally touring Folk Humorist Mary Mack (usually paired with accordion player Tom Fosmire) is both band and host.  Complete with sing along theme song, this is an interactive comedy show featuring a variety of partially sober performers.  Genres represented in the past have included but are not limited to music, comedy, storytelling, poetry, regular dancing, angry dancing, pet education, French chanson de geste (a retrospective), and Spanish-American War reenactment.  \r\n\r\nMary Mack is a favorite on radio shows and podcasts around the country, including Marc Maron&#039;s WTF Podcast, The Bob and Tom Show, and previous seasons of American Public Media&#039;s WITS live show and podcast.  Her comedy (spotted with occasional mandolin or clarinet outbursts) has  been seen in the Vancouver Comedy Fest, HBO&#039;s Andy Kaufman Awards, Montreal’s Just For Laughs Festival, the San Francisco Sketch Fest &quot;Dozen,&quot; and on Adult Swim.  She had her national TV debut on Comedy Central&#039;s Live at Gotham and NBC&#039;s Last Comic Standing, and is a main voice on Fox&#039;s late night animation block beginning January 2014.   ",
  "pageUrl": "6537-mary-macks-north-star-comedy-hour--meat-raffle"
}