{
  "events": [
    "10428"
  ],
  "name": "7 Minutes in Purgatory",
  "photoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/poster_by_j_michael_osborne.jpg",
  "sortOrder": 16,
  "bio": "What happens when a comedian doesn&#039;t know how the audience is responding? Seven Minutes in Purgatory challenges comedians to perform a tight seven minute set in a soundproof room while the audience watches a live stream of their set.\r\n\r\nSeven Minutes in Purgatory isolates performers from any type of audience feedback, offering audiences a chance to witness stand-up comics attempting to do their act without the benefit of knowing how they&#039;re doing. In eliminating one of the essential elements of traditional live comedy, Seven Mintues In Purgatory amplifies the comics&#039; neuroses, giving fans a different perspective on their favorite performers. The live-streamed element gives performers the chance to experiment within these newfound conceptual constraints. At past shows, performers have called audience members to check in on how their set&#039;s going, staged fights with audience plants, and auditioned for appearances on The Voice. \r\n\r\nWe&#039;ve taken Seven Minutes in Purgatory on the road this year, to Atlanta&#039;s Laughing Skull Lounge in September, as well as a two week tour of the Midwest in November, staging pop-up shows in Denver, Omaha, St. Louis, and Kansas City. The show has been featured in The A.V. Club, Chicago Tribune, and the Chicago Reader, and has sold out every Chicago show to date.\r\n\r\nSeven Minutes in Purgatory was created by Ian Abramson, who was recently named Chicago&#039;s best Experimental Comedian by Chicago Magazine and has been described as &quot;one of the smartest, weirdest and funniest guys on the scene&quot; by the Chicago Tribune, and Matt Byrne, a Chicago-based comedy producer who recently co-founded the Comedy Exposition, a stand-up comedy festival in Chicago. Matt also runs The Steamroller, a blog about Chicago&#039;s comedy scene.",
  "copy": "Seven Msnutes in Purgatory is a high-concept comedy show that has been hailed as an “outrageous experiment” by the Chicago Tribune. Host and co-creator of Seven Minutes in Purgatory, Ian Abramson, challenges comedians to perform their material to a camera alone in a soundproof room. Audience members will watch a live feed of the comedians, as they awkwardly and hilariously attempt to perform without knowing the crowd&#039;s reaction.\r\n\r\n\r\n",
  "pageUrl": "9113-7-minutes-in-purgatory"
}