{
  "events": [
    "10405"
  ],
  "name": "TV Guidance Counselor",
  "photoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/kentvgc_0.jpg",
  "sortOrder": 29,
  "bio": "This show is a ton of fun and fairly unique. It&#039;s not snarky at all. We show a real reverence for the shows of our youth and peel back life experiences to discuss living situations and the shared experience of classic television. It&#039;s a fun conversation and a nice change from stand up.\r\n\r\nUnlike other Stand up comedian fronted podcasts, this one doesn&#039;t focus too much on the mechanics of comedy. Although I&#039;ve only been doing the show a year, we&#039;re getting about 10k downloads a month all over the world. I&#039;ve also had some experience with doing live editions as we&#039;ve done them now at New York Super Week/New York ComicCon (with Amy Sedaris), North East Comic Con (with Evan Michaelson from Oddieis/Obscura Antiques), The Boston Comedy Festival (with Emmanuel Lewis of Webster) and will have done one at Riot LA in January (guest TBA, I know who it is, but don&#039;t want to jinx it, nice big name).\r\n\r\nI have a unique knowledge of television and revisiting a specific week of our lives always leads to some fun tangents and interesting insights from my guests.\r\n\r\nI own every issue of TV Guide, and review them frequently. It&#039;s a life long passion and it&#039;s interesting to see how people form all different backgrounds share an early love of television. ",
  "copy": "Hosted by well respected Boston based comedian Ken Reid, TV Guidance Counselor is a new podcast about old TV. The premise is,  Ken owns every TV Guide from 1980-1995 or so. Someone  picks a random TV Guide, writes down everything in it that they want to watch in prime time (8-10pm) and then the podcast is the discussion of their choices. Ken does occasionally break format for the celebrity editions, where the TV Guide is used as an inspiration to discuss their careers.\r\n\r\n60  episodes are out so far (and a lot more banked) and they have been getting a really great response (Ken is also having a ton of fun doing them). The conversations kind of get into stories about growing up, people&#039;s relationship with television, some cultural/media studies dissection and Ken spits out a lot of trivia. It&#039;s a fun conversation.  \r\n\r\nIt&#039;s up on iTunes if you want to check it out\r\nhttps://itunes.apple.com/us/podcast/tv-guidance-counselor-podcast/id821665905\r\n\r\nThere&#039;s more detail and what not also up on the webpage\r\nhttp://tvguidancecounselor.com/\r\n \r\nGuests have included Jim Beaver (Supernatural, Justified, Deadwood) Captain Sensible and Dave Vanian of the Damned, Amy Sedaris, Christian Finnegan, Laura Kightlinger, JoAnn Willete (Just the Ten of Us, Facts of Life), Melanie Chartoff (Fridays, Parker Lewis Can&#039;t Lose, Rugrats), Laraine Newman, Michael Ian Black, Kumail Nanjiani, James Adomian, Jonathan Katz, Andy Kindler, Hari Kondabolu, Alex Edelman, Myq Kaplan, Kelly MacFarland,  Bethany Van Delft, Danny Tamberelli (&quot;The Adventures of Pete and Pete), Josh Gondelman, Giulia Rozzi, Adam Resnick (Get a Life, Cabin Boy), Julia Duffy, Vanessa Angel and more\r\n\r\nHere&#039;s an incredibly nice piece Cinema Blend recently wrote about the show:\r\n\r\nhttp://www.cinemablend.com/television/TV-Guidance-Counselor-Nostalgia-Driven-Comedy-Podcast-You-Need-Listening-66551.html\r\n\r\nand here&#039;s one from USA Today&#039;s Pop Candy Blog\r\n\r\nhttp://www.usatoday.com/story/popcandy/2014/07/28/tv-guidance-counselor/13280167/\r\n\r\nand it got recently featured in the New York Times as well. \r\nhttp://www.nytimes.com/2014/10/03/nyregion/new-york-super-week-offers-cultural-highlights.html?_r=1\r\n\r\nKen has also done live editions of the show at New York Comic Con, New York Super Week, North East Comic Con, The Boston Comedy Festival and Riot LA. ",
  "pageUrl": "9240-tv-guidance-counselor"
}