{
  "events": [
    "10758"
  ],
  "name": "Comedy and Cocktails Presents The Nickel Club",
  "photoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/nickel1.jpg",
  "sortOrder": 28,
  "bio": "The Nickel Club is a theme show in LA that promises audience members an immersive night of comedy, jazz, and fun. Each show starts with the audience being ushered into the world of &quot;The Nickel Club&quot;, the world&#039;s premiere secret society. Like a 1920s speakeasy, as the audience arrives, they give the password to &#039;the bouncer&#039; (played by a comic), they are led into the secret venue by lantern (venue dependent) where they will find the producers in character and dressed to the 9&#039;s as a live jazz band plays classic tunes. To begin the show, the hosts &quot;initiate&quot; the audience into the Nickel Club, a society that has been around as long as time. Then, the comedy show starts, which is their reward for being part of this exclusive secret society. The comics then do sets where they can play along with the jazz band. Some ask them to punctuate jokes, others ask them to do nothing, others still have the band play sweet melodies behind a story or a joke.  After the show, time permitting, the band plays and people enjoy the rest of their night.",
  "copy": "Dear people of Bridgetown:\r\n\r\nYou&#039;ve been chosen to join an exclusive society of the arts and culture, The Nickel Club:  A community so special you&#039;ll want to tell everyone about it, but won&#039;t... because now... you&#039;re in on the secret. \r\n\r\nBe prepared for a spectacular night of jazz, traditions, comedy, and laughter as the world&#039;s best and funniest will be there to welcome you to the world&#039;s premier secret club.  We look forward to you joining our ranks.  \r\n\r\nThe Nickel Club... surviving the constant cascade of modern mediocrity.  Sero venientes male sedentes.",
  "pageUrl": "9781-comedy-and-cocktails-presents-the-nickel-club"
}