{
  "events": [
    "10453"
  ],
  "name": "Heart of Darkness",
  "photoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/10562479_10152679710938934_1004616428426174128_o.jpg",
  "sortOrder": 25,
  "bio": "Hi . \r\n\r\n  I&#039;ve been thinking about doing my show Heart of Darkness at Bridgetown for a few months now.  I think it would be a very perfect fit. \r\n\r\nEach show has a guest speaker we call a &#039;Mind Warrior&#039;, 2-3 comedians and a musical guest. In the past we&#039;ve had Mind Warriors  Graham Hancock,  Heather Berlin Ph.D, Dennis Mckenna ,  Andrew W.K., Daniel Pinchbeck and many more, as well as comedians Janeane Garofalo, Jim Gaffigan and Reggie Watts, Chelsea Peretti, Fred Armisen, Jim Gaffigan, Michael Showalter among many others.   The show is a themed variety show featuring 3 comics, a scientist and a musical guest with a house band and me hosting. The audience is also very involved: we bring an audience member on stage to sit in the &#039;I love you chair&#039; and at the end of the show we forgive everyone for their sins getting as many as we can by going into the audience.  I&#039;ll book comics that will already be coming to Bridgetown and contact a few local bands. I&#039;ve performed in Portland a decent amount of times and know musicians and am confident it would be easy to pull off. \r\n\r\nThe show is a way for artists and audience members to participate and collaborate in ideas and experience something that will only happen once.  \r\n\r\nI just did one at the Brooklyn Museum and will be in LA this Feb to do the Cinefamily and then the Hollywood Improv in March.  \r\n\r\nI would really love to do as many as I could in Bridgetown.  it would be most most excellent.  \r\n\r\nlove,\r\nGreg\r\n\r\n\r\n",
  "copy": "Hosted by Greg Barris and his house band, The Forgiveness, Heart of Darkness is a psychedelic showcase of comedy, live music and fringe scientists that is a frequent Time Out New York critic’s pick, much loved by BrooklynVegan and hailed as ‘Excellent’ by The New Yorker.\r\n\r\nNew York performances have included ‘Mind Warriors’ like Graham Hancock, Heather Berlin Ph.D, Dennis Mckenna , Andrew W.K., Daniel Pinchbeck, along with comedians Janeane Garofalo, Jim Gaffigan and Reggie Watts, Chelsea Peretti, Fred Armisen, Jim Gaffigan, Michael Showalter and more.\r\n\r\n&quot;At the bimonthly, bicoastal comedy event called Heart of Darkness, the atmosphere is more of a communal gathering. Comics share their jokes almost campfire-style, backed with a house band that can shift the mood from light-hearted to trippy to introspective&quot; \r\n-The Village voice  \r\n\r\n“Greg Barris is the perfect combination of very good looking, hilarious and \r\nsuper-weird”   \r\n-Paper Magazine\r\n\r\n“Barris’s show features crazed comedy, live music and bizarro antics  — a mixture that landed it its 20th sold-out show in a row in Brooklyn.”\r\n- LA Times\r\n",
  "pageUrl": "9933-heart-of-darkness"
}