[
 {
  "Name": "Dr. Katz, Professional Therapist: a 20th Anniversary Celebration",
  "Copy": "The Bridgetown Comedy Festival is proud to present a live production of Dr. Katz, Professional Therapist in celebration of the 20th anniversary of the Comedy Central debut of the groundbreaking animated program that showcased dozens of comedy legends including Conan O&#039;Brien, Ray Romano, Louis CK, Dave Chappelle and Mitch Hedberg. For the live presentation, host Jonathan Katz welcomes special guests Janeane Garofalo (24, Mr. Show, The Ben Stiller Show), Andy Kindler (The Late Show with David Letterman, Last Comic Standing), Dana Gould (The Simpsons), Brendon Small (Metalocalypse, Home Movies) and surprise guests.\r\n\r\nTickets available at https://www.ticketfly.com/purchase/event/796489",
  "Bio": "The Bridgetown Comedy Festival is proud to present a live production of Dr. Katz, Professional Therapist in celebration of the 20th anniversary of the Comedy Central debut of the groundbreaking animated program that showcased dozens of comedy legends including Conan O&#039;Brien, Ray Romano, Louis CK, Dave Chappelle and Mitch Hedberg. For the live presentation, host Jonathan Katz welcomes special guests Janeane Garofalo (24, Mr. Show, The Ben Stiller Show), Andy Kindler (The Late Show with David Letterman, Last Comic Standing), Dana Gould (The Simpsons), Brendon Small (Metalocalypse, Home Movies) and surprise guests.\r\n\r\nTickets available at https://www.ticketfly.com/purchase/event/796489",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/drkatz.jpg",
  "SubmittedId": "10354",
  "Position": "1",
  "id": "10354",
  "pageUrl": "10354-dr-katz-professional-therapist-a-20th-anniversary-celebration",
  "events": []
 },
 {
  "Name": "Harmontown",
  "Copy": "",
  "Bio": "Self destructive writer Dan Harmon (&quot;Community,&quot; &quot;Rick and Morty,&quot; &quot;Heat Vision and Jack&quot;) claims he will one day found a colony of like-minded misfits. He&#039;s appointed suit-clad gadabout Jeff Davis (&quot;Whose Line is it Anyway&quot;) as his Comptroller.",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/harmontown-podcast.jpg",
  "SubmittedId": "11000",
  "Position": "2",
  "id": "11000",
  "pageUrl": "11000-harmontown",
  "events": []
 },
 {
  "Name": "Baked",
  "Copy": "Baked is an evening of music and comedy hosted by Brendon Small (Metalocalypse, Home Movies) and Steve Agee (The Sarah Silverman Program, New Girl, Adventure Time) and an incredibly talented band including Joe Travers (Zappa Plays Zappa, Mike Keneally Band), Pete Griffin (Zappa Plays Zappa, Dethklok), and Mike Keneally (Mike Keneally Band)*. After a yearlong residency at LA&#039;s world famous jazz club The Baked Potato, Baked travels north to force its musical and comedic ethos onto the inhabitants of Portland and ultimately destroy their brains. Join us for a show in which comics are encouraged to perform in a musical capacity after a set of standup comedy.\r\n\r\n*band lineup subject to change",
  "Bio": "Baked is an evening of music and comedy hosted by Brendon Small (Metalocalypse, Home Movies) and Steve Agee (The Sarah Silverman Program, New Girl, Adventure Time) and an incredibly talented band including Joe Travers (Zappa Plays Zappa, Mike Keneally Band), Pete Griffin (Zappa Plays Zappa, Dethklok), and Mike Keneally (Mike Keneally Band)*. After a yearlong residency at LA&#039;s world famous jazz club The Baked Potato, Baked travels north to force its musical and comedic ethos onto the inhabitants of Portland and ultimately destroy their brains. Join us for a show in which comics are encouraged to perform in a musical capacity after a set of standup comedy.\r\n\r\n*band lineup subject to change",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/baked_square.jpg",
  "SubmittedId": "10371",
  "Position": "3",
  "id": "10371",
  "pageUrl": "10371-baked",
  "events": []
 },
 {
  "Name": "Andy Kindler&#039;s Particular Show",
  "Copy": "Andy chooses from his rolodex (Rolex?) of comedy superstars from LA and around the world (New York) to present a hilarious (his words) and very Particular show. Andy’s the host. It’s his party and he will do time in between each comic if he wants to.\r\n \r\nAndy Kindler is a frequent guest on The Late Show with David Letterman.  He currently recurs on IFC’s Maron, Comedy Central’s Tosh.O and is Mort the Mortician on Fox’s hit animation show Bob’s Burgers.",
  "Bio": "Andy chooses from his rolodex (Rolex?) of comedy superstars from LA and around the world (New York) to present a hilarious (his words) and very Particular show. Andy’s the host. It’s his party and he will do time in between each comic if he wants to.\r\n \r\nAndy Kindler is a frequent guest on The Late Show with David Letterman.  He currently recurs on IFC’s Maron, Comedy Central’s Tosh.O and is Mort the Mortician on Fox’s hit animation show Bob’s Burgers.",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/bridgetownparticularshow.jpg",
  "SubmittedId": "10314",
  "Position": "4",
  "id": "10314",
  "pageUrl": "10314-andy-kindlers-particular-show",
  "events": []
 },
 {
  "Name": "The CrabFeast Podcast",
  "Copy": "",
  "Bio": "The CrabFeast is a podcast hosted by comedians Ryan Sickler and Jay Larson.  The show focuses on storytelling with new episodes every Toozdee.\r\n\r\n\r\nThe chemistry between Ryan and Jay enables them to take the conversation anywhere, often making light of some heavier subjects.  They make their guests feel like family and their listeners feel like they’re sitting around sharing stories with old friends. \r\n\r\n\r\nPart of the All Things Comedy family, they’ve appeared on Ovation’s ‘The Art of Comedy’, TBS&#039;s ‘The Pete Holmes Show’, Live at the LA Podfest, The Damon Bruce Radio Show and were finalists in the 2013 Stitcher Awards for Best Comedy Podcast.  \r\n\r\n\r\nPull up a chair, grab a coupla cold ones and celebrate the things that Ryan and Jay love most — storytelling, family, friends and comedy.\r\n\r\n\r\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/2014_crabfeast_atc_logo_black.jpg",
  "SubmittedId": "9639",
  "Position": "5",
  "id": "9639",
  "pageUrl": "9639-the-crabfeast-podcast",
  "events": []
 },
 {
  "Name": "Competitive Erotic Fan Fiction",
  "Copy": "Comedians compete writing and performing Erotic Fan Fiction pieces, based upon their whims or audience suggestion. It’s really stupid.",
  "Bio": "Comedians compete writing and performing Erotic Fan Fiction pieces, based upon their whims or audience suggestion. It’s really stupid.",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/ceff_podcast_logo.jpg",
  "SubmittedId": "10344",
  "Position": "6",
  "id": "10344",
  "pageUrl": "10344-competitive-erotic-fan-fiction",
  "events": []
 },
 {
  "Name": "The K Ohle with Kurt Braunohler",
  "Copy": "The K Ohle is a multi-format podcast hosted by comedian Kurt Braunohler. FORMATS INCLUDE (but are not limited to): The Boat Show – &quot;The Best Non-Boating Boat Show on the Internet&quot; -- Kurt and his guests talk at length about boating, a topic of which they have no knowledge. PETophilia – “The Animal Show for People Who Think Animals are Dumb” – guests get into it about their pets; plus, Animal Stories of the Week, Fact Animal Facts, and Who’s Dumber, the fun game the humiliates animals! Get Lost! – “This Feels a Bit Rape-y” - Every episode, Kurt takes a guest into his car, blindfolds them, drives them somewhere they’ve never been, and they have to figure out where they are and how they’d get back. And they have some chats along the way. FactTime - Kurt and co-host Matt Oberg unpack and investigate improvised stories from comedians while applying faulty scientific theories in a very produced and tightly edited format. If you love Radiolab, you&#039;ll love FactTime.",
  "Bio": "The K Ohle is a multi-format podcast hosted by comedian Kurt Braunohler. FORMATS INCLUDE (but are not limited to): The Boat Show – &quot;The Best Non-Boating Boat Show on the Internet&quot; -- Kurt and his guests talk at length about boating, a topic of which they have no knowledge. PETophilia – “The Animal Show for People Who Think Animals are Dumb” – guests get into it about their pets; plus, Animal Stories of the Week, Fact Animal Facts, and Who’s Dumber, the fun game the humiliates animals! Get Lost! – “This Feels a Bit Rape-y” - Every episode, Kurt takes a guest into his car, blindfolds them, drives them somewhere they’ve never been, and they have to figure out where they are and how they’d get back. And they have some chats along the way. FactTime - Kurt and co-host Matt Oberg unpack and investigate improvised stories from comedians while applying faulty scientific theories in a very produced and tightly edited format. If you love Radiolab, you&#039;ll love FactTime.",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/k-ohle.jpg",
  "SubmittedId": "10320",
  "Position": "7",
  "id": "10320",
  "pageUrl": "10320-the-k-ohle-with-kurt-braunohler",
  "events": []
 },
 {
  "Name": "Blaria",
  "Copy": "Comedians Phoebe Robinson &amp; Jessica Williams host this monthly stand up show based on the popular blog of the same name and the show features the best comics from all over the country.",
  "Bio": "Comedians Phoebe Robinson &amp; Jessica Williams host this monthly stand up show based on the popular blog of the same name and the show features the best comics from all over the country.",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/jess_phoebe.jpeg",
  "SubmittedId": "10042",
  "Position": "8",
  "id": "10042",
  "pageUrl": "10042-blaria",
  "events": []
 },
 {
  "Name": "Dork Forest with Jackie Kashian",
  "Copy": "Jackie Kashian discusses favorite obsessions with the obsessed. Video games, Comic Books, Birdwatching. How deep in the dork forest are you? Celebrate it and f*&amp;%$, make it your own! ",
  "Bio": "Jackie Kashian discusses favorite obsessions with the obsessed. Video games, Comic Books, Birdwatching. How deep in the dork forest are you? Celebrate it and f*&amp;%$, make it your own! ",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/image.png",
  "SubmittedId": "10298",
  "Position": "9",
  "id": "10298",
  "pageUrl": "10298-dork-forest-with-jackie-kashian",
  "events": []
 },
 {
  "Name": "The Dana Gould Hour",
  "Copy": "Comedian Dana Gould takes a look at our world… through his eyes… for your benefit. Joined by fellow comedians and other interesting people with a focus on the weird and the real. Conversation. Music. Monologues. ",
  "Bio": "Comedian Dana Gould takes a look at our world… through his eyes… for your benefit. Joined by fellow comedians and other interesting people with a focus on the weird and the real. Conversation. Music. Monologues. ",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/dghs04e01_360.jpg",
  "SubmittedId": "10347",
  "Position": "10",
  "id": "10347",
  "pageUrl": "10347-the-dana-gould-hour",
  "events": []
 },
 {
  "Name": "Funny Over Everything",
  "Copy": "The Funny Over Everything comedy showcase is a monthly series showcasing some of the best, most innovative up-and-coming stand-up comedians that the nation has to offer. Past performers include Moshe Kasher, Ron Funches, Hannibal Buress, Jerrod Carmichael, Doug Benson, Peter Serafenowitz, Sean Patton, Beth Stelling, Nate Bargatze, Emily Heller, Ian Karmel, Timmy Williams, Sean Jordan and Shane Torres.\r\n",
  "Bio": "A standup showcase of some of the top, somewhat unknown to the mainstream, comics in North America. Hosted by Sean Jordan, and featuring sketch by Phil Schallberger. ",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/funny-over.png",
  "SubmittedId": "10199",
  "Position": "11",
  "id": "10199",
  "pageUrl": "10199-funny-over-everything",
  "events": []
 },
 {
  "Name": "THE TINKLE TWINS! (with Arden Myrin and Dana Gould!)",
  "Copy": "The Tinkle Twins stars Dana Gould (The Simpsons, Mob City) and Arden Myrin (Chelsea Lately, Orange Is the New Black) as douchey identical twins. It is a monthly show at Nerdmelt Showroom at Meltdown Comics in Los Angeles. The Tinkle Twins have no idea that the fact that they are a man and a woman, are different ages and have different parents would make it impossible for them to be exact replicas of one another. The Twins host a jacked-up fake kids show with stand up guests, characters and music. The twins set the joyful creepy mood for the first 30 minutes of the show. Eddie Pepitone plays the arch nemesis of the Tinkle Twins. He hates Arden the most.",
  "Bio": "The Tinkle Twins stars Dana Gould (The Simpsons, Mob City) and Arden Myrin (Chelsea Lately, Orange Is the New Black) as douchey identical twins. It is a monthly show at Nerdmelt Showroom at Meltdown Comics in Los Angeles. The Tinkle Twins have no idea that the fact that they are a man and a woman, are different ages and have different parents would make it impossible for them to be exact replicas of one another. The Twins host a jacked-up fake kids show with stand up guests, characters and music. The twins set the joyful creepy mood for the first 30 minutes of the show. ",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/tinkle.jpg",
  "SubmittedId": "10325",
  "Position": "12",
  "id": "10325",
  "pageUrl": "10325-the-tinkle-twins-with-arden-myrin-and-dana-gould",
  "events": []
 },
 {
  "Name": "7 Minutes in Purgatory",
  "Copy": "Seven Minutes in Purgatory is a high-concept comedy show that has been hailed as an “outrageous experiment” by the Chicago Tribune. Host and co-creator of Seven Minutes in Purgatory, Ian Abramson, challenges comedians to perform their material to a camera alone in a soundproof room. Audience members will watch a live feed of the comedians, as they awkwardly and hilariously attempt to perform without knowing the crowd&#039;s reaction.\r\n\r\n\r\n",
  "Bio": "What happens when a comedian doesn&#039;t know how the audience is responding? Seven Minutes in Purgatory challenges comedians to perform a tight seven minute set in a soundproof room while the audience watches a live stream of their set.\r\n\r\nSeven Minutes in Purgatory isolates performers from any type of audience feedback, offering audiences a chance to witness stand-up comics attempting to do their act without the benefit of knowing how they&#039;re doing. In eliminating one of the essential elements of traditional live comedy, Seven Mintues In Purgatory amplifies the comics&#039; neuroses, giving fans a different perspective on their favorite performers. The live-streamed element gives performers the chance to experiment within these newfound conceptual constraints. At past shows, performers have called audience members to check in on how their set&#039;s going, staged fights with audience plants, and auditioned for appearances on The Voice. \r\n\r\nWe&#039;ve taken Seven Minutes in Purgatory on the road this year, to Atlanta&#039;s Laughing Skull Lounge in September, as well as a two week tour of the Midwest in November, staging pop-up shows in Denver, Omaha, St. Louis, and Kansas City. The show has been featured in The A.V. Club, Chicago Tribune, and the Chicago Reader, and has sold out every Chicago show to date.\r\n\r\nSeven Minutes in Purgatory was created by Ian Abramson, who was recently named Chicago&#039;s best Experimental Comedian by Chicago Magazine and has been described as &quot;one of the smartest, weirdest and funniest guys on the scene&quot; by the Chicago Tribune, and Matt Byrne, a Chicago-based comedy producer who recently co-founded the Comedy Exposition, a stand-up comedy festival in Chicago. Matt also runs The Steamroller, a blog about Chicago&#039;s comedy scene.",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/poster_by_j_michael_osborne.jpg",
  "SubmittedId": "9113",
  "Position": "13",
  "id": "9113",
  "pageUrl": "9113-7-minutes-in-purgatory",
  "events": []
 },
 {
  "Name": "Talk Show: The Game Show",
  "Copy": "Beloved comedian Guy Branum hosts the ultimate test of banter in a thrilling combination of America’s two least respected television formats. Three guests face off to prove who’s the best talk show guest by plugging, name-dropping, and anecdoteing their way to victory. ",
  "Bio": "&quot;Beloved comedian Guy Branum hosts the ultimate test of banter in a thrilling combination of America’s two least respected television formats. Three guests face off to prove who’s the best talk show guest by plugging, name-dropping, and anecdoteing their way to victory. &quot;\r\n\r\nAs far as show format, it&#039;s a 60-90 minute show. Guy hosts and does a quick monologue, scorekeeper and judges are introduced, and then one guest comes out at a time for a timed interview/competition round. After all 3 guests have been interviewed/competed, the last round is a lightning round of question answering and the winner is revealed. \r\n\r\nSo could use 3 comics that will already be up there, and even judges as I&#039;m sure some of the people going have done the show before in LA or NY. Scorekeeper is usually Whitmer Thomas or Jay Weingarten but I assume any younger adorable comedian that Guy can lovingly objectify while they keep tally will suffice.",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/guy_branum-_ts_tgs_promo.jpg",
  "SubmittedId": "10212",
  "Position": "14",
  "id": "10212",
  "pageUrl": "10212-talk-show-the-game-show",
  "events": []
 },
 {
  "Name": "Probably Science",
  "Copy": "The hit podcast in which three professional comedians who are also incompetent scientists take you through this week in science. Incompetently. Featuring Matt Kirshen (Jimmy Fallon, Craig Ferguson, Nerdist, Last Comic Standing), Andy Wood (Jason Nash Is Married, MOCKpocalypse), Jesse Case (Just For Laughs, Live At Gotham, Last Comic Standing), with special guests from the world of science and comedy.\r\n\r\nPast guests have included Chris Hardwick, Karen Gillan, Rhys Darby, Peter Serafinowicz, Gallagher (sorry about that one), The Sklar Brothers and TJ Miller, not to mention actual scientists such as Dr. Sean Carroll and Dr. Janna Levin and astronaut Chris Hadfield.\r\n\r\nIt&#039;s the most topical, up-to-date, half-assed science, delivered straight to you in bite-sized comedy chunks.",
  "Bio": "The hit podcast in which three professional comedians who are also incompetent scientists take you through this week in science. Incompetently. Featuring Matt Kirshen (Jimmy Fallon, Craig Ferguson, Nerdist, Last Comic Standing), Andy Wood (Jason Nash Is Married, MOCKpocalypse), Jesse Case (Just For Laughs, Live At Gotham, Last Comic Standing), with special guests from the world of science and comedy.\r\n\r\nPast guests have included Chris Hardwick, Karen Gillan, Rhys Darby, Peter Serafinowicz, Gallagher (sorry about that one), The Sklar Brothers and TJ Miller, not to mention actual scientists such as Dr. Sean Carroll and Dr. Janna Levin and astronaut Chris Hadfield.\r\n\r\nIt&#039;s the most topical, up-to-date, half-assed science, delivered straight to you in bite-sized comedy chunks.",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/probablysciencesallyart.jpg",
  "SubmittedId": "10372",
  "Position": "15",
  "id": "10372",
  "pageUrl": "10372-probably-science",
  "events": []
 },
 {
  "Name": "Brew HaHa: The Comedy Show Drinking Game",
  "Copy": "One part comedy show, two parts drinking game, Brew Haha is a hilarious interactive mix of standup comedy and your favorite pre-party ritual.  At the beginning of every show, the hosts introduce the crowd to a set of rules created specifically for that show.  When a comic, unbeknownst to them, breaks a rule, the audience drinks. A giant light-up “drink” sign will help you play along.  A second game, specifically for the performers, ensures that as the audience gets toastier, so do the comedians.\r\n\r\nThe rules are simple, but nobody is forced to participate, and the hosts ensure everyone gets home safe. So strap on your party hat and make sure you experience the show that a super famous comedian once called “the worst idea for a show ever”.",
  "Bio": "One part comedy show, two parts drinking game, Brew Haha is an interactive mix of standup comedy and your favorite pre-party ritual.  At the beginning of every show, the hosts tell fun stories from past parties and then introduce the crowd to a set of rules created specifically for that show.  When a comic, unbeknownst to them, breaks a rule, the audience drinks. A giant light-up “drink” sign will help the audience play along.  Examples of rules include, &quot;every time a comic uses a funny voice, or sings&quot;, &quot;every time a comic talks about a romantic relationship past or present&quot;, or &quot;every time a comic tries to guess a rule&quot;.  A second game, specifically for the performers, ensures that as the audience gets drunker, so do the comedians.",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/brewhaha_clean.jpg",
  "SubmittedId": "9710",
  "Position": "16",
  "id": "9710",
  "pageUrl": "9710-brew-haha-the-comedy-show-drinking-game",
  "events": []
 },
 {
  "Name": "The OkCupid Show",
  "Copy": "Real people, real dates, live on stage in front of a real audience. \r\n\r\nRemember that time you sat next to that awkward couple on a first date and couldn&#039;t help but listen in? Fascinating, right? This show takes that moment and puts it on stage - no more hiding your eavesdropping behind a menu. Love scientists Amanda Sitko and Eli Newell guide a real dude through three real dates with three real ladies and it gets real weird. \r\n\r\nThe OkCupid Show has been playing to sold out houses at the Upright Citizens Brigade Theater in Los Angeles for the last four years and is finally making its way up to the Great NorthWest. Featuring some of LA&#039;s top improvisers, this show takes you on a journey you&#039;ll never forget. ",
  "Bio": "We get a real guy from OkCupid and set him up on three blind dates with three real ladies from OkCupid - all live on stage. Amanda and Eli (and the audience) coach the guy through the awkwardness and obstacles of each date. As a bonus, each date is interrupted by some fictional character from the guys&#039;s past who just happens to be in the restaurant. \r\n\r\nThe OkCupid Show has been running at UCB for almost four years now and we are currently working with Sony to develop it for TV.\r\n\r\nThis show is reality tv on stage. It is weird and awkward and intense and super hilarious. A funny car crash you can&#039;t stop watching.",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/okc_blank_1.jpg",
  "SubmittedId": "10220",
  "Position": "17",
  "id": "10220",
  "pageUrl": "10220-the-okcupid-show",
  "events": []
 },
 {
  "Name": "Nerdist&#039;s Sex Nerd Sandra Podcast",
  "Copy": "Curious about the naughty side of life? Come giggle with Sandra at the cuddly side of the sex pool! Exploring fascinating topics &amp; perspectives on sex &amp; love, join sexuality educator Sandra Daugherty &amp; special guests for a loving laugh at the fundamentals of human nature.\r\n\r\nSandra is known the world over for her podcast, “Sex Nerd Sandra.” At once irreverent and educational, the show has earned a top spot on iTunes. Its loyal listenership (over 8 million downloads) is vocal about Sandra’s impact, describing her as “inspiring” with “contagious enthusiasm” and an “awesome nerd-like ability that [she’s] not afraid to show.” Her weekly podcast has run since 2011 under the Nerdist Industries banner with no end in sight. $20 All Ages (recommended for mature audiences)\r\n\r\n***\r\nAbout Sex Nerd Sandra:\r\n\r\nSandra Daugherty punches sexual shame in the face. The sex educator is a firm believer in the right to healthy intimate experiences and the skills that get us there.\r\n\r\nSandra is known the world over for her podcast, “Sex Nerd Sandra.” At once irreverent and educational, the show has earned a top spot on iTunes. Its loyal listenership (over 8 million downloads) is vocal about Sandra’s impact, describing her as “inspiring” with “contagious enthusiasm” and an “awesome nerd-like ability that [she’s] not afraid to show.” Her weekly podcast has run since 2011 under the Nerdist Industries banner with no end in sight.\r\n\r\nHer professional journey began in 2009 normalizing sexuality through sex-positive workshops and she continues to teach as well as appearing across other platforms including web and TV shows, podcasts, documentaries, panels, lectures, personal coaching and consulting.\r\n\r\nHer background in cultural anthropology, philosophy and broadcast journalism provide crucial lenses through which she views her work. Sandra has completed the comprehensive sex educator training program provided by San Francisco Sex Information (SFSI), attends professional conferences and workshops regularly and devours literature on all related topics with retention equal to her curiosity.\r\n\r\nBrimming with book smarts and street smarts, Sandra is passionately committed to creating a safe space for each person’s unique intimate needs. Her methods include heavy doses of physical comedy, playful insight and surprising disclosure.\r\n\r\nBorn and raised in Los Angeles, she is an avid traveler and lover of big questions.",
  "Bio": "Lighthearted, sex-positive and curiosity driven, I am always amazed at how brilliantly the podcast gives comedian ample material for laughs. Previously co-hosted with Dave Ross,  I explore a topic a week. While comedy leaning myself, I love playing an awkward straight man with naive questions to the many comedians who come on the show. \r\n\r\nFresh from 2 wonderfully successful shows at SF Sketchfest, one on multiple orgasms and the other on friends with benefits, I&#039;m hoping to do something that even further highlights comedians. I&#039;ve been wanting to do a show on urban dictionary terms (slightly @midnigh-like) or interview a Portland sex club manager with the help of a few comics. \r\n\r\nI just think it would be silly fun. Plus last time I was there we sold out Dante&#039;s, so I know I have an audience at Bridgetown. Thanks for considering!",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/sandra_shocked_final.jpg",
  "SubmittedId": "10203",
  "Position": "18",
  "id": "10203",
  "pageUrl": "10203-nerdists-sex-nerd-sandra-podcast",
  "events": []
 },
 {
  "Name": "Heart of Darkness",
  "Copy": "Hosted by Greg Barris and his house band, The Forgiveness, Heart of Darkness is a psychedelic showcase of comedy, live music and fringe scientists that is a frequent Time Out New York critic’s pick, much loved by BrooklynVegan and hailed as ‘Excellent’ by The New Yorker.\r\n\r\nNew York performances have included ‘Mind Warriors’ like Graham Hancock, Heather Berlin Ph.D, Dennis Mckenna , Andrew W.K., Daniel Pinchbeck, along with comedians Janeane Garofalo, Jim Gaffigan and Reggie Watts, Chelsea Peretti, Fred Armisen, Jim Gaffigan, Michael Showalter and more.\r\n\r\n&quot;At the bimonthly, bicoastal comedy event called Heart of Darkness, the atmosphere is more of a communal gathering. Comics share their jokes almost campfire-style, backed with a house band that can shift the mood from light-hearted to trippy to introspective&quot; \r\n-The Village voice  \r\n\r\n“Greg Barris is the perfect combination of very good looking, hilarious and \r\nsuper-weird”   \r\n-Paper Magazine\r\n\r\n“Barris’s show features crazed comedy, live music and bizarro antics  — a mixture that landed it its 20th sold-out show in a row in Brooklyn.”\r\n- LA Times\r\n",
  "Bio": "Hi . \r\n\r\n  I&#039;ve been thinking about doing my show Heart of Darkness at Bridgetown for a few months now.  I think it would be a very perfect fit. \r\n\r\nEach show has a guest speaker we call a &#039;Mind Warrior&#039;, 2-3 comedians and a musical guest. In the past we&#039;ve had Mind Warriors  Graham Hancock,  Heather Berlin Ph.D, Dennis Mckenna ,  Andrew W.K., Daniel Pinchbeck and many more, as well as comedians Janeane Garofalo, Jim Gaffigan and Reggie Watts, Chelsea Peretti, Fred Armisen, Jim Gaffigan, Michael Showalter among many others.   The show is a themed variety show featuring 3 comics, a scientist and a musical guest with a house band and me hosting. The audience is also very involved: we bring an audience member on stage to sit in the &#039;I love you chair&#039; and at the end of the show we forgive everyone for their sins getting as many as we can by going into the audience.  I&#039;ll book comics that will already be coming to Bridgetown and contact a few local bands. I&#039;ve performed in Portland a decent amount of times and know musicians and am confident it would be easy to pull off. \r\n\r\nThe show is a way for artists and audience members to participate and collaborate in ideas and experience something that will only happen once.  \r\n\r\nI just did one at the Brooklyn Museum and will be in LA this Feb to do the Cinefamily and then the Hollywood Improv in March.  \r\n\r\nI would really love to do as many as I could in Bridgetown.  it would be most most excellent.  \r\n\r\nlove,\r\nGreg\r\n\r\n\r\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/10562479_10152679710938934_1004616428426174128_o.jpg",
  "SubmittedId": "9933",
  "Position": "19",
  "id": "9933",
  "pageUrl": "9933-heart-of-darkness",
  "events": []
 },
 {
  "Name": "The Grawlix",
  "Copy": "Based in Denver, Colorado, The Grawlix is the world&#039;s best comedy show that consists of Adam Cayton-Holland, Andrew Orvedahl and Ben Roy. A combination of sketch, video and stand-up (let&#039;s be honest, mostly stand-up) the Grawlix has performed at such festivals as Bridgetown, SXSW, The New York Comedy Festival, Riot LA, Crom Comedy Festival and the High Plains Comedy Festival. The Grawlix recently filmed a pilot for TRU TV entitled &quot;Those Who Can&#039;t.&quot; The process swelled their heads and egos, but not to the point where they are totally insufferable. Yet. www.grawlixcomedy.com",
  "Bio": "Based in Denver, Colorado the Grawlix consists of comics Adam Cayton-Holland, Andrew Orvedhal and Ben Roy. The three of us host the show with a sketch up top - sweet, sweet banter between the three of us - and then some standup with a video or two thrown in for good measure. After much experimentation we&#039;ve found that the up-front with the three of us, then a video, then pretty much a stand-up show after that (with the three of us taking turns MCing, usually with some running through-line we conceive on the fly) is the best way to pull this show off. We&#039;ve done The Grawlix at Bridgetown before, as well as SXSW, The New York Comedy Festival, Riot LA and the High Plains Comedy Festival. We also just filmed a pilot for TRU TV and by the time Bridgetown rolls around we could very well have had that pilot picked up so we&#039;ll be MEGA HUGE STARTS BUT STILL WITH HUMBLE ATTITUDES AND GOOD TIME VIBES. ",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/grawlixomaha.jpg",
  "SubmittedId": "10111",
  "Position": "20",
  "id": "10111",
  "pageUrl": "10111-the-grawlix",
  "events": []
 },
 {
  "Name": "The Mike Eagle Show/Secret Skin Live",
  "Copy": "What happens when Open Mike Eagle brings together comics, hip-hop artists, and writers in a room? Music, conversation, and comedy. This is The Mike Eagle Show: Secret Skin live. After the success of Secret Skin on the Infinite Guest Podcast Network, Open Mike Eagle is bringing the live experience to the stage with special guests.",
  "Bio": "Open Mike Eagle is an L.A. based hip-hop artist. On Secret Skin, he and his guests examine what’s really going on behind the face that comics and hip-hop artists put on for the public. The in-jokes. The heavy stuff. The tour stories. The day-to-day struggles and absurdities of being a working musician. The Secret Skin.\r\n\r\nDeveloping from the Mike Eagle variety shows that took place in LA, Seattle, San Francisco, New York, and Atlanta, Mike Eagle&#039;s Secret Skin Live combines the comedy and rap performances of his live show with a quick-fire interview format that allows each performer to illuminate their story in a way that their peformance might not allow. Interviews are edited together to create special live episodes of the Secret Skin podcast\r\n\r\npast stand up guests: Hannibal Buress, James Adomian, Cameron Esposito, Chris Gethard, Baron Vaughn, Greer Barnes and many more\r\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/tumblr_ndptbthiaq1qetalto1_500.jpg",
  "SubmittedId": "10230",
  "Position": "21",
  "id": "10230",
  "pageUrl": "10230-the-mike-eagle-showsecret-skin-live",
  "events": []
 },
 {
  "Name": "Roustabout",
  "Copy": "Kurt Braunohler&#039;s brand of comedy could be described as &quot;high-energy absurdity from an approachable stranger&quot; but he prefers to describe his brand as &quot;Doritos&quot;.\r\n\r\nKurt was named a &quot;Comic To Watch&quot; by Variety, Time Out NY, Time Out LA, Comedy Central, and the NY Comedy Festival.  On TV, Kurt has been seen on CONAN, The Tonight Show, Delocated, Comedy Central Presents, BUNK, John Oliver Presents, @Midnight, Chelsea Lately, Bob&#039;s Burgers, New Girl, Drunk History, Getting Doug with High, Adam Devine&#039;s House Party and more.\r\n\r\nKurt rode a jet ski from Chicago to New Orleans on a seven city water tour/ charity mission to send 500 goats and 1,000 chickens to families in need in Africa. The adventure was filmed by Comedy Central and Kurt&#039;s nine episode &quot;Roustabout&quot; webseries is now availble on cc.com.   \r\n\r\nHis debut comedy album How Do I Land? made AV Club, Paste Magazine, Village Voice, and Time Out New York&#039;s  Best Of lists.   His popular podcast &quot;The K Ohle&quot; airs weekly on the Nerdist Network.",
  "Bio": "Kurt Braunohler&#039;s brand of comedy could be described as &quot;high-energy absurdity from an approachable stranger&quot; but he prefers to describe his brand as &quot;Doritos&quot;.\r\n\r\nKurt was named a &quot;Comic To Watch&quot; by Variety, Time Out NY, Time Out LA, Comedy Central, and the NY Comedy Festival.  On TV, Kurt has been seen on CONAN, The Tonight Show, Delocated, Comedy Central Presents, BUNK, John Oliver Presents, @Midnight, Chelsea Lately, Bob&#039;s Burgers, New Girl, Drunk History, Getting Doug with High, Adam Devine&#039;s House Party and more.\r\n\r\nKurt rode a jet ski from Chicago to New Orleans on a seven city water tour/ charity mission to send 500 goats and 1,000 chickens to families in need in Africa. The adventure was filmed by Comedy Central and Kurt&#039;s nine episode &quot;Roustabout&quot; webseries is now availble on cc.com.   \r\n\r\nHis debut comedy album How Do I Land? made AV Club, Paste Magazine, Village Voice, and Time Out New York&#039;s  Best Of lists.   His popular podcast &quot;The K Ohle&quot; airs weekly on the Nerdist Network.",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/roustabout-title-logo.png",
  "SubmittedId": "10319",
  "Position": "22",
  "id": "10319",
  "pageUrl": "10319-roustabout",
  "events": []
 },
 {
  "Name": "Uncalled Four",
  "Copy": "Comedians and live audiences come together to make a show for Bridgetown&#039;s worst people: Uncalled Four. When posed ridiculous questions generated by those in attendance, comedians draw from a deck of their own creation to give the most twisted and hilarious answers. Performing stand-up to start the show, each comic has a chance to win over the crowd by giving them a glimpse into their psyche. During the game show,  audience members win prizes and serve as judge and jury to see which anonymously entered card is truly Qthe worst (read: best) of the round.",
  "Bio": "Formerly known as &quot;Comics Against Civility&quot;, this comedy game show is loosely based on Cards Against Humanity. Four comedians create decks of 20 offensively hilarious ideas (&quot;Subjecting white people to actual suffering.&quot; or &quot;A burka for your fleshlight.&quot;) to answer audience cards suggested before the show. Audience members win prizes and serve as judge and jury to see which card is truly the worst (read: best) of the round. At the end of the 30 minute round, there&#039;s one final opportunity to wager points and determine which member of the panel is the most &quot;Uncalled Four&quot;. Each game opens with a stand-up portion featuring all performers. Please note that all social media and website accounts are currently being updated after receiving a nice cease and desist from Cards Against Humanity. Our legal team has assured us our new format is 100% legal.",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/uncalled_four_logo.png",
  "SubmittedId": "9936",
  "Position": "23",
  "id": "9936",
  "pageUrl": "9936-uncalled-four",
  "events": []
 },
 {
  "Name": "Meet Me in the Bathroom and Tell Me All your Secrets",
  "Copy": "An incredible night of comedy, music, and gunplay hosted by Dave Hill with house band Valley Lodge.",
  "Bio": "Variety show with music, comedy and one part x-factor.",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/meet-me-under-the-misteltoe-8335.jpg",
  "SubmittedId": "10045",
  "Position": "24",
  "id": "10045",
  "pageUrl": "10045-meet-me-in-the-bathroom-and-tell-me-all-your-secrets",
  "events": []
 },
 {
  "Name": "The Nickel Club",
  "Copy": "Dear people of Bridgetown:\r\n\r\nYou&#039;ve been chosen to join an exclusive society of the arts and culture, The Nickel Club:  A community so special you&#039;ll want to tell everyone about it, but won&#039;t... because now... you&#039;re in on the secret. \r\n\r\nBe prepared for a spectacular night of jazz, traditions, comedy, and laughter as the world&#039;s best and funniest will be there to welcome you to the world&#039;s premier secret club.  We look forward to you joining our ranks.  \r\n\r\nThe Nickel Club... surviving the constant cascade of modern mediocrity.  Sero venientes male sedentes.",
  "Bio": "The Nickel Club is a theme show in LA that promises audience members an immersive night of comedy, jazz, and fun. Each show starts with the audience being ushered into the world of &quot;The Nickel Club&quot;, the world&#039;s premiere secret society. Like a 1920s speakeasy, as the audience arrives, they give the password to &#039;the bouncer&#039; (played by a comic), they are led into the secret venue by lantern (venue dependent) where they will find the producers in character and dressed to the 9&#039;s as a live jazz band plays classic tunes. To begin the show, the hosts &quot;initiate&quot; the audience into the Nickel Club, a society that has been around as long as time. Then, the comedy show starts, which is their reward for being part of this exclusive secret society. The comics then do sets where they can play along with the jazz band. Some ask them to punctuate jokes, others ask them to do nothing, others still have the band play sweet melodies behind a story or a joke.  After the show, time permitting, the band plays and people enjoy the rest of their night.",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/nickel1.jpg",
  "SubmittedId": "9781",
  "Position": "25",
  "id": "9781",
  "pageUrl": "9781-the-nickel-club",
  "events": []
 },
 {
  "Name": "TV Guidance Counselor",
  "Copy": "Hosted by well respected Boston based comedian Ken Reid, TV Guidance Counselor is a new podcast about old TV. The premise is,  Ken owns every TV Guide from 1980-1995 or so. Someone  picks a random TV Guide, writes down everything in it that they want to watch in prime time (8-10pm) and then the podcast is the discussion of their choices. Ken does occasionally break format for the celebrity editions, where the TV Guide is used as an inspiration to discuss their careers.\r\n\r\n60  episodes are out so far (and a lot more banked) and they have been getting a really great response (Ken is also having a ton of fun doing them). The conversations kind of get into stories about growing up, people&#039;s relationship with television, some cultural/media studies dissection and Ken spits out a lot of trivia. It&#039;s a fun conversation.  \r\n\r\nIt&#039;s up on iTunes if you want to check it out\r\nhttps://itunes.apple.com/us/podcast/tv-guidance-counselor-podcast/id821665905\r\n\r\nThere&#039;s more detail and what not also up on the webpage\r\nhttp://tvguidancecounselor.com/\r\n \r\nGuests have included Jim Beaver (Supernatural, Justified, Deadwood) Captain Sensible and Dave Vanian of the Damned, Amy Sedaris, Christian Finnegan, Laura Kightlinger, JoAnn Willete (Just the Ten of Us, Facts of Life), Melanie Chartoff (Fridays, Parker Lewis Can&#039;t Lose, Rugrats), Laraine Newman, Michael Ian Black, Kumail Nanjiani, James Adomian, Jonathan Katz, Andy Kindler, Hari Kondabolu, Alex Edelman, Myq Kaplan, Kelly MacFarland,  Bethany Van Delft, Danny Tamberelli (&quot;The Adventures of Pete and Pete), Josh Gondelman, Giulia Rozzi, Adam Resnick (Get a Life, Cabin Boy), Julia Duffy, Vanessa Angel and more\r\n\r\nHere&#039;s an incredibly nice piece Cinema Blend recently wrote about the show:\r\n\r\nhttp://www.cinemablend.com/television/TV-Guidance-Counselor-Nostalgia-Driven-Comedy-Podcast-You-Need-Listening-66551.html\r\n\r\nand here&#039;s one from USA Today&#039;s Pop Candy Blog\r\n\r\nhttp://www.usatoday.com/story/popcandy/2014/07/28/tv-guidance-counselor/13280167/\r\n\r\nand it got recently featured in the New York Times as well. \r\nhttp://www.nytimes.com/2014/10/03/nyregion/new-york-super-week-offers-cultural-highlights.html?_r=1\r\n\r\nKen has also done live editions of the show at New York Comic Con, New York Super Week, North East Comic Con, The Boston Comedy Festival and Riot LA. ",
  "Bio": "This show is a ton of fun and fairly unique. It&#039;s not snarky at all. We show a real reverence for the shows of our youth and peel back life experiences to discuss living situations and the shared experience of classic television. It&#039;s a fun conversation and a nice change from stand up.\r\n\r\nUnlike other Stand up comedian fronted podcasts, this one doesn&#039;t focus too much on the mechanics of comedy. Although I&#039;ve only been doing the show a year, we&#039;re getting about 10k downloads a month all over the world. I&#039;ve also had some experience with doing live editions as we&#039;ve done them now at New York Super Week/New York ComicCon (with Amy Sedaris), North East Comic Con (with Evan Michaelson from Oddieis/Obscura Antiques), The Boston Comedy Festival (with Emmanuel Lewis of Webster) and will have done one at Riot LA in January (guest TBA, I know who it is, but don&#039;t want to jinx it, nice big name).\r\n\r\nI have a unique knowledge of television and revisiting a specific week of our lives always leads to some fun tangents and interesting insights from my guests.\r\n\r\nI own every issue of TV Guide, and review them frequently. It&#039;s a life long passion and it&#039;s interesting to see how people form all different backgrounds share an early love of television. ",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/kentvgc_0.jpg",
  "SubmittedId": "9240",
  "Position": "26",
  "id": "9240",
  "pageUrl": "9240-tv-guidance-counselor",
  "events": []
 }
]