{
  "id": 11388,
  "events": [],
  "emceeEvents": [],
  "name": "Mark Normand",
  "twitter": "marknorm",
  "website": "",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/normand.jpg",
  "photoUrl": "/api/img/performer-images/performer-marknormand-300x300.jpg",
  "sortOrder": 53,
  "bio": "<p>Mark Normand is a fun-loving, New York comedian. Ok, I&#039;m gonna brag a little here but hey, it&#039;s business... So far, Mark has done a Comedy Central HALF HOUR special, has appeared on TBS’s CONAN twice, Showtime&#039;s &quot;Live at SXSW&quot;, INSIDE AMY SCHUMER, TruTv, Best Week Ever, Last Comic Standing, @Midnight and released an album with Comedy Central records titled &quot;Still Got It&quot; (its not bad). In 2013 won Caroline&#039;s March Madness competition, beating out 63 other comedians. And this is a real shocker for all of us but he was also voted Village Voice&#039;s &quot;Best Comedian of 2013&quot;, I know right? In 2012, Mark appeared on “John Oliver’s New York Standup Show” on Comedy Central, and in 2011 was picked as one of Comedy Central&#039;s &quot;Comics to Watch.&quot;</p>\n<p>Mark was born and raised in New Orleans, LA surprisingly to two normal parents. As a kid he spent most of his time shooting short films and wetting the bed. Mark started doing comedy right after college and quickly moved to New York. Mark now does comedy clubs and colleges across the country and has been involved in many festivals including Portland, Seattle, DC, Boston, and was featured as a New Face at the Montreal Comedy Festival.<br />\nMore annoying accolades that no one really cares about: Mark was named one of Comedy Central’s Comics To Watch for the 2011 New York Comedy Festival. Mark was also named Esquire’s “Best New Comedians 2012”, Splitsider’s “Top 10 Up and Coming Comedians on Each Coast”, and Time Out New York’s “21 New York Comedy Scene Linchpins”. Whew, sorry about all that.</p>\n",
  "pageUrl": "11388-mark-normand"
}