{
  "id": 11439,
  "events": [],
  "emceeEvents": [],
  "name": "Dan Telfer",
  "twitter": "dantelfer",
  "website": "http://dantelfer.com/",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/dan_telfer.jpg",
  "photoUrl": "/api/img/performer-images/performer-dantelfer-300x300.jpg",
  "sortOrder": 33,
  "bio": "<p>Dan Telfer wrote and performed comedy in Chicago for 15 years before moving to Los Angeles. As a writer for The Onion he was responsible for headlines like Drunk Women Find Their Run Across Busy Street Hilarious and for the web series The Onion’s Extremely Accurate History of the Internet. He was also in charge of an entire team of writers, and headed The Onion’s advertising integration department. As a stand-up comic he has toured as an opener for Maria Bamford, Brian Posehn and Patton Oswalt.<br />\nIn 2011, Dan was selected to perform at the Chicago Just For Laughs Festival’s Best of the Fest show, the Montreal Just For Laughs Festival’s Talk of the Fest show, and the coveted New Faces of Comedy showcase of both festivals.<br />\nIn addition to The Onion his writing has appeared in Paste Magazine, The A.V. Club, and the official book based on the TV show Mad Men: The Illustrated World. </p>\n<p>Dan is currently a social media producer on Comedy Central’s @midnight, which won an Emmy for Outstanding Interactive Program. He has also appeared as a panelist on the show. </p>\n<p>He is perhaps known best for his stand-up chunk “The Best Dinosaur,” which became a runaway viral video hit. The routine earned a massive internet following, and was performed on TBS’s The Pete Holmes Show.<br />\nDan has appeared on popular LA podcasts such as Comedy Bang Bang and Doug Loves Movies, and recurs on Brian Posehn’s Nerd Poker. Dan’s debut CD EP Fossil Record was a split release with Greg Proops and Paul F. Tompkins. This, along with both his full length CDs, have all appeared on AST Records. His latest full length Ocean of Panic debuted at #1 on iTunes Comedy.</p>\n",
  "pageUrl": "11439-dan-telfer"
}