{
  "id": 11443,
  "events": [],
  "emceeEvents": [],
  "name": "Greg Behrendt",
  "twitter": "gregorybehrendt",
  "website": "http://www.thekingsweater.com/",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/gb_picture.jpg",
  "photoUrl": "/api/img/performer-images/performer-gregbehrendt-300x300.jpg",
  "sortOrder": 138,
  "bio": "<p>Greg Behrendt is always busy! In 2009, “He’s Just Not That Into”, the movie based on his bestselling book, opened in theaters nationwide and was America’s number one movie. Behrendt’s second comedy special, “That Guy from That Thing,” was released by Image Entertainment after premiering on Comedy Central and Greg made his Edinburgh Festival debut at The Assembly Rooms. In 2010, Greg wrote half hour sitcom pilots for CBS and NBC, produced and starred in “There Might Be Cake”, an unscripted pilot for IFC, and performed stand-up at both the Melbourne and Montreal International Comedy Festivals. He also worked as a Consulting Producer on NBC’s Love Bites, and launched the podcast “Walking the Room” which he hosts along with Dave Anthony.  In 2011, Greg headlined an episode of John Oliver’s New York Standup Show, performed stand-up at the Cape Town Comedy Festival in South Africa and began touring his “Starfish Circus” show, a live version of the “Walking The Room” podcast with Dave Anthony.  In 2012, Greg has performed stand-up at the Montreal, Melbourne and New Zealand International Comedy Festivals and wrote a comedy pilot for AMC with Hank Azaria and Jerry Stahl.  In 2014, Greg worked as a creative consultant for the Oxygen series “My Crazy Love”, and has continued to tour his standup all over the world, including a trip back to the Melbourne Comedy Festival in April, which kicked off an 8 week tour of Australia. In 2015 and now in 2016 he has continued to tour clubs all over the country, as well as returning to festivals such as San Francisco’s Sketchfest and a return to Australia and the Melbourne Comedy Festival. Greg continues to appear on padcasts, tour with his band The Reigning Monarchs, and write books with his wife Amiira Ruotola-Behrendt.  Their latest book “It’s Just A F*@#ing Date” was released in 2015 and quickly climbed the iBooks charts.</p>\n",
  "pageUrl": "11443-greg-behrendt"
}