{
  "id": 11482,
  "events": [],
  "emceeEvents": [],
  "name": "Rebecca O&#039;Neal",
  "twitter": "becca_oneal",
  "website": "http://beccaoneal.tumblr.com/aboutme",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/12398676_10204070943372711_1956581658_o.jpg",
  "photoUrl": "/api/img/performer-images/performer-rebeccao039neal-300x300.jpg",
  "sortOrder": 131,
  "excludeFromList": false,
  "bio": "<p>Rebecca O’Neal is a Chicago based stand-up comedian and writer/editor whose work can be read on/in Vanity Fair Magazine, Gawker.tv, Splitsider.com, Videogum.com, The Rumpus, Death and Taxes Magazine, and more.</p>\n<p>Since she began stand-up comedy in early 2012, Rebecca has performed at Portland’s 2013 &amp; 2014 Bridgetown Comedy Festival, RIOT LA Comedy Festival, The Comedy Exposition of 2014 &amp; 2015, The Onion and The AV Club’s 2nd Annual 26th Annual Comedy Festival, NBCUniversal and Second City’s Break Out Comedy Festival, UP Comedy Club, Chicago Underground Comedy, Comedians You Should Know, Chicago Women’s Funny Festival 2012, 2014, and headlined 2013, Queer Comedy at Zanies, The Comedy Shrine, Laugh Factory Chicago, The Hollywood Improv, The Ohio Lesbian Festival, and many other showcases in and around Chicago. She has also<br />\nopened for Maria Bamford, Janeane Garofalo, Hannibal Buress, Al Madrigal, Jon Reep, Pete Correale, and Ron Funches.</p>\n<p>Rebecca is a former cast member of the 14th season of Chicago’s historic Lincoln Lodge and a regular at Laugh Factory Chicago - and was a recurring guest on Vocalo.org’s Morning Amp and has appeared as a guest comedy commentator or WBEZ’s Morning Shift with Tony Sarabia.<br />\nShe currently produces a monthly free, BYOB comedy showcase in Chicago called Congrats on Your Success (for which she does the promotion and public relations) that has been featured in/on WBEZ/NPR, The Chicago Tribune, Chicago Magazine, The Huffington Post, Vocalo.org, The<br />\nChicago Reader, The Red Eye’s Eat Drink Do column, Time Out Chicago, Gapers Block, Chicagoist, LoganSquarist, Chicago Now, ChooseChicago.com, AfterEllen.com and many local blogs and websites. Rebecca has been featured in Paper Magazine (the Kim Kardashian butt mag), Bitch Magazine, NPR, The Chicago Reader, Chicago Magazine, Huffington Post and Huffington Post Chicago and more.</p>\n<p>Rebecca O’Neal is a hilariously cerebral and confessional young comic whose upbringing on Chicago’s southside coupled with her love of language and tendency toward simultaneous introspection and extroversion endear her to audiences of all backgrounds. By humorously mining her experiences, she makes the<br />\nesoteric universal.</p>\n",
  "pageUrl": "11482-rebecca-oneal"
}