{
  "id": 11494,
  "events": [
    12724,
    12822,
    12828,
    12943
  ],
  "emceeEvents": [
    12742
  ],
  "name": "Nato Green",
  "twitter": "natogreen",
  "website": "http://www.natogreen.com",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/582836_10151023128054265_435952587_n.jpg",
  "photoUrl": "/api/img/performer-images/performer-natogreen-300x300.jpg",
  "sortOrder": 108,
  "excludeFromList": false,
  "bio": "<p>Nato Green was summed up more or less accurately by The East Bay Express as, “erudite and acerbic, a San Francisco-raised father, union organizer, gastronome, bibliophile, and political sparkplug.” His first comedy album, The Nato Green Party, was released by Rooftop Comedy in 2012. Nato has been named San Francisco&#039;s Best Comedian by the SF Weekly, Huffington Post, and CBS.</p>\n<p>Nato is the creator of Iron Comic, the Iron Chef-spoofing comedy game show he often co-hosts with Moshe Kasher. Nato has a regular column in the San Francisco Examiner, and his humor commentaries have appeared in VICE, Truthdig, Huffington Post, the San Francisco Bay Guardian, The Rumpus, and The Bold Italic. He also hosts FSFSF, a short spotlight on Bay Area comedy that airs every weekday during NPR&#039;s All Things Considered on 91.7FM KALW. </p>\n<p>Nato wrote for Totally Biased with W. Kamau Bell on FX and toured nationally with W. Kamau Bell &amp; Janine Brito as Laughter Against the Machine. </p>\n<p>&quot;The most dangerous comedian alive.&quot;<br />\n--Jeff Chang, author of Who We Be: The Colorization of America </p>\n<p>&quot;Righteous and hilarious, Nato is like finding a shot of bourbon at your co-worker&#039;s stupid vegan potluck.”<br />\n--Daniel Handler, aka Lemony Snicket</p>\n<p>“Nato is funny, smart, thoughtful, goofy and political. As of now, I suffer no consequences for my steadfast belief that Nato is one of the funniest comics in our country, but I would stage a sit-in. If it fits in between my Ashtanga yoga and zine-making classes.”<br />\n--Maria Bamford, Comedian</p>\n<p>“Nato Green is the real deal; cogent, hilarious and indispensable.”<br />\n--Greg Proops, Comedian, The Smartest Man in the World podcast</p>\n<p>“I’ve always tried to provide the soundtrack to the revolution. Nato Green provides the laugh track.”<br />\n--Boots Riley of The Coup</p>\n",
  "pageUrl": "11494-nato-green"
}