{
  "id": 11728,
  "events": [
    12740,
    12752,
    12792,
    12808
  ],
  "emceeEvents": [
    13020
  ],
  "name": "Bil Dwyer",
  "twitter": "bildwyer",
  "website": "",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/dwyer.jpg",
  "photoUrl": "/api/img/performer-images/performer-bildwyer-300x300.jpg",
  "sortOrder": 30,
  "excludeFromList": false,
  "bio": "<p>Bil is an accomplished standup comic, who has appeared on The Tonight Show with Jay Leno, The Late Late Show with Craig Kilborn, and his very own half hour standup special, Comedy Central Presents: Bil Dwyer.  His takes on marriage, kids and family are hip and sardonic, and yet beneath lies a certain odd sweetness.</p>\n<p>Bil has hosted GSN’s I’ve Got a Secret, Comedy Central’s BattleBots, Fox Sports’ Ultimate Fan League, PAX-TV’s Dirty Rotten Cheaters, GSN’s Extreme Dodgeball , MTV’s The 70’s House, and the Tiny Football League which ran at halftime on NBC’s Sunday Night Football</p>\n<p>Besides appearing on great television shows like Parks and Recreation, Children&#039;s Hospital, The Middle, House of Lies, Suburgatory, The Larry Sanders Show, Hot in Cleveland, Ally McBeal, and yes, iCarly,  Bil has also been in such forgettable films as Ski School 2, The Bogus Witch Project, and What Planet are You From? Writing with sitcom star/television producer Christopher Titus, Bil co-created a show based on his stand-up comedy called Back After This for Sony Pictures Television.</p>\n<p>A regular commentator on various cable shows, he is most often recognized for his work on VH1’s highly-rated I Love the… series.  Bil was also seen as a finalist on Season 4 of NBC’s Last Comic Standing and starred in Cartoon Network’s live action/animation hybrid series, Out of Jimmy’s Head.   Bil currently hosts Stardumb!, a live celeb-studded game/talk/improv comedy hybrid, which has been seen at L.A.’s RIOT! Fest and San Francisco Sketchfest.</p>\n",
  "pageUrl": "11728-bil-dwyer"
}