{
  "id": 11778,
  "events": [
    12682,
    12729,
    12767,
    12830,
    12831
  ],
  "emceeEvents": [
    12793
  ],
  "name": "J.P. McDade",
  "twitter": "jp_mcdade",
  "website": "http://jpmcdade.squarespace.com",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/head_shot_3.jpg",
  "photoUrl": "/api/img/performer-images/performer-jpmcdade-300x300.jpg",
  "sortOrder": 88,
  "excludeFromList": false,
  "bio": "<p>J.P. McDade started doing stand up comedy in New York City in the Fall of 2012. He began by hitting open mics and grinding through unpaid gigs in bars, but these eventually opened the door to slightly better unpaid gigs in bars. Night after night J.P. has performed at various comedy clubs, bars, and small theaters around New York and on the road and built a reputation as a clever joke writer. In 2015 he began writing for the web series Sports Balls on korkedbats.com, demonstrating his knack for topical joke writing. In addition to writing for this web series, he has appeared onscreen in several others. McDade has written for several comedians in &quot;roast battle&quot; style shows and competed on the RoastMasters show at The Stand Comedy Club in what club management called &quot;perhaps the greatest battle in RoastMasters history.&quot;</p>\n<p>Although J.P. has done his share of monologue and roast joke writing, his stand up act is more than a collection of one-liners. J.P. is a capable mimic who weaves characters and impressions into his set to keep the audience guessing and, more importantly, laughing. In New York, J.P. has gotten laughs clubs such as Caroline&#039;s, Gotham, The Creek &amp; The Cave, The Stand and countless independent shows, such as his free monthly show at Lucky Jack&#039;s called Suckerpunch. McDade has also appeared at various venues in Connecticut, Long Island, Boston and North Carolina and plans to reach many more audiences around the country in 2016.</p>\n",
  "pageUrl": "11778-jp-mcdade"
}