{
  "id": 11964,
  "events": [
    12657,
    12790,
    12825,
    13034
  ],
  "emceeEvents": [
    12719
  ],
  "name": "Tawanda Gona",
  "twitter": "GuyNamedTawanda",
  "website": "http://www.TawandaGona.Com",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/10551449_2688337847669_2937440787900891461_o.jpg",
  "photoUrl": "/api/img/performer-images/performer-tawandagona-300x300.jpg",
  "sortOrder": 134,
  "excludeFromList": false,
  "bio": "<p>My name is Tawanda Gona, I&#039;m 27 and I&#039;ve been a comedian for 7 years. I started in Boston and came up through The Comedy Studio and later Laugh Boston. I was born in Zimbabwe but I moved to America when I was 2 so I&#039;m pretty much Americanized. I&#039;ve lived all over the east coast so I have this real sweet non regional dialect that makes me sound sarcastic or cynical all the time. I think the fact that I smile a lot adds to the confusion but I digress. I love Stand Up comedy.<br />\nI like to think my act is really representative of me, it deals with where I&#039;m from, how I feel, and the person I&#039;d like to be. Boston&#039;s been pretty decent to me however I&#039;ve lately been longing for more, to be completely blunt I&#039;m tired of being seen as a &quot;novelty&quot;. But again, I digress, I love comedy. I put together my own shows because I like to see my peers have fun in an environment I know they&#039;d thrive in. In doing that I&#039;ve learned what bookers look for and how shows should be run, so the experience has helped me dramatically.<br />\nMy goals change as time progresses but right now if I could live like Jerry did on Seinfeld I think I&#039;d be satisfied with my career. A couple of late night spots, passed at some clubs, and able to live entirely off a comics salary. Besides that I just want to get better as a stand up and be around people that make me want to be better as a stand up; pretty straight forward.</p>\n",
  "pageUrl": "11964-tawanda-gona"
}