{
  "id": 12000,
  "events": [
    12768,
    12796,
    12830,
    12833,
    12941
  ],
  "emceeEvents": [],
  "name": "Mike Burns ",
  "twitter": "pizzanachos69",
  "website": "",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/mikeburnsheadshots2010.jpg",
  "photoUrl": "/api/img/performer-images/performer-mikeburns-300x300.jpg",
  "sortOrder": 49,
  "excludeFromList": false,
  "bio": "<p>Mike Burns is a Los Angeles comedian, writer, and actor via Chicago and was born and raised in Saginaw, Michigan.  He graduated from Michigan State University, and before finding his niche in comedy was a clothing designer and men’s fashion buyer.<br />\nMike is the creator of the cult hit twitter feed, @DadBoner where he ghost narrates the life of Karl Welzein from a first person perspective. Karl’s story is of an affable middle-aged Midwestern man with typical Midwestern tastes, who gets sick and tired of his wife and children’s constant ridicule and decides to move in with his schlubby best friend. The feed chronicles the hilarious decline of Karl on his journey from being a Docker’s and a golf shirt-wearing Dad, to a pony tailed party maniac, spitting out his life philosophies like a modern-day Charles Bukowski, if he preferred to get drunk at Applebee’s. Mike’s depiction of Dadboner has been regaled as “a timeless work of genius” by Anthony Bourdain, and has been listed as one of “The Top 50 Funniest People Now” by Rolling Stone and “The 50 Funniest Things the Web Ever Did” by GQ Magazine.  Karl aka Dadboner aka Mike Burns published his first book, POWER MOVES: Livin’ the American Dream, USA Style, in 2013 from the Harper Collins imprint IT Books. The rights to POWER MOVES have been optioned for an animation series at Comedy Central.<br />\nMike is a regular contributor to MTV’s Ridiculousness and his on screen credits include Comedy Central, G4, and MTV.  His festival appearances include Just for Laughs Montreal New Faces, Just for Laughs Chicago, Chicago Sketchfest , New York International Fringe Festival , The DC Comedy Festival, HBO Las Vegas Comedy Festival, and Portland’s Bridgetown Comedy Festival.<br />\nMike performs comedy regularly at venues throughout Los Angeles. He loves Stone Cold Steve Austin, Bob Seger, Ric Flair, The Tigers, Wings, Lions, and 70’s-80’s muscle cars that he can’t afford. He’d like you to buy him a cold beer. Nothin’ fancy, just whatever’s on special is fine.<br />\n***<br />\n“@Dadboner is an example of a literary artifact worth preserving--perhaps worth canonizing when it&#039;s fully realized. Deeper than &quot;Family Guy&quot; or &quot;King of the Hill,&quot; @DadBoner is a Beckett in progress.” – Huffington Post<br />\n&quot;Karl Welzein&#039;s is a tale of heartbreak, persistence, pathos--and Bold Flavors. He is a Man&#039;s Man--manlier even. A True American. A Tastemaker.  His delusional optimism could be a metaphor for America. 140 characters at a time, he has gifted us with an epic unrivaled since Homer. &quot;-Anthony Bourdain<br />\n“The person behind this account is a certifiable literary genius.” -TotalFratMove.com</p>\n",
  "pageUrl": "12000-mike-burns-"
}