{
  "id": 12468,
  "events": [
    12798,
    12807,
    12904
  ],
  "emceeEvents": [],
  "name": "Cole Stratton",
  "twitter": "colestratton",
  "website": "http://colestratton.com",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/cole_stratton_1.jpg",
  "photoUrl": "/api/img/performer-images/performer-colestratton-300x300.jpg",
  "sortOrder": 20,
  "excludeFromList": false,
  "bio": "<p>Cole Stratton wears a lot of hats. Not literal ones, as he has a tiny head and it just doesn&#039;t look right. He is the co-founder of SF Sketchfest, the San Francisco Comedy Festival, a month-long annual event highlighting the best in improv, sketch, stand-up, TV and film comedy. Now in its fifteenth year, the festival has featured performers like Tenacious D, Conan O&#039;Brien, Billy Crystal, Alan Arkin, Gene Wilder, The Kids in the Hall, The State, Mr. Show, Garry Shandling, Paul Reubens and lots of cast members from Saturday Night Live.</p>\n<p>Along with Janet Varney, he has written and performed downloadable comedic commentary to the films Dirty Dancing, Ghost, Footloose, Poltergeist, The Lost Boys, Flatliners, Dreamscape and Jaws 3D for RiffTrax.com, an online venture helmed by Mystery Science Theater 3000’s Michael J. Nelson.</p>\n<p>He’s co-host of the popular Pop My Culture Podcast, available on iTunes, their official website and nerdist.com. The podcast was named the #2 Best Comedy Podcast of the Moment by Rolling Stone; one of the 20 Best of 2013 by Paste Magazine; and appeared on Top 10 Lists by IFC.com and Mashable.com. He has also guested on other podcasts, such as Sklarbro County, James Bonding, The JV Club, Probably Science, The Wahlberg Solution, Jordan Jesse Go!, Competitive Erotic Fan Fiction, Totally Laime and The Long Shot Podcast.</p>\n<p>Due to planet alignment, he has appeared on TV’s Nash Bridges, re-enacted on America’s Most Wanted, played with puppies and Betty White on the Animal Planet original The Retrievers, thrown-down like the sarcastic white boy he is on Wilmer Valderrama’s Yo Momma, and was a cast member on NBC’s competitive comedy show Comedy Colosseum. He’s a lead in the indie comedy Callback opposite Kevin Farley, has also appeared in the films Around the Fire, Dead Man on Campus, and the festival hit horror/comedy The Selling, where he plays obnoxious office gossip Ed, a role which he will be reprising in the upcoming end-times comedy Diani &amp; Devine Meet The Apocalypse.  He’s also hawked wares in national commercials for Verizon, Popeye’s Chicken, a Wilco-scored VW spot, and a five-spot campaign for Group Health.</p>\n<p>As an improviser, Stratton tours with the Theme Park Improv Show, featuring a revolving cast including Scott Adsit, Ian Brennan, Rachel Dratch, Oscar Nunez, Danny Pudi, Simon Helberg, John Michael Higgins, Michael Hitchcock, Jessica Makinson and Janet Varney. Theme Park has performed at SF Sketchfest; The Moontower Comedy Festival in Austin, TX; The Bridgetown Comedy Festival in Portland, OR; The Rooftop Comedy Festival in Aspen, CO; The Vancouver Comedy Festival; and the Bentzen Ball in Washington, D.C. He performers regularly with MI&#039;s Westside Comedy Theater&#039;s house improv team Cobranauts and their flagship show Mission IMPROVable, and runs his own monthly improv show called Pretty, Pretty Pony, which was named one of the Best Things in Comedy of 2013 by The Comedy Bureau.</p>\n<p>Hats!</p>\n",
  "pageUrl": "12468-cole-stratton"
}