{
  "id": 12467,
  "events": [],
  "emceeEvents": [],
  "name": "Matt Kirshen",
  "twitter": "mattkirshen",
  "website": "http://www.mattkirshen.com",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/matt-kirshen-b46a2083-11_3_1.jpg",
  "photoUrl": "/api/img/performer-images/performer-mattkirshen-300x300.jpg",
  "sortOrder": 77,
  "bio": "<p>London born Matt Kirshen&#039;s precision wit has earned him an impressive reputation on the international comedy circuit. Most recently his appearances on Late Night with Jimmy Fallon, The Late Late Show with Craig Ferguson, Paul Provenza’s Green Room, and as a finalist on NBC&#039;s Last Comic Standing has earned him a whole new host of fans in the United States and a surprising number of other countries worldwide. </p>\n<p>He has also recorded a half-hour special for the World Stands Up, Comedy Central, and has acclaimed festival appearances at Montreal, Edinburgh, Kilkenny, Glastonbury, Reading, Leeds, Bermuda, and Amsterdam. </p>\n<p>His debut CD, &quot;I Guess We&#039;ll Never Know&quot; was named in Punchline Magazine&#039;s top 10 albums of 2009 and his hit appearance at the 2008 Just For Laughs festival in Montreal resulted in no fewer than 4 of his gags appearing in the Montreal Gazette&#039;s round up of their best jokes of the fest. </p>\n<p>Matt has appeared in and written for numerous television shows and Radio series, including the critically acclaimed sketch show Bigipedia which ran for 2 seasons on the BBC.</p>\n<p>His youthful looks disguise a veteran comic with over a decade of experience, and a wealth of smart, funny and relatable material, making him a firm favorite with college audiences. While it&#039;s his prime-time NBC appearances that most American comedy fans will recognize him from, they are often surprised at the breadth and scope of his material, described by one reviewer as &quot;intelligent, but with the emphasis firmly on the funny&quot;</p>\n",
  "pageUrl": "12467-matt-kirshen"
}