{
  "id": 12536,
  "events": [],
  "emceeEvents": [],
  "name": "Ted Leo",
  "twitter": "tedleo",
  "website": "",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/leo.jpg",
  "photoUrl": "/api/img/performer-images/performer-tedleo-300x300.jpg",
  "sortOrder": 2,
  "bio": "<p>Since the early '90s, Ted Leo has been one of the most progressive forces in East Coast independent music, with a unique combination of punk and folk, soul and hardcore, and tradition and experimentation. Originally rising to a small degree of fame in the late-'80s New York hardcore scene by playing with Citizen's Arrest and Animal Crackers, Leo left New York for Washington, D.C., in 1990, when he founded and fronted Chisel, one of the first mod/punk revival outfits to gain national renown. Leo was the primary songwriter and singer of Chisel, recording two full-length records with the band which were released on Gern Blandsten in the mid-'90s and leading the band on countless short tours. The songwriting was as infectious and calculated as that of Brit rock legends the Kinks, yet the rhythms remained fueled by the anthemic energy reminiscent of bands like the Who and the Clash. </p>\n<p>Chisel's eventual breakup in 1997 came after their critically acclaimed sophomore full-length, Set You Free. The band's reputation seemed to flourish after their breakup, however, and even though the retro trends in indie rock would eventually gain enough popularity to inspire the likes of mod underground sweethearts like the Mooney Suzuki and the Delta 72, the influence of Chisel goes largely unnoticed. Leo went on to a variety of musical endeavors, including two years of on-again, off-again touring as a guitarist with the Spinanes, and a short-lived project called the Sin Eaters that he founded with his brother, Danny Leo, on drums and former Van Pelt bassist Sean Greene. The Sin Eaters' progressive, politically charged, punk-fused rock and local all-star lineup took the New York underground by storm between 1997 and 1998, until Danny Leo left the band to work on his own material and eventually founded the Holy Childhood. </p>\n<p>In the spring of 2000, Leo's sophomore effort, Treble in Trouble, was released on New Jersey-based Ace Fu Records, displaying a more aggressive and romantic bent to Leo's writing. In the early summer of 2001, Leo released a polished studio effort, The Tyranny of Distance, on Lookout Records. A strong contender for record of the year, it was followed by the equally strong Hearts of Oak in 2003. Shake the Sheets. which appeared in 2004, would prove to be his last for then-troubled Lookout, as Leo signed with Chicago-based indie Touch and Go in February 2006. A tour followed in March, on which he was supported by the Duke Spirit and Les Aus. He continued touring throughout 2006, festivals such as Coachella and headlining dates alike, as new material was worked on as well. Ted Leo &amp; the Pharmacists eventually returned in March 2007 with full-length number five, Living with the Living. In 2009 Leo signed with Matador, and the following year he released his first record with them, The Brutalist Bricks.</p>\n",
  "pageUrl": "12536-ted-leo"
}