{
  "id": 12555,
  "events": [
    12747,
    12774,
    12779,
    13034
  ],
  "emceeEvents": [],
  "name": "Jay Larson",
  "twitter": "JayLarsoncomedy",
  "website": "http://www.jaylarsoncomedy.com/",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/jaylarson.jpg",
  "photoUrl": "/api/img/performer-images/performer-jaylarson-300x300.jpg",
  "sortOrder": 39,
  "excludeFromList": false,
  "bio": "<p>Jay Larson is best known as a stand up comedian with multiple appearances on The Late Late Show, four appearances on Conan and his own half hour special on Comedy Central.  Jay's style is completely original and his ability to connect to an audience through storytelling is unmatched.  As a storyteller his \"Wrong Number\" story went viral after climbing to #1 on Reddit and was also featured on \"This American Life\" with Ira Glass claiming, \"Perfect Comedy, Perfect Storytelling…\"  Jay's Story telling has also been featured on Comedy Central's \"This is Not Happening\" and can be heard every Toozdee on his wildly successful podcast, The CrabFeast.  Jay's first album, \"Self Diagnosed\" was released in 2011 by AST records and his follow up album, \"Human Math\" is set to release in the fall.</p>\n<p>While stand up is his first love Jay wears many hats and recently co-hosted two seasons of \"Best Bars in America\" for the Esquire Network.  This Spring Jay made his Movie debut in the critically acclaimed Thriller, \"The Invitation\".  The Karyn Kusama film has launched Jay in a different light and led to a role in the highly anticipated second season of Twin Peaks, set to air on Showtime in 2017.  Between stand up, podcasting, hosting and acting Jay has also found time to write and create two television shows for NBC Universal.  Though neither show was made Jay is on the hunt for the next one!  But at the end of the day the job that Jay gets the most satisfaction out of is being a father to his two kids.</p>\n",
  "pageUrl": "12555-jay-larson"
}