{
  "id": 13049,
  "events": [
    12654,
    12752
  ],
  "emceeEvents": [
    15596
  ],
  "name": "Moshe Kasher",
  "twitter": "",
  "website": "",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/moshekasherheadshot.jpeg",
  "photoUrl": "/api/img/performer-images/performer-moshekasher-300x300.jpg",
  "sortOrder": 15,
  "excludeFromList": false,
  "bio": "<p>Moshe Kasher. Comedian. Child Genius. Jew. Jew Comedian. OBGYN. Pleasure center. Good tipper. Guiding light. Beefcake.</p>\n<p>He lives alone in LA with a woman and three white dogs.</p>\n<p>Featured on: Comedy Central's Drunk History and @midnight,  Brooklyn 99 on Fox,   FX’s “The League” \"Conan\",”Carson Daly”, Showtime's “Shameless”, MTV E!’s “Chelsea Lately”,\"Late Night With Jimmy Fallon\" and more.</p>\n<p> Currently the host of the popular podcasts, \"The Champs\"  and The Hound Tall Discussion Series. He is also   the author of the acclaimed memoir \"Kasher In The Rye\" on Grand Central Publishing.  </p>\n<p>In 2012 he released his first hour special on Netflix, “Moshe Kasher: Live In Oakland” It’s really good.</p>\n<p>He was a writer for The Comedy Central Roasts and is a producer/writer for the Comedy Central show, \"Another Period\" where he plays “Dr. Goldberg-America’s first Jewish doctor”</p>\n<p>Selected as one of Variety Magazine's \"Ten Comics to Watch\", LA Times, “Faces to Watch” Itunes “Comic of the year”  You can see him in the  upcoming seasons of Portlandia and Transparent as well as the Zoolander Sequel on which he was also the onset writer. Basically he’s funny and has done stuff.</p>\n<p>Things people have said:</p>\n<p> \"Everything you want in a comedian\" - East Bay Express;</p>\n<p>\"Displays a fiery frustration and agile, confident showcase of his neuroses\" - SF Examiner;</p>\n<p>\"Smart, dirty, sharp, self-deprecating and ultimately hilarious\" - Denver Post</p>\n<p>\"(With) a powerful comedic voice and amazingly wide range…(He is) one of the most important comics to watch out for\"- Punchline Magazine</p>\n<p>\"Hunk\" - East bay Express.</p>\n<p>People really seem to like him.<br />\nPlease, go to Netflix and watch his comedy special \"Moshe Kasher Live In Oakland\".  Please, read his book.  Please, think of the children</p>\n",
  "pageUrl": "13049-moshe-kasher"
}