{
  "id": 13057,
  "events": [],
  "emceeEvents": [],
  "name": "The Thermals",
  "twitter": "",
  "website": "",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/thethermals_hero.jpg",
  "photoUrl": "/api/img/performer-images/performer-thethermals-300x300.jpg",
  "sortOrder": 9,
  "excludeFromList": false,
  "bio": "<p>I don’t know how to write a bio for an album. I’ve never written one.</p>\n<p>I’m a comedian. My job is to talk onstage for long enough that the trapped, drunken audience has to buy more chicken wings from the club. I am not qualified to write about music. And yet here I am, writing a bio for the new Thermals record, We Disappear. Thank god it’s a great fucking record.</p>\n<p>The first time I heard The Thermals was on broken headphones while riding the A Train to Rockaway, Brooklyn, flying mere feet over a frozen Jamaica Bay on a too-bright January morning. I had just fallen in love with a wonderful, terrible woman who was thousands of miles away. I was very fragile, I had no boundaries, and I was the strongest I’d ever been. And that’s how this album feels. There’s a new vulnerability here, but The Thermals’ sound is as strong as it’s ever been.</p>\n<p>The Thermals are best at making songs you put on mixtapes named ‘Drunken Sing-alongs When You’re Sad.’ They specialize in late-night, secret conversations about feeling simultaneously romantic and resentful over being raised Catholic. They’re the soundtrack to breaking glass, and an ode to the beauty of brokenness.</p>\n<p>The deeply dark, yet oddly catchy “Heart Went Cold” plays on the double metaphor of loss of love/life and features the sad realization “I pushed you away”, but is immediately followed by the super poppy “oh-oh oh”. The classic fucking rock anthem “Hey You” is a paranoid fantasy about running from the Grim Reaper as he calls after you, about “being terrified of death,” says Harris, but “a celebration of that feeling as opposed to feeling sad about it.” A surprisingly uplifting eulogy of the death of a relationship, “Thinking Of You” is explained by Harris as “one of the most straight-forward love songs we’ve ever written, a point-blank post-break up song. It’s a song that says exactly what it means. It and a lot of the record are about regret, i.e. still loving someone after a break-up and hanging on to these feelings.”</p>\n<p>I’m sure you want to know that the record came out March 25th, 2016 on Saddle Creek, that it features the longest running Thermals line-up of Hutch Harris, Kathy Foster, and Westin Glass, and that it was recorded in Portland, OR at Kung Fu Bakery (The Shins, Tegan and Sara) and in Seattle, WA at The Hall of Justice (Nirvana, Mudhoney), and produced by Chris Walla (formerly of Death Cab For Cutie). But what really matters is that this record GETS IT. It walks that fine line between truth and lies, between death and life, between depression and joy – all the while recognizing that one cannot exist without the other. And it brings us with it. That’s the reason to listen to this record: Because it’s a fucking great album, by an amazing band. Long Live The Thermals.</p>\n<p>– Kurt Braunohler</p>\n",
  "pageUrl": "13057-the-thermals"
}