{
  "id": 15951,
  "events": [],
  "emceeEvents": [],
  "name": "Pat Brown",
  "twitter": "patbrownshow",
  "website": "http://www.comedianpatbrown.com",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/pat-brown-sidelean2.jpg",
  "photoUrl": "/api/img/performer-images/performer-patbrown-300x300.jpg",
  "sortOrder": 50,
  "excludeFromList": false,
  "bio": "<p>Pat Brown is well regarded comedy writer and seasoned performer. Her style can be summed up as smart playfulness wrapped in social commentary. She finds humor in the small--the routine of her daily life and the big--the complexities of human behavior and joking about both with clever insightfulness.</p>\n<p>Proudly and forever a ‘tomgirl’ Pat grew up in Kansas City, MO an oasis for an active kid that loved sports, outdoors and good barbeque. Pat grew up surrounded by funny, her father and brother were an endless source of entertainment. Pat became aware of her talent for comedy during many afterschool  ‘hanging out’ sessions in the company of her small diverse band of friends.  Her gift became more widely recognized in high school and she was voted “Most Humorous” in her senior year.</p>\n<p>After receiving a basketball scholarship to S.C.S.U. Pat headed south. After graduating with a degree in Theatre, she then moved to Atlanta, GA where she bounced around in several fields till she found stand up comedy. She debuted as a stand up at the Comedy Act Theatre. She has been performing stand up ever since.</p>\n<p> MOVIES<br />\n2015 WHITE WATER as Sophie, TVOne’s Original Movie<br />\nBLOOD TIES, starring Zoe Saldana<br />\nTHREE CAN PLAY THAT GAME starring Vivica Fox<br />\nSOMEBODIES as Aunt Agnes</p>\n<p>AWARDS<br />\n2013 Winner of “She Devil Comedy Competition”<br />\n2007 Winner “Best Female Comic” at Las Vegas Comedy Competition</p>\n<p>TV APPEARANCES<br />\nFuse TV Uproarious<br />\nGotham Axis Live<br />\nLaughs on Fox<br />\nBET Comic View<br />\nBounce TV’s Off The Chain<br />\nNBC Comic’s Unleashed<br />\nComedy Central’s Laffapalooza</p>\n<p>IMPROV ACTOR<br />\nUCB, Blacktop Circus and Laughing Matters</p>\n",
  "pageUrl": "15951-pat-brown"
}