{
  "id": 15951,
  "events": [
    17151,
    17158
  ],
  "emceeEvents": [],
  "name": "Pat Brown",
  "twitter": "patbrownshow",
  "website": "http://www.comedianpatbrown.com",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/pat-brown-sidelean2.jpg",
  "photoUrl": "/api/img/performer-images/performer-patbrown-300x300.jpg",
  "sortOrder": 83,
  "excludeFromList": false,
  "bio": "<p>Pat Brown is a well regarded comedy writer and seasoned performer. Her style can be summed up as smart playfulness wrapped in social commentary. She finds humor in the small--the routine of her daily life and the big--the complexities of human behavior and she makes jokes about both with clever insightfulness.</p>\n<p>Proudly and forever a ‘tomgirl,’ Pat grew up in Kansas City, MO, an oasis for an active kid that loved sports, outdoors and good barbeque. Pat grew up surrounded by funny, her father and brother were an endless source of entertainment. Pat became aware of her talent for comedy during many after school ‘hanging out’ sessions in the company of her small, diverse band of friends.  Her gift became more widely recognized in high school and she was voted “Most Humorous” in her senior year.</p>\n<p>Pat attended S.C.S.U. on a basketball scholarship, where she graduated with a degree in Theatre.  She then moved to Atlanta, GA, where she bounced around in several fields until she found stand up comedy. She debuted as a stand up at the Comedy Act Theatre. She also performs improv with UCB, Blacktop Circus and Laughing Matters.</p>\n<p>Pat&#039;s film appearances include: 2015 White Water as Sophie, TVOne’s Original Movie, Blood Ties, starring Zoe Saldana, Three Can Play That Game, starring Vivica A. Fox, and Somebodies as Aunt Agnes.</p>\n<p>Her TV appearances include: Fuse TV Uproarious, Gotham Axis Live, Laughs on Fox, BET Comic View, Bounce TV’s Off The Chain, NBC Comic’s Unleashed, Comedy Central’s Laffapalooza</p>\n<p>AWARDS<br />\n2013 Winner “She Devil Comedy Competition”<br />\n2007 Winner “Best Female Comic” at Las Vegas Comedy Competition</p>\n",
  "pageUrl": "15951-pat-brown"
}