{
  "id": 15993,
  "events": [],
  "emceeEvents": [],
  "name": "Josie Long",
  "twitter": "JosieLong",
  "website": "http://www.josielong.com/",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/josie_long_headshot.jpg",
  "photoUrl": "/api/img/performer-images/performer-josielong-300x300.jpg",
  "sortOrder": 90,
  "excludeFromList": false,
  "bio": "<p>Often described as a unique voice in comedy, Josie Long is one of the most respected comedians of her generation. Having started stand-up at age 14, she went on to win the BBC New Comedy Award and came in second in <em>So You Think You’re Funny</em> at age 17.</p>\n<p>Josie went on to support Stewart Lee on his national tour, winning Chortle UK’s Best Newcomer (2005) and Breakthrough Act (2007) awards. In 2006, her show “Kindness and Exuberance” won the Perrier Best Newcomer at the Edinburgh Fringe, and since then Josie has racked up three consecutive nominations for the Fosters Edinburgh Comedy Award and performed in Montreal, Melbourne (where she won the 2007 Barry Award), Adelaide and New Zealand. In 2015 she performed her show “Cara Josephine” in New York and Los Angleles after sold-out shows in Edinburgh and London.</p>\n<p>On television, Josie has appeared on the UK programs <em>The News Quiz, Just A Minute, Never Mind the Buzzcocks, The Alternative Comedy Experience, Have I Got News For You and 8 out of 10 Cats</em>, and <em>Drunk History</em>, as well as <em>Australia’s Thank God You’re Here.</em> She also investigated the rise of online comedy for The Culture Show on BBC2. She has written and starred in two short films, <em>Let’s Go Swimming</em> and <em>Romance and Adventure</em> and is currently developing her first feature-length project.</p>\n<p>Josie has also written for BBC Radio, including two contributions to <em>The Afternoon Play</em> and her own series based on her show <em>Romance and Adventure</em>. She has been a regular guest on a <em>The Back End Of Next Week</em>, and was the co-host of BBC 6 <em>Music Saturday mornings</em> with Andrew Collins in 2011. Josie became popular with young radio listeners through a weekly feature on the Radio 1 series <em>Switch</em>, where she announced words that children had to immediately put into their homework. Josie currently presents <em>Short Cuts</em> for BBC Radio 4, which has reached #2 in the iTunes podcast download chart.</p>\n<p>Josie is also a regular contributor to the Guardian Guide, as a columnist and cartoonist, and she wrote for, and appeared in, the first two series of <em>Skins</em> as well as directed their online content. She is currently developing her charity <em>Arts Emergency</em>, which works to make arts &amp; humanities degrees accessible to all who want to study them.</p>\n",
  "pageUrl": "15993-josie-long"
}