{
  "id": 16051,
  "events": [],
  "emceeEvents": [],
  "name": "Guy Branum",
  "twitter": "guybranum",
  "website": "http://www.guybranum.com/",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/guybranum2.jpg",
  "photoUrl": "/api/img/performer-images/performer-guybranum-300x300.jpg",
  "sortOrder": 8,
  "excludeFromList": false,
  "bio": "<p>Guy Branum is a writer and comedian best known for his recurring segment \"No More Mr. Nice Gay\" on <em>Totally Biased with W. Kamau Bell</em>, serving as \"Staff Homosexual\" on <em>Chelsea Lately</em> and his performance as Natalie Portman's sassy gay friend in <em>No Strings Attached</em>. Noticing a trend? He's a recurring panelist on Comedy Central's <em>@Midnight</em> and <em>The Nightly Show with Larry Wilmore</em>. He is also the host and the creator of the beloved <em>Talk Show The Game Show</em> where celebrity guests face off to prove who's the best talk show guest by plugging, name-dropping, and anecdoteing their way to victory. The show takes place monthly at the Nerdmelt Showroom in LA and was just ordered to series for TruTV. Other TV credits include the upcoming <em>Road to Roast</em>, also on Comedy Central, SeeSo's <em>Comedy Show Show</em> and <em>Debate Wars</em>, or maybe you have seen Guy on E!, MTV, G4, CurrentTV and lots of other channels you'd need to upgrade your cable to watch. Guy's writing credits include <em>The Mindy Project</em> on Hulu, <em>Punk'd</em> and <em>Awkward</em> on MTV, <em>Billy on the Street</em> on truTV and <em>Fashion Police</em> on E!. That means he's watched the Grammys at Joan Rivers's house. Jealous? </p>\n<p>As a standup comic Guy has appeared at San Francisco Sketchfest, Moontower Comedy Festival in Austin, TX, Riot LA and Bridgetown Comedy Festival in Portland, OR. In 2015 Guy released his debut album <em>Effable</em> on AST Records. He also writes self-important essays for various blogs, had an editorial column in The New York Times and occasionally makes web videos where he dances around without his shirt on. But mostly, Guy is very, very beautiful and good at having sex.</p>\n",
  "pageUrl": "16051-guy-branum"
}