{
  "id": 16177,
  "events": [],
  "emceeEvents": [],
  "name": "Andy Erikson",
  "twitter": "andyerikson",
  "website": "http://www.andyerikson.com",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/160210_erikson-043-940x1410.jpg",
  "photoUrl": "/api/img/performer-images/performer-andyerikson-300x300.jpg",
  "sortOrder": 81,
  "excludeFromList": false,
  "bio": "<p>Andy Erikson’s love of squirrels and unicorns is only surpassed by her love of performing standup comedy. She intertwines silly one liners with whimsical stories in a playful, but thought provoking way. She was once a semi-finalist for the Andy Kaufman award, has won several comedy competitions, and has performed at many prestigious festivals. In 2015 she made her television debut on NBC’s Last Comic Standing, placing in the top 5. She was also featured on The Guest List: Live From The Barrel House on Seeso. In 2016 she was a guest star on Scream Queens on Fox and played Chanel #7. Her favorite thing about comedy is making friends.</p>\n<p>Guest Star on Scream Queens on Fox. (4 episodes, Season 2, 2016)<br />\n3rd place on season 9 of NBC’s Last Comic Standing // 2015<br />\nThe Guest List: Live From the Barrel House // Seeso 2015<br />\n2014 Bridgetown Comedy Fest<br />\nFinalist at the 2013 Great American Comedy Festival<br />\nSelected by Star Tribune as the Best of MN Comedian Tweeter of 2012.<br />\nSemi-Finalist in the 2011 Laughing Skull Comedy Festival<br />\nWinner of the House of Comedy’s 2010 Funniest Person Contest<br />\nSemi-Finalist at the 2009 Boston Comedy Festival<br />\nMember of the 1st place team at Rooftop Comedy’s 2009 National College Comedy Contest in Aspen<br />\nVoted MVP of the National College Comedy Competition at the 2009 Aspen Comedy Festival<br />\n2009 Semi-finalist for the Andy Kaufman Award<br />\nDuluth’s Funniest Person in 2009<br />\n2nd place in the Twin Cities Funniest Person Contest 2008</p>\n",
  "pageUrl": "16177-andy-erikson"
}