{
  "id": 16346,
  "events": [
    17148,
    17172,
    17184
  ],
  "emceeEvents": [],
  "name": "Drew Lynch",
  "twitter": "",
  "website": "",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/drewlynch002.jpg",
  "photoUrl": "/api/img/performer-images/performer-drewlynch-300x300.jpg",
  "sortOrder": 35,
  "excludeFromList": false,
  "bio": "<p>In 2015, Drew Lynch captured the hearts of America with his Golden Buzzer performance on Season 10 of America’s Got Talent. “The person I was before would probably never hangout with who I am today” is the statement that resonated most in capturing audiences across the country, as they fell in love with Drew’s charming wit and genuine vulnerability every week of the competition. “Do something every day that scares you” is a motto Drew lives by.</p>\n<p>Drew becoming a comedian was almost as unintentional as capturing America’s hearts.  Originally from Indianapolis, at the age of 19, Drew moved to Los Angeles with aspirations of becoming an actor; a dream he had since he was a kid. An unexpected softball accident just a year into his acting career left Drew with a severe stutter and crushed his hopes of ever performing again.</p>\n<p>But his continued drive to become an entertainer forced him in a different direction, often reflecting on the “softball that humbly changed his life and gave him a career”. Drew’s vulnerabilty in dealing with his stutter and making it relatable to real-life situations propelled him each week of the competition – advancing him to the finals and ultimately landing him first runner-up on season 10 of America’s Got Talent.  Drew attributes much of his success from his ability to be honest, genuinely facing the “elephant in the room” head on.  Inspired by comedians Bo Burnham, Louis C.K, he now headlines Comedy Clubs across the country.</p>\n<p>Since his success on America’s Got Talent, Drew’s career has come full circle and he has broken back into the acting scene. Drew recently garnered a recurring role on the Marc Maron Show, has appeared on “Dr. Oz,” and as a celebrity guest on the game show “Idiot Test.” He is collaborating on a book, and ultimately becoming the actor he always dreamed of, with a now different and enlightened perspective on who he thought he was, and who he is today.</p>\n<p> </p>\n",
  "pageUrl": "16346-drew-lynch"
}