{
  "id": 16360,
  "events": [],
  "emceeEvents": [],
  "name": "Kristin Key",
  "twitter": "thekristinkey",
  "website": "http://www.kristinkey.com/",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/kristin_key_headshot.png",
  "photoUrl": "/api/img/performer-images/performer-kristinkey-300x300.jpg",
  "sortOrder": 124,
  "excludeFromList": false,
  "bio": "<p>Kristin Key grew up a minister’s daughter in a small town in West Texas. Much like Footloose, she was raised in a no-drinking, no-dancing, no instrumental music environment, so she immediately took up drinking, dancing and playing an instrument. Proving that the almighty has a strange sense of humor, Kristin came out of the closet at 15. Needless to say, it did not go well. So, Kristin decided to “take it back”, retreat back into the closet, and try a little harder to be straight.</p>\n<p>At 19, while in college to become a paramedic, Key signed up for Open Mic Night at the local comedy club. As soon as she took the stage she felt at home. Though her observations and wit made her a local favorite, she remained in the closet, fearful of losing her local fan base. Small shows in the Texas panhandle turned into 35 states worth of comedy over the next 5 years. Audiences couldn't help but love the original comedy songs and rapid-fire style of comedy coming from the \"Preacher's Kid\", and though female comics struggled to find work she was booked not for being a woman, but for simply being funny.</p>\n<p>When Last Comic Standing held their auditions in Austin, Texas, she stood in line hoping for a chance to be seen. After 7 hours of waiting, she got her chance and her ticket to Hollywood to compete with the best in the comedy world. At the end of the season she stood among the final six and watched as her fan base exploded. With validation from millions of comedy fans, Key moved to L.A. and began preparing a new act to take on the road.</p>\n<p>While participating in an anti-bullying fundraiser, Kristin finally broke her silence and decided to share her hilarious story of coming out, taking it back, living in the closet, and meeting her wife. After 15 years in comedy, Kristin has found a way to perfectly blend together her thought provoking hilarious true stories and original songs with outrageous off-the-cuff improv moments, ensuring that no two shows are the same.</p>\n<p>She is most recognized for her appearance on Last Comic Standing, additional credits include: Comics Unleashed, VH- 1’s 100 Greatest Series, The Bob and Tom show and Sirius and XM Satellite Radio. She has released several comedy and music albums, including a new Christmas album, “It’s Beginning to Look a Lot Like Kristin” (now available on Amazon, Google, and iTunes). Much has changed from the dusty west Texas town of Amarillo to the bright lights of L.A. but the one thing that hasn't changed is that fast-paced quick witted comedy that has kept audiences rolling in the aisles from the beginning.</p>\n",
  "pageUrl": "16360-kristin-key"
}