{
  "id": 16572,
  "events": [],
  "emceeEvents": [],
  "name": "Dan Harmon",
  "twitter": "danharmon",
  "website": "",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/harmonapprovedphoto_04062016103330_large.jpg",
  "photoUrl": "/api/img/performer-images/performer-danharmon-300x300.jpg",
  "sortOrder": 31,
  "excludeFromList": false,
  "bio": "<p>Dan Harmon is the Emmy® winning creator/executive producer of the comedy series <em><strong>Community </strong></em>as well as the co-creator/executive producer of Adult Swim’s<em><strong> Rick &amp; Morty</strong></em>.<br />\nHarmon co-founded Channel 101, an untelevised non-profit audience-controlled network for undiscovered filmmakers, many of whom used it to launch mainstream careers, including the boys behind SNL’s Digital Shorts. Harmon, also partnered with Sarah Silverman to create her Comedy Central series, <em><strong>The Sarah Silverman Program</strong></em>, where he served as head writer for the first season.<br />\nHarmon went on to create, write and perform in the short-lived VH1 sketch series <em><strong>Acceptable TV</strong></em> before eventually creating the critically acclaimed and fan favorite comedy <em><strong>Community</strong></em>. The show originally aired on NBC for five seasons before being acquired by Yahoo which premiered season six of the show in March of 2015. In 2009 he won an Emmy for Outstanding Music and Lyrics for the opening number of the 81st Annual Academy Awards.</p>\n<p>In 2014 Harmon was the star of the documentary <em><strong>Harmontown </strong></em>which chronicled his 20-city stand-up / podcast tour of the same name. The film premiered at the SXSW Film Festival and was released theatrically in October of 2014.</p>\n<p>Through his production company Starburns, Harmon served as executive producer for the critically acclaimed animated feature film “Anomalisa”. After winning the Grand Jury Prize at the 2015 Venice Film Festival, the film was distributed by Paramount Pictures. “Anomalisa” has garnered numerous nominations and awards including an Oscar nomination for Animated Feature Film. Harmon most recently can be found hosting and executive producing <strong><em>History’s Great Minds</em></strong>. Harmon has an extensive upcoming slate including Seeso’s “HarmonQuest,” a fantasy comedy adventure series that melds live action comedians, a live studio audience, and animated sequences.</p>\n",
  "pageUrl": "16572-dan-harmon"
}