{
  "id": 16647,
  "events": [
    17159,
    17167,
    17189,
    17197,
    17259
  ],
  "emceeEvents": [],
  "name": "Marcella Arguello",
  "twitter": "MarcellaComedy",
  "website": "http://MarcellaComedy.com",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/img_0241.jpg",
  "photoUrl": "/api/img/performer-images/performer-marcellaarguello-300x300.jpg",
  "sortOrder": 12,
  "excludeFromList": false,
  "bio": "<p>Too lazy to shoot hoops and too tall to model, Marcella Arguello stands over 6 feet. Although she may be taller than most men, the only thing more intimidating than her height is her comedy. Marcella mixes a combination of genuine reason with a sexy suggestion of street. Deemed as “sexually and ethnically ambiguous” she appeals to everyone and is not afraid to tell you how she really feels about subjects concerning race, gender, politic, relationships, family, work, music, pop culture and whatever else is on her mind that day.</p>\n<p>Time Out Magazine deemed Marcella an “LA Comedian to Watch in 2017” and is a fan favorite on Comedy Central’s @midnight. Most recently, she won her appearance on TruTv’s Comedy Knock Out and can be seen on The UCB Show’s upcoming second season on Seeso. She was featured on Viceland’s Flophouse, and in 2015 on NBC’s Last Call with Carson Daly; her stand up has been highlighted on rapper Tyler, The Creator’s mobile app and on Fox’s The Real. Her Twitter account (@marcellacomedy) has been featured on CNN, TIME.com, HuffingtonPost.com and various entertainment websites. She is a regular opener for Last Comic Standing Winner Felipe Esparza as well as NBC Superstore’s Nico Santos. She has opened for David Alan Grier, Norm MacDonald, J.B. Smoove, Hannibal Buress, Ron Funches, Godfrey, Bryan Callen, Aries Spears, Hasan Minhaj, Al Madrigal, Joey Coco Diaz, Melanie Comarcho, Melissa Villaseñor and has shared a stage with Bill Burr, Paul Mooney and Robin Williams.</p>\n<p>She has worked at The Improv Comedy Clubs all over the country and is a regular at The Punch Line Comedy Clubs in Northern California. She has performed at San Francisco Sketchfest, Riot LA Comedy Festival, overseas for American troops and comedian Sean Keane referred to her as the “finest export from Modesto since George Lucas.”</p>\n",
  "pageUrl": "16647-marcella-arguello"
}