{
  "id": 16657,
  "events": [
    17165,
    17204
  ],
  "emceeEvents": [],
  "name": "Brooke Van Poppelen",
  "twitter": "BVPcomedy",
  "website": "http://www.brookevanpoppelen.com/",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/bvp_headshot_blonde.jpg",
  "photoUrl": "/api/img/performer-images/performer-brookevanpoppelen-300x300.jpg",
  "sortOrder": 28,
  "excludeFromList": false,
  "bio": "<p>Brooke Van Poppelen is a NYC based comic, actress, writer, and host of Hack My Life on truTV. Brooke has appeared on The Nightly Show with Larry Wilmore, @Midnight and John Oliver’s New York Stand Up Show on Comedy Central, The Late Late Show with Craig Ferguson on CBS, IFC’s Comedy Drop, and Night Train hosted by Wyatt Cenac for NBC’s Seeso. She has appeared as a guest on ABC’s The View and Dr. Oz ,and also as a talking head &amp; panelist on multiple MTV, truTV &amp; vh1 shows. Brooke worked as a writer &amp; producer for several seasons of Girl Code and Guy Code and many other MTV shows. Her first comedy album, Hard Feelings was released by Sure Think ATX in October and hit #1 on iTunes.</p>\n<p>Brooke can be seen in the web series  Seeing Other People, which she co-wrote and co-stars in with Giulia Rozzi. The six episode web series has been gathering attention from the likes of  IFC.com, Glamour and Laugh Spin.</p>\n<p>Brooke’s stand up comedy has been praised by Splitsider, Esquire and Brightest Young Things. She was recently selected for the Headliners Showcase as part of the Melbourne International Comedy Festival and has also performed at The Bentzen Ball, Riot Fest LA, SXSW, The Eugene Mirman Comedy Festival and Bridgetown and returned to SXSW in 2016 as the host of the Interactive Awards Ceremony. </p>\n<p>In NYC &amp; LA she performs at UCB on shows like Whiplash or Fresh Out! In Brooklyn she can be seen at Union Hall — a lot — especially on her show Comfort Zone which she hosts with singer songwriter Julian Velard.</p>\n<p>Prior to NYC she performed and trained in Chicago at IO, The Second City, and The Playground Theater. Brooke hails from the Detroit suburbs and loves coney dogs.</p>\n",
  "pageUrl": "16657-brooke-van-poppelen"
}