{
  "id": 16790,
  "events": [],
  "emceeEvents": [],
  "name": "Arish Singh",
  "twitter": "arishish",
  "website": "http://www.arishcomedy.com",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/arish_singh_head1.jpg",
  "photoUrl": "/api/img/performer-images/performer-arishsingh-300x300.jpg",
  "sortOrder": 101,
  "excludeFromList": false,
  "bio": "<p>The comedy of Arish Singh, with its unique fusion of absurdist humor and political commentary, has been praised by many, and described by others as, “Yeah, just not my thing.” Singh has opened for national acts like Tim Heidecker (Tim &amp; Eric), Hasan Minhaj (The Daily Show) and Kamau W. Bell (Totally Biased), and has performed on stand-up showcases like Hot Tub with Kurt Braunohler &amp; Kristen Schaal, Andy Kindler’s Particular Show and Chicago’s Comedians You Should Know. In 2016, Singh was featured in the Chicago Comedy Exposition, the Milwaukee Comedy Festival, Green Gravel Comedy Festival and Minneapolis&#039;s 10,000 Laughs. In 2017, he was featured in the Indie Orlando Comedy Festival, the Memphis Comedy Festival, and the Crom Comedy Festival.</p>\n<p>Singh appeared in the Triumph the Insult Comic Dog 2016 Election Special, but as a political protester, not a comedian. In January 2016, Singh made national news for protesting at a Donald Trump rally where he and fellow comedian and activist Taylor Williams were ejected for unfurling a banner reading &quot;stop hate.&quot; Singh followed up by putting on fundraiser stand-up shows for CAIR and the Sikh Coalition, two groups committed to fighting hate crimes. He used the shows to discuss how the right&#039;s political use of Islamophobia has affected life for Sikhs and Muslims and other minority groups in the United States.</p>\n<p>Singh co-produces SolidHilarity, a comedy show that fundraises for activist groups and labor unions, and he is a proud contributor to the pungently political and humorous podcasts of the “dirtbag left,” such as Street Fight Radio and the Katie Halper show, a program where he discussed the outcome of the election with comedian Judah Friedlander. Singh believes, more than ever, another world is possible: Chardi Kala.</p>\n",
  "pageUrl": "16790-arish-singh"
}