{
  "id": 16903,
  "events": [
    17156,
    17203,
    17280
  ],
  "emceeEvents": [],
  "name": "Matt Knudsen ",
  "twitter": "mattknudsen",
  "website": "http://mattknudsen.com/",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/0412_0.jpg",
  "photoUrl": "/api/img/performer-images/performer-mattknudsen-300x300.jpg",
  "sortOrder": 41,
  "excludeFromList": false,
  "bio": "<p>Matt Knudsen (Kah-nood-son) was born in Hawaii, raised in the Mid-west and sailed around the world as a merchant marine. After trips to Europe, Africa and The Far East, he eventually put down his sea bag, picked up a microphone and began performing stand up comedy all across the country. </p>\n<p>As an actor, you may have seen Matt share the big screen with Oscar winner Sean Penn, in the Warner Brothers feature Gangster Squad or you may also recognize him from his appearances in shows like Crazy Ex-Girlfriend, Key &amp; Peele, Workaholics, The League, Big Love, Boston Legal or Malcolm in the Middle just to name a few. Matt has also been a part of several high profile commercial campaigns for companies including: Apple, IBM, GE, Volkswagen, DirecTV, Pepsi and more; which have aired during the Superbowl and The Olympics.  </p>\n<p>As a comedian, he’s appeared on Conan, The Late Late Show, Last Call, ASX Live and Comics Unleashed, as well as dozens of festivals, including: Montreal Just for Laughs (Best of the Fest), The San Francisco Sketchfest, Bridgetown, High Plains, Limestone; and has even been part of an evening of entertainment at The White House for President and Mrs. Obama. </p>\n<p>His critically acclaimed albums The Comedy Stylings of Matt Knudsen and American are top downloads on iTunes, heard regularly on SiriusXM radio and “Mix droll observation with a dry, almost hypnotic delivery,” (The Onion A.V. Club); and with Knudsen’s unique style, “The personal feels universal, and the universal feels personal. The only explanation for this phenomenon is that it&#039;s all finely crafted comedy from a strong central voice…a great stand up album.” (The Huffington Post)</p>\n",
  "pageUrl": "16903-matt-knudsen-"
}