{
  "id": 16912,
  "events": [],
  "emceeEvents": [],
  "name": "Barbara Gray",
  "twitter": "BabsGray",
  "website": "http://myjokesareuphere.com",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/heartsheadshot-lo_0.jpg",
  "photoUrl": "/api/img/performer-images/performer-barbaragray-300x300.jpg",
  "sortOrder": 48,
  "excludeFromList": false,
  "bio": "<p>Big hair. Big heart. Big mouth. Barbara’s ebullient and goofy stage presence combined with vulnerable dark material have made her a quickly rising star in the Los Angeles alternative comedy scene. In 2016 she filmed sets for Viceland’s “Flophouse” and Hulu’s “Coming to the Stage” and she has written for the past three seasons of the hit show “Billy on the Street”. She recently co-starred in Comedy Central’s new series “Hampton DeVille” as well as their digital series “Would You Rather”, “Deadliest Chef”, and Nick Swardson’s show “Typical Rick”. </p>\n<p>Along with touring all over the country, Babs has made multiple visits to SF Sketchfest and the Bridgetown Comedy Festival, where her performance was deemed ‘funny as get-out’ by the Portland Mercury. Her comedy has been featured on Huffington Post and Ellen, and her underground comedy show One-Two Punch, run out of her own living room in Silverlake, had a spread in the LA Times. She is also a regular at the top shows and venues in Los Angeles, including the Improv, Comedy Store, Meltdown, Good Heroin, and literally any place somebody will put a microphone and give her some attention. </p>\n<p>Barbara is also a co-host of the hit podcast “Lady to Lady”, which recently surpassed 2 million downloads from listeners all over the world. The live talk show can be seen at the Upright Citizen’s Brigade Theater and the Hollywood Improv. The show combines the roundtable discussions of The View with the antics and characters of Pee-Wee’s Playhouse. Described as “The funniest podcast ever” by BUST magazine, the ladies talk pop culture, politics, and embarrassing personal revelations. Find it on the Maximum Fun network or wherever you listen to podcasts. </p>\n<p>Follow Barbara on twitter at @BabsGray and check out her website <a href=\"http://www.myjokesareuphere.com\">www.myjokesareuphere.com</a>.</p>\n",
  "pageUrl": "16912-barbara-gray"
}