{
  "id": 16917,
  "events": [],
  "emceeEvents": [],
  "name": "Dave Hill",
  "twitter": "mrdavehill",
  "website": "http://davehillonline.com",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/dave-hill1.jpg",
  "photoUrl": "/api/img/performer-images/performer-davehill-300x300.jpg",
  "sortOrder": 101,
  "excludeFromList": false,
  "bio": "<p>Dave Hill is a comedian, writer, musician, actor, radio host, and man-about-town originally from Cleveland, Ohio but now living in New York City in a totally sweet apartment with a party deck and everything. Hot chicks come over to hang out and eat cheese plates and stuff with him all the time and it’s awesome.</p>\n<p>Anyway, on the show business front, Dave has appeared on Comedy Central’s <em>@midnight</em> and<em> Inside Amy Schumer</em> programs, TBS' <em>Full Frontal with Samantha Bee, </em>and TruTV's <em>Comedy Knockout</em> others. He is a frequent on-air host for HBO and Cinemax and has been on channels like MTV, VH1, BBC-America, and the Sundance Channel a whole bunch too. Dave also starred in his own television program <em>The King of Miami</em> on the Mojo Network, which was cancelled even though Dave really liked it. The show also aired in the United Kingdom on Sky TV’s Film24 Channel. And you can still watch <a href=\"http://www.hulu.com/search?q=King+of+Miami\"><em>The King of Miami</em> on Hulu</a> too, which Dave is super pumped about. Oh, and Dave was a correspondent on <em>Hoppus on Music</em> starring Blink 182’s Mark Hoppus on the Fuse channel, which ruled. Dave has been on other shows and in obscure movies too but let’s keep moving for now.</p>\n<p>Dave performs live comedy over the world and has appeared at such festivals as the Melbourne International Comedy Festival, San Francisco Sketchfest, the Edinburgh Fringe Festival, the U.S. Comedy Arts Festival in Aspen, Sasquatch Festival, Bumbershoot, Bonnaroo, the Bridgetown Comedy Festival in Portland, the Crap Comedy Festival in Oslo, Outside Lands in San Francisco, and then some other ones too. He has also performed comedy at Sing Sing Correctional Facility twice and even ripped some guitar solos inside a Mexican prison once. In 2007, <em>Variety</em> magazine named Dave one of their “10 Comedians to Watch,” something he still won’t shut up about..</p>\n<p>Dave is also a musician who currently sings and plays guitar in the power pop band Valley Lodge, whose song “Go” is the theme song to HBO’s <em>Last Week Tonight with John Oliver</em>. He was also a member of Cleveland rock bands Sons of Elvis and Cobra Verde as well as Diamondsnake, a heavy metal band with Moby. Additionally, Dave has played guitar for Walter Schreifels and muscle metal band Thor and bass for Lucy Wainwright Roche and former Faith No More singer Chuck Mosley. He also contributed musical stores to films such as <em>Dirty Deeds</em>, <em>Shoot First and Pray You Live</em>, and then some other ones besides those two.</p>\n<p>Dave has made out with a lot of chicks, is sweet at guitar, and smells really great. You can ask anyone.</p>\n",
  "pageUrl": "16917-dave-hill"
}