{
  "id": 16918,
  "events": [
    17231,
    17250
  ],
  "emceeEvents": [],
  "name": "Matt Braunger",
  "twitter": "Braunger",
  "website": "http://www.mattbraunger.com",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/1046_matt_braunger_07.23.15_07-1438.jpg",
  "photoUrl": "/api/img/performer-images/performer-mattbraunger-300x300.jpg",
  "sortOrder": 7,
  "excludeFromList": false,
  "bio": "<p>Matt Braunger was raised in Portland, Oregon. A headlining comedian since 2007 and an actor since childhood, Matt studied theatre in New York and improvisation in Chicago.</p>\n<p>Matt’s television credits include a recurring role on ABC’s \"Agent Carter,\" NBC’s \"Up All Night,\" a series regular role on \"MADtv,\" as well as appearances on \"BoJack Horseman,\" \"Garfunkel and Oates,\" \"Maron,\" HBO’s \"Family Tree,\" \"The Michael J Fox Show,\" \"Happy Endings,\" \"CONAN,\" \"The Tonight Show with Conan O’Brien,\" \"The Late Show with David Letterman,\" \"The Pete Holmes Show,\" \"United States of Tara,\" \"Pushing Daisies,\" \"Carpoolers,\" \"The Late Late Show with Craig Ferguson, \" \"Acceptable TV,\" and \"Live At Gotham.\" He was also a regular guest on the \"Chelsea Lately\" roundtable and \"@midnight.\" Most recently Matt joined the cast of the popular TruTV series \"How to Be a Grown Up,\" and appeared in Showtime’s \"SXSW Comedy with W. Kamau Bell\" and Comedy Central’s \"The Meltdown.\"</p>\n<p>He won the 2008 “Best Of The Fest” at the inaugural Rooftop Comedy Festival in Aspen. In 2009, he was named to Variety’s Top 10 \"Comics to Watch,\" and Comedy Central’s \"Hot 9 in ’09\" list, his debut album \"Soak Up The Night\" was released by Comedy Central Records and he was named to the iTunes REWIND \"Top 20 Albums of 2009.\" In 2010, he recorded his half hour Comedy Central Presents special and in 2012 released his debut hour-long special entitled \"Shovel Fighter,\" also released as an album. Matt’s latest hour-long comedy special, \"Big, Dumb Animal\" is now available on Netflix.</p>\n<p>Along with touring comedy clubs across the country, Matt is also a regular at the Upright Citizens Brigade in Los Angeles, and he headlined the Old Milwaukee Comedy Tour for Funny Or Die in 2013. Matt has also performed at a variety of prestigious comedy festivals including the Just For Laughs Festival in Montreal and Chicago, The TBS Comedy Festival Las Vegas, and South By Southwest. Matt also co-founded the popular Bridgetown Comedy Festival that takes place annually in Portland.</p>\n",
  "pageUrl": "16918-matt-braunger"
}