{
  "id": 16925,
  "events": [
    17148,
    17182,
    17184,
    17191,
    17192,
    17260
  ],
  "emceeEvents": [],
  "name": "Janeane Garofalo",
  "twitter": "",
  "website": "",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/janeane_garofalo_headshot.jpg",
  "photoUrl": "/api/img/performer-images/performer-janeanegarofalo-300x300.jpg",
  "sortOrder": 1,
  "excludeFromList": false,
  "bio": "<p>Janeane has had many memorable and critically acclaimed roles in film and television since bursting on the scene in 1992. She's appeared in films such as \"The Truth About Cats and Dogs,\" \"Wet Hot American Summer,\" \"Ratatouille\" and \"Reality Bites.\" She was a cast member of the Emmy award winning \"Ben Stiller Show,\" as well as the comedy classic \"The Larry Sanders Show,\" and had recurring roles on \"24\" and \"The West Wing.\" She appeared in Bravo's first scripted series \"Girlfriend's Guide to Divorce\" and can be seen in the Netflix series \"Wet Hot American Summer: First Day of Camp.\" Along with \"Little Boxes,\" Janeane will appear in several feature films in 2016, including \"Blue Angel\" and \"Speech and Debate.\"</p>\n<p>In addition to acting in film and television, Janeane is an outspoken activist and tours the country as a stand-up comedian. She was instrumental in the successful launching of the first liberal radio network, <a href=\"http://airamerica.com/\" target=\"_blank\">Air America Radio</a>, where she hosted her own talk show, \"<a href=\"http://airamerica.com/majorityreport/\" target=\"_blank\">The Majority Report</a>.\" A lightning rod for controversy, Janeane's well-informed opinions and unflinching honesty have inspired laughs as well as striking a chord with the left, right and everyone in between. She is a noted peace activist.</p>\n<p>Notable Roles: Janeane played the role of Paula, the acerbic talent booker, on \"<a href=\"http://www.sonypictures.com/homevideo/thelarrysanderscollection/\" target=\"_blank\">The Larry Sanders Show</a>,\" for which she received an Emmy nomination in 1997 and two Cable Ace nominations. During the fall of '94 she joined the cast of \"Saturday Night Live.\" Other television work includes the series finale of \"Mad About You\" and the critically-lauded final season of NBC's \"<a href=\"http://www2.warnerbros.com/web/westwingtv/index.jsp\" target=\"_blank\">The West Wing</a>,\" where she played Democratic campaign strategist Louise Thornton. In 2007, Janeane's voice was featured in the Disney/Pixar animated comedy Ratatouille. Janeane can also be seen in Stella writer/director David Wain's ensemble comedy, \"The Ten,\" the Lifetime movie \"Girl's Best Friend\" and as a recurring character on the 2009 season of \"<a href=\"http://www.fox.com/24/\" target=\"_blank\">24</a>.\"</p>\n<p> </p>\n",
  "pageUrl": "16925-janeane-garofalo"
}