{
  "id": 17236,
  "events": [
    17183
  ],
  "emceeEvents": [],
  "name": "The Doubleclicks",
  "twitter": "thedoubleclicks",
  "website": "http://thedoubleclicks.com",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/banana-768x503.jpg",
  "photoUrl": "/api/img/performer-images/performer-thedoubleclicks-300x300.jpg",
  "sortOrder": 139,
  "excludeFromList": false,
  "bio": "<p>The Doubleclicks (Angela Webber and Aubrey Webber) are a Portland-based musical duo who mix comedy, messages and geek culture in charming, catchy songs. Since debuting with a weekly YouTube songwriting project in 2011, the Doubleclicks have carved out a space in geek and songwriting communities with their message of empowerment and their penchant for involving their community of listeners in the creation of their music and videos. The Doubleclicks’ 2012 album Lasers and Feelings and 2015 album President Snakes both hit top 10 in the Billboard charts in comedy. They continue to release new music on Youtube and at <a href=\"http://www.thedoubleclicks.com/\" target=\"_blank\">http://www.thedoubleclicks.com/</a></p>\n<p>The Doubleclicks tour the country, playing everywhere from music venues to comedy clubs, game stores, and at events like San Diego Comic-Con, PAX, JoCoCruise and more.<br />\nSometimes called “nerd music” or “kids music,” the Doubleclicks reach beyond these labels to create meaningful music making audiences laugh and cry. Doubleclicks songs have been featured on several NPR programs, college radio stations and all around the Internet, including Nerdist, BoingBoing, Huffington Post, Kotaku, and more.</p>\n<p>The Doubleclicks produce a touring variety show called #NerdNightOut which features comedy and music for a geek audience, and has included guests like Jackie Kashian, Mike Drucker and Bill Corbett.</p>\n<p>The band’s loyal fanbase frequently participates in their music videos and has elevated the band by funding three albums via Kickstarter projects raising a total of more than $202,000.</p>\n<p>The Doubleclicks have written theme songs and created commercials for popular game brands Cards Against Humanity and Fluxx, for a Nerdist partnership with Totinos, and for many podcasts and web series. </p>\n",
  "pageUrl": "17236-the-doubleclicks"
}