{
  "id": 19161,
  "events": [
    17149
  ],
  "emceeEvents": [],
  "name": "Patton Oswalt",
  "twitter": "pattonoswalt",
  "website": "http://www.pattonoswalt.com/",
  "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/patton_0.jpg",
  "photoUrl": "/api/img/performer-images/performer-pattonoswalt-300x300.jpg",
  "sortOrder": 1,
  "excludeFromList": false,
  "bio": "<p>A comedian, actor, and writer, Patton Oswalt continues to find success in all areas of entertainment. From his Emmy-winning and Grammy- nominated comedy specials to his many memorable film roles and guest appearances on his favorite TV shows (including “Parks and Recreation,” for which he received a TV Critics Choice Award), Oswalt continues to choose work that inspires him and entertain audiences.</p>\n<p>In April, Oswalt released his sixth comedy special “Talking for Clapping” (Netflix) and can currently be seen on Netflix’s new show “Lady Dynamite,” starring fellow comedian Maria Bamford, and on HBO’s “Veep.” He also recently finished shooting the big screen adaptation of Dave Eggers’ novel THE CIRCLE, alongside Tom Hanks, Emma Watson, and John Boyega.</p>\n<p>Oswalt was nominated for his work on the big screen with a Critics Choice Award for his performance in Jason Reitman’s film YOUNG ADULT, starring opposite Charlize Theron. In 2009, he also received critical acclaim for his performance in Robert Siegel’s BIG FAN; the film was nominated for an Independent Spirit Award and Oswalt earned a Gotham Award nomination for his performance.</p>\n<p>Oswalt has appeared in many films, including THE SECRET LIFE OF WALTER MITTY, with Ben Stiller, Steven Soderbergh’s THE INFORMANT, alongside Seth Rogen in OBSERVE AND REPORT, in Paul Thomas Anderson’s MAGNOLIA, ZOOLANDER, STARSKY AND HUTCH, and RENO 911!: MIAMI, among many others.</p>\n<p>He also provided the voice for ‘Remy’, the rat, in Pixar’s Oscar-winning RATATOUILLE, and has voiced characters on TV shows such as “Archer,” “BoJack Horseman,” “The Simpsons,” “Bob’s Burgers,” “Aqua Teen Hunger Force,” and “Word Girl.” He is also the narrator on ABC’s hit comedy “The Goldbergs.”</p>\n<p>As a comedian, Oswalt has shot six TV specials and five critically acclaimed albums, including his Grammy-nominated special Tragedy Plus Comedy Equals Time which debuted in 2014. Finest Hour also received a Grammy nomination for “Best Comedy Album,” as well as a Showtime one-hour special of the same name. In 2009, Patton received his first Grammy nomination for his album My Weakness Is Strong (Warner Brothers Records).</p>\n<p>Both of his published books Zombie Spaceship Wasteland (2011) and Silver Screen Fiend (2015) are New York Times Best Sellers.</p>\n",
  "pageUrl": "19161-patton-oswalt"
}