{
  "performers": [
    {
      "id": 16791,
      "events": [],
      "emceeEvents": [],
      "name": "Adam Christie",
      "twitter": "theadamchristie",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/adamc.jpg",
      "photoUrl": "/api/img/performer-images/performer-adamchristie-300x300.jpg",
      "sortOrder": 24,
      "excludeFromList": false,
      "bio": "<p>Adam Christie is an award winning writer and stand-up comedian originally from Toronto, Canada. He&#039;s written on four seasons of the hit CBC show &#039;This Hour Has 22 Minutes&#039;, and has been featured on Muchmusic, MTV, NXNE, JFL 42, The Hubcap Comedy Festival, and has opened for Jen Kirkman and Eric Andre during the Halifax Pop Explosion.</p>\n<p>Adam is a former producer of the critically acclaimed &#039;Laugh Sabbath&#039; weekly show in Toronto. He&#039;s won a Canadian Comedy Award for writing in a television comedy, and has been nominated for two Canadian Screen Awards. </p>\n<p>Adam currently splits his time between Los Angeles, California, and Halifax, Nova Scotia.</p>\n",
      "pageUrl": "16791-adam-christie"
    },
    {
      "id": 16103,
      "events": [],
      "emceeEvents": [],
      "name": "John Novosad",
      "twitter": "HippiemansPlan",
      "website": "http://hippieman.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/img_8358email.jpg",
      "photoUrl": "/api/img/performer-images/performer-johnnovosad-300x300.jpg",
      "sortOrder": 1,
      "excludeFromList": false,
      "bio": "<p>My name is John Novosad. I am from Boulder, Colorado. I am based out of the Comedy Works in Denver, Colorado. I am a stand-up comic. I tour nationally. I was married for eleven years. I am divorced. We did not have any children. I’m six feet tall. I weigh one hundred and ninety-three pounds. I first did stand-up in 1980. I toured extensively between 1985 and 1993. I worked a day job and did comedy part-time from 1994 through 2001. I have been a full-time comic since 2002. Performing stand-up is great fun. It drives me to open mics on my nights off. </p>\n<p>My credits include:<br />\nWinner of the Laughing Skull Comedy Festival competition 2016<br />\nWinner of the Laughlin Comedy Festival competition 2015<br />\nComedy Exposition 2016<br />\nHigh Plains Comedy Festival 2016, 2015, 2013<br />\nAspen Laff Festival 2015, 2014<br />\nFeatured performer at the Comedy Works in Denver, Colorado<br />\nTwo appearances on the Late Late Show with Craig Ferguson<br />\nOne appearance on Bryon Allen’s Comedy.TV</p>\n",
      "pageUrl": "16103-john-novosad"
    },
    {
      "id": 16457,
      "events": [],
      "emceeEvents": [],
      "name": "David Venhuizen",
      "twitter": "david_venhuizen",
      "website": "http://davidvenhuizen.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/15972750_10100683388815544_8662568898550880063_o.jpg",
      "photoUrl": "/api/img/performer-images/performer-davidvenhuizen-300x300.jpg",
      "sortOrder": 3,
      "excludeFromList": false,
      "bio": "<p>David Venhuizen is a Los Angeles based comedian originally from South Dakota. He has performed on the LA Riot, Moontower, SF Sketchfest, Green Gravel, Crom, Orlando Indie, and Hell Yes comedy festivals. He also runs a monthly stand-up show called Idiots at The Clubhouse in Los Feliz  and performs in the sketch group The Fringe Riders with Dan Gill and Colin McCormick.</p>\n",
      "pageUrl": "16457-david-venhuizen"
    },
    {
      "id": 16828,
      "events": [],
      "emceeEvents": [],
      "name": "Kevin Avery",
      "twitter": "kevinavery",
      "website": "http://kevinaverycomedy.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/13603514_10157078314940517_4502523661211233666_o.jpg",
      "photoUrl": "/api/img/performer-images/performer-kevinavery-300x300.jpg",
      "sortOrder": 4,
      "excludeFromList": false,
      "bio": "<p>Kevin Avery is a comedian and Emmy award winning writer whose credits include HBO’s Last Week Tonight with John Oliver, VH1′s Best Week Ever and the critically acclaimed FX original series, Totally Biased with W. Kamau Bell, on which he had the distinction of serving as head writer. He was co-writer of the Comedy Central digital series, White Flight, and the cohost of the popular Wolfpop podcast, Denzel Washington is the Greatest Actor of All Time, Period, praised by Buzzfeed as “smart” and “funny” and recommended by Entertainment Weekly as a “Must List(en).”</p>\n",
      "pageUrl": "16828-kevin-avery"
    },
    {
      "id": 16647,
      "events": [],
      "emceeEvents": [],
      "name": "Marcella Arguello",
      "twitter": "MarcellaComedy",
      "website": "http://MarcellaComedy.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/img_0241.jpg",
      "photoUrl": "/api/img/performer-images/performer-marcellaarguello-300x300.jpg",
      "sortOrder": 5,
      "excludeFromList": false,
      "bio": "<p>Too lazy to shoot hoops and too tall to model, Marcella Arguello stands over 6 feet. Although she may be taller than most men, the only thing more intimidating than her height is her comedy. Marcella mixes a combination of genuine reason with a sexy suggestion of street. Deemed as “sexually and ethnically ambiguous” she appeals to everyone and is not afraid to tell you how she really feels about subjects concerning race, gender, politic, relationships, family, work, music, pop culture and whatever else is on her mind that day.</p>\n<p>Time Out Magazine deemed Marcella an “LA Comedian to Watch in 2017” and is a fan favorite on Comedy Central’s @midnight. Most recently, she won her appearance on TruTv’s Comedy Knock Out and can be seen on The UCB Show’s upcoming second season on Seeso. She was featured on Viceland’s Flophouse, and in 2015 on NBC’s Last Call with Carson Daly; her stand up has been highlighted on rapper Tyler, The Creator’s mobile app and on Fox’s The Real. Her Twitter account (@marcellacomedy) has been featured on CNN, TIME.com, HuffingtonPost.com and various entertainment websites. She is a regular opener for Last Comic Standing Winner Felipe Esparza as well as NBC Superstore’s Nico Santos. She has opened for David Alan Grier, Norm MacDonald, J.B. Smoove, Hannibal Buress, Ron Funches, Godfrey, Bryan Callen, Aries Spears, Hasan Minhaj, Al Madrigal, Joey Coco Diaz, Melanie Comarcho, Melissa Villaseñor and has shared a stage with Bill Burr, Paul Mooney and Robin Williams.</p>\n<p>She has worked at The Improv Comedy Clubs all over the country and is a regular at The Punch Line Comedy Clubs in Northern California. She has performed at San Francisco Sketchfest, Riot LA Comedy Festival, overseas for American troops and comedian Sean Keane referred to her as the “finest export from Modesto since George Lucas.”</p>\n",
      "pageUrl": "16647-marcella-arguello"
    },
    {
      "id": 15957,
      "events": [],
      "emceeEvents": [],
      "name": "Raj Desai",
      "twitter": "_rajdesai",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/raj_desai_photo_.png",
      "photoUrl": "/api/img/performer-images/performer-rajdesai-300x300.jpg",
      "sortOrder": 6,
      "excludeFromList": false,
      "bio": "<p>Raj Desai is a writer and stand-up comedian residing in Los Angeles.  He recently wrote for Triumph the Insult Comic Dog&#039;s Hulu specials, for which he was nominated for a 2016 Primetime Emmy Award and a 2017 Writers Guild Award.  He also worked as a writer/blogger on Comedy Central&#039;s &quot;The Jeselnik Offensive&quot; and has had humor pieces published by &quot;The New Yorker&quot; and &quot;McSweeney&#039;s.&quot;</p>\n<p>He has performed stand-up on the &quot;Late Late Show with Craig Ferguson,&quot; &quot;Last Comic Standing,&quot; and Comedy Central’s &quot;Live at Gotham.&quot;   He continues to perform standup around L.A. at The Comedy Store, The Improv, Nerdmelt, UCB and other venues in and outside L.A.</p>\n<p>He has also acted in ABC&#039;s &quot;Fresh Off the Boat&quot; and Comedy Central&#039;s &quot;Hampton Deville,&quot; in addition to playing Reba on the hit sitcom &quot;Reba.&quot;</p>\n",
      "pageUrl": "15957-raj-desai"
    },
    {
      "id": 16865,
      "events": [],
      "emceeEvents": [],
      "name": "Lashonda Lester",
      "twitter": "glamgirl313",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/shondee.png",
      "photoUrl": "/api/img/performer-images/performer-lashondalester-300x300.jpg",
      "sortOrder": 7,
      "excludeFromList": false,
      "bio": "<p>Lashonda Lester is an Austin based comedian and producer. Her down-to-earth observations and casual storytelling style will make you feel like you&#039;re hanging out with your funniest friend. Comedy Central recently named her as a Comic To Watch 2016. She’s appeared on Nickelodeon’s NickMom Night Out,  Laughs TV on Fox and was selected as one of the top 100 for season 9 of NBC’s Last Comic Standing. In addition she’s opened for Grammy award winning band Earth, Wind, &amp; Fire, performed at the Moontower Comedy Festival and is the winner of 2016’s Funniest Person In Austin competition. </p>\n<p>When not performing stand up, she’s the star/creator/executive producer of the biography lecture series Weird! True Hollywood Tales, now in its 5 season.</p>\n",
      "pageUrl": "16865-lashonda-lester"
    },
    {
      "id": 16464,
      "events": [],
      "emceeEvents": [],
      "name": "Sara June",
      "twitter": "heysarajune",
      "website": "http://www.heysarajune.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/sara_june_with_plaid_medium.jpeg",
      "photoUrl": "/api/img/performer-images/performer-sarajune-300x300.jpg",
      "sortOrder": 8,
      "excludeFromList": false,
      "bio": "<p>Sara June is a comedian based in Los Angeles. She’s performed at Fun Fun Fun Fest, SF Sketchfest and Riot LA; she also makes surreal sketch videos, which you can watch on heysarajune.com.</p>\n",
      "pageUrl": "16464-sara-june"
    },
    {
      "id": 16169,
      "events": [],
      "emceeEvents": [],
      "name": "Dusty Slay",
      "twitter": "dustyslay",
      "website": "http://bridgetown.festivalthing.com/dustyslaycom",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/13592652_10157210742330245_7627880667630795170_n.jpg",
      "photoUrl": "/api/img/performer-images/performer-dustyslay-300x300.jpg",
      "sortOrder": 9,
      "excludeFromList": false,
      "bio": "<p>Dusty Slay is a stand-up comedian with a baritone voice so smooth it&#039;s like champagne in your ears. </p>\n<p>Slay has appeared on several network shows including NBC’s &quot;Last Comic Standing&quot;, the popular program &quot;Laughs on FOX&quot; and he was a featured comedian on &quot;TMZ&quot;.  </p>\n<p>Dusty&#039;s comedy is regularly showcased on many nationally syndicated radio programs including Sirius XM, Pandora Radio and &quot;The Bob and Tom Radio Show&quot;. He’s also been invited to numerous comedy festivals across America including: The Laughing Skull Festival, The Charleston Comedy Festival and The Cape Fear Comedy Festival. Dusty won both the &quot;Fight Night Competition&quot; and the “Almost Famous Competition” at the Charlotte Comedy Zone in 2014.  During his years in Charleston, SC Slay won The Charleston Comedy Festival Stand Up Competition two years in a row and was voted &quot;Best Local Comic&quot; by the readers of the Charleston City Paper in 2013 and 2014.</p>\n<p>Dusty was born in Alabama, his parents divorced when he was two, then there was a custody battle, his mom lost, so he had to go live with her. He split time between his dad who lived on a farm, and his mom who lived in a trailer park. When asked about his education, Slay says, “When I was kid, my dad asked me if I wanted to go to college or if I wanted a pool. Man, I love that pool.”</p>\n<p>Dusty Slay is based in Nashville, TN where he is a local favorite at his home club at Zanies and has opened for many touring celebrities such as Rob Schneider, Jeff Ross and Roseanne.  Dusty, however, spends most of his time on the road where he continues to make audiences laugh all over the country at comedy clubs such as: The Punchline and Laughing Skull in Atlanta, Crackers Comedy Club in Indianapolis, The Charlotte Comedy Zone, Funny Bone Clubs (Syracuse, NY; Albany, NY; Virginia Beach, VA; Richmond, VA; Toledo, OH; Columbus, OH; Dayton, OH; Des Moines, IA), Comedy Club on State in Madison, WI, The Improv (Tampa, FL; Kansas City, MO) as well as many other clubs.</p>\n<p>In 2014, Dusty released his debut comedy album “Makin’ That Fudge” which can be found at CDBaby.com, Amazon.com and ITunes and is featured on Sirius XM.</p>\n<p>Dusty&#039;s new album &quot;Son of a Ditch&quot; will be released later this year.</p>\n",
      "pageUrl": "16169-dusty-slay"
    },
    {
      "id": 15908,
      "events": [],
      "emceeEvents": [],
      "name": "Ben Harkins",
      "twitter": "TheBenHarkins",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot_4.jpg",
      "photoUrl": "/api/img/performer-images/performer-benharkins-300x300.jpg",
      "sortOrder": 10,
      "excludeFromList": false,
      "bio": "<p>Ben Harkins is a Pittsburgh native currently residing in Portland, Oregon. Harkins hosts Flyass Jokes, Portland’s longest running stand up showcase. His unsweetened insights and deadpan delivery have made him an audience favorite throughout the Pacific Northwest. His contentious material covers everything from the extinction of species to the price of groceries. Ben Harkins has performed at San Francisco Sketchfest, Mutiny X Radio Festival, the Helium Comedy Club in Portland and headlined at the Seven Nightclub in Bend Oregon</p>\n",
      "pageUrl": "15908-ben-harkins"
    },
    {
      "id": 16325,
      "events": [],
      "emceeEvents": [],
      "name": "Caleb Synan",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/caleb_synan.jpg",
      "photoUrl": "/api/img/performer-images/performer-calebsynan-300x300.jpg",
      "sortOrder": 11,
      "excludeFromList": false,
      "bio": "<p>Caleb Synan<br />\nSo far in 2015, Caleb Synan has made appearances on CONAN, NBC’s Last Comic Standing, and the Bob and Tom Show. His deceptively smart blend of Southern charm and razor sharp wit has also made him a festival favorite, with appearances at Montreal’s Just For Laughs, Laugh Your Asheville Off, The Charleston Comedy Festival, and Athfest 2015. He also won “Wittiest” in Franklin County High School’s 2009 Yearbook. And he’s a pretty nice guy.</p>\n<p>\nWebsite:<br /><a href=\"http://calebsynan.tumblr.com/\">http://calebsynan.tumblr.com/</a></p>\n<p>\nStand up Sets:<br /><a href=\"https://www.youtube.com/watch?v=6WUImcSYyyQ\">https://www.youtube.com/watch?v=6WUImcSYyyQ</a><br /><a href=\"https://www.youtube.com/watch?v=6x4s7OeZd70\">https://www.youtube.com/watch?v=6x4s7OeZd70</a><br /><a href=\"https://www.youtube.com/watch?v=TxlBo5yzN9o\">https://www.youtube.com/watch?v=TxlBo5yzN9o</a><br /><a href=\"https://www.youtube.com/watch?v=qO_Si9on9LM\">https://www.youtube.com/watch?v=qO_Si9on9LM</a></p>\n",
      "pageUrl": "16325-caleb-synan"
    },
    {
      "id": 16102,
      "events": [],
      "emceeEvents": [],
      "name": "Naomi Karavani",
      "twitter": "naomikaravani",
      "website": "http://www.naomikaravani.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/bymindytucker1000.jpg",
      "photoUrl": "/api/img/performer-images/performer-naomikaravani-300x300.jpg",
      "sortOrder": 12,
      "excludeFromList": false,
      "bio": "<p>Naomi Karavani is a comedian and a correspondent for the weekly news comedy show &quot;Redacted Tonight.&quot;  She appeared in comedy festivals such as the 202 Comedy Festival, Women in Comedy Conference - New York, and the District of Comedy Festival. She appeared in the mockumentary “Finding Simfeld” as Elaine Benis and is currently developing an original series.<br />\n​<br />\nBefore joining the Redacted team she worked as a high school history teacher in Brooklyn, New York for over five years.  Alongside her weekly news comedy segments, she performs stand up around the country and co-produces the weekly stand up comedy show &quot;Bitches&#039; Brew&quot; in Brooklyn and the monthly mock university lecture series &quot;Fale University&quot; in Washington, DC.</p>\n",
      "pageUrl": "16102-naomi-karavani"
    },
    {
      "id": 16502,
      "events": [],
      "emceeEvents": [],
      "name": "Matt Lieb",
      "twitter": "lieb123456789",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/matt_lieb_headshot_2.jpg",
      "photoUrl": "/api/img/performer-images/performer-mattlieb-300x300.jpg",
      "sortOrder": 13,
      "excludeFromList": false,
      "bio": "<p>Matt Lieb is a comic and comedy writer from San Francisco, where he was named one of the &quot;Best Comedians in the Bay Area&quot; by SFist and Courting Comedy. Matt is a correspondent on The Star Wars Show on StarWars.com, a writer/performer on Al Jazeera&#039;s only comedy show Newsbroke, and staff writer for Audible&#039;s original series &quot;Bedtime Stories for Cynics with Nick Offerman.&quot; Matt&#039;s stand up was featured on the show &quot;Flophouse&quot; on VICELAND, &quot;The Guest List&quot; on SeeSo, Gabriel Iglesias&#039; &quot;Stand Up Revolution Radio&quot; on SiriusXM, and is featured on Hulu.</p>\n",
      "pageUrl": "16502-matt-lieb"
    },
    {
      "id": 16591,
      "events": [],
      "emceeEvents": [],
      "name": "Nick Vatterott",
      "twitter": "nickvatterott",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/nickvatterottheadshot_01272017125716_large.jpg",
      "photoUrl": "/api/img/performer-images/performer-nickvatterott-300x300.jpg",
      "sortOrder": 14,
      "excludeFromList": false,
      "bio": "<p>In 2010 The Hollywood Reporter named Nick Vatterott one of the “break-outs” at Montreal’s Just for Laughs Comedy Festival. Since then he has performed on <em>Conan</em>, <em>Late Night with Jimmy Fallon</em> and has a half hour special on Comedy Central. Nick was also a producer/writer/performer on Comedy Central’s stand-up sketch hybrid show <em>Mash-Up</em>, and with co-creator TJ Miller sold the project <em>Manimation</em> to Fox's ADHD. He was the recipient of the prestigious Andy Kaufman award in 2011 and before heading off to NYC, Chicago Magazine listed Nick as “The Funniest Man in Chicago.” Nick’s debut comedy record, FOR AMUSMENT ONLY was released in November 2014 by Comedy Central Records and was voted by Vulture, Laughspin, and Splitsider as one of the year’s best comedy albums. In addition to naming Vatterott’s album one of the best of 2014, Vulture.com also listed him as one of the top 50 comedians you should know in 2015. Nick has been called “one of the most dynamic performer’s today” by The Laugh Button and his LATE NIGHT WITH JIMMY FALLON set was received as “so damn brilliant” by The Chicago Reader.  Nick has also had correspondent work on THE BIG TEN NETWORK and is currently writing for GORBURGER on Comedy Central with TJ Miller.</p>\n",
      "pageUrl": "16591-nick-vatterott"
    },
    {
      "id": 16530,
      "events": [],
      "emceeEvents": [],
      "name": "Irene Tu",
      "twitter": "irene_tu",
      "website": "http://irenetu.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/irene_tu_headshot_daniel_schuleman.jpg",
      "photoUrl": "/api/img/performer-images/performer-irenetu-300x300.jpg",
      "sortOrder": 15,
      "excludeFromList": false,
      "bio": "<p>Irene Tu is a San Francisco-based stand-up comedian, writer, and actor. In 2016, she was named one of the “Bay Area’s 11 Best Stand Up Comedians” by the SFist and one of 20 “Women to Watch” by KQED. She has been featured in SF Sketchfest, Limestone Comedy Festival, RIOT LA and on Seeso and Viceland. Irene hosts several popular shows in the Bay Area: Man Haters, The Mission Position, and Millennials Ruin Everything (they do). You can follow her @irene_tu. irenetu.com</p>\n",
      "pageUrl": "16530-irene-tu"
    },
    {
      "id": 16718,
      "events": [],
      "emceeEvents": [],
      "name": "Andie Main",
      "twitter": "andiemain",
      "website": "http://andiemaincomedy.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot2_1.jpg",
      "photoUrl": "/api/img/performer-images/performer-andiemain-300x300.jpg",
      "sortOrder": 16,
      "excludeFromList": false,
      "bio": "<p>Andie Main is a Portland based comedian who keeps busy by producing/hosting The Doug Fir Lounge&#039;s summer series The Cool Kids Patio Show, and her politically themed series called Revolution Comedy; which organizes fundraisers for worthy causes like Planned Parenthood, The ACLU, and Black Lives Matter.<br />\nAt this point, she has raised over $10,000 for #TheResistance and although she&#039;s a lifelong punk rocker, is proud to see these shows selling out.</p>\n<p>Festival credits include The Comedy Exposition, Bumbershoot, Seattle Sketchfest, SF Sketchfest, The All Jane Comedy Festival, Portland Pride 2014, Treefort Festival and Cromfest. She;s performed at UCBeast, UCB Chelsea and The Stand Nightclub in NYC, Put Your Hands Together and The Rabbit Hole in LA.  and hosts shows at Helium Comedy Club in Portland.</p>\n<p>She is a regular feature act for comedians like TJ Miller, Myq Kaplan and James Adomian and after her set they&#039;ve all said &quot;hey Andie that was great!&quot; and got brunch because you can order brunch whenever you want in Portland.</p>\n<p>In her spare time she enjoys taking hikes with her not-so-smart dog, punk and post punk music, making goofy paintings, nature documentaries and yelling about the patriarchy.</p>\n",
      "pageUrl": "16718-andie-main"
    },
    {
      "id": 16021,
      "events": [],
      "emceeEvents": [],
      "name": "Kathleen Kanz",
      "twitter": "",
      "website": "http://www.kathleenkanz.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/kathleen_kanz.jpg",
      "photoUrl": "/api/img/performer-images/performer-kathleenkanz-300x300.jpg",
      "sortOrder": 17,
      "excludeFromList": false,
      "bio": "<p>Kathleen Kanz is the winner of the 2016 Vermont’s Funniest Comedian contest and the first woman to hold that title.  In January 2016, she hosted/opened for Gilbert Gottfried, the first national headliner at the newly opened Vermont Comedy Club.  She’s been producing and performing comedy in Vermont since 2007.  Her style favors compact jokes containing twisted logic.  She’s the founder of two popular and successful annual events: the Green Mountain Comedy Festival (2009), and Comic Relief - A Benefit for COTS (2013).  She has jokes in two books, “She&#039;s So Funny” and “Squeaky Clean Comedy” and was published in the debut issue of &quot;Swivel – The Nexus of Women &amp; Wit&quot;.</p>\n",
      "pageUrl": "16021-kathleen-kanz"
    },
    {
      "id": 15951,
      "events": [],
      "emceeEvents": [],
      "name": "Pat Brown",
      "twitter": "patbrownshow",
      "website": "http://www.comedianpatbrown.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/pat-brown-sidelean2.jpg",
      "photoUrl": "/api/img/performer-images/performer-patbrown-300x300.jpg",
      "sortOrder": 18,
      "excludeFromList": false,
      "bio": "<p>Pat Brown is well regarded comedy writer and seasoned performer. Her style can be summed up as smart playfulness wrapped in social commentary. She finds humor in the small--the routine of her daily life and the big--the complexities of human behavior and joking about both with clever insightfulness.</p>\n<p>Proudly and forever a ‘tomgirl’ Pat grew up in Kansas City, MO an oasis for an active kid that loved sports, outdoors and good barbeque. Pat grew up surrounded by funny, her father and brother were an endless source of entertainment. Pat became aware of her talent for comedy during many afterschool  ‘hanging out’ sessions in the company of her small diverse band of friends.  Her gift became more widely recognized in high school and she was voted “Most Humorous” in her senior year.</p>\n<p>After receiving a basketball scholarship to S.C.S.U. Pat headed south. After graduating with a degree in Theatre, she then moved to Atlanta, GA where she bounced around in several fields till she found stand up comedy. She debuted as a stand up at the Comedy Act Theatre. She has been performing stand up ever since.</p>\n<p> MOVIES<br />\n2015 WHITE WATER as Sophie, TVOne’s Original Movie<br />\nBLOOD TIES, starring Zoe Saldana<br />\nTHREE CAN PLAY THAT GAME starring Vivica Fox<br />\nSOMEBODIES as Aunt Agnes</p>\n<p>AWARDS<br />\n2013 Winner of “She Devil Comedy Competition”<br />\n2007 Winner “Best Female Comic” at Las Vegas Comedy Competition</p>\n<p>TV APPEARANCES<br />\nFuse TV Uproarious<br />\nGotham Axis Live<br />\nLaughs on Fox<br />\nBET Comic View<br />\nBounce TV’s Off The Chain<br />\nNBC Comic’s Unleashed<br />\nComedy Central’s Laffapalooza</p>\n<p>IMPROV ACTOR<br />\nUCB, Blacktop Circus and Laughing Matters</p>\n",
      "pageUrl": "15951-pat-brown"
    },
    {
      "id": 16894,
      "events": [],
      "emceeEvents": [],
      "name": "Eliza Skinner",
      "twitter": "elizaskinner",
      "website": "http://eliza.skinner@gmail.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/eliza_skinner_2017.jpg",
      "photoUrl": "/api/img/performer-images/performer-elizaskinner-300x300.jpg",
      "sortOrder": 19,
      "excludeFromList": false,
      "bio": "<p>Eliza Skinner is originally from Richmond, VA and started her performing career as an unnamed child revolutionary in a production of Evita. She is now a stand-up comedian and has appeared on The Pete Holmes Show, @Midnight, Chelsea Lately, Upload with Shaquille O’Neal, MTV, Showtime, AMC and the BBC. She has performed in festivals all over the world including RiotLA, SXSW, Bridgetown, the NY Comedy Festival and the Edinburgh Fringe. In his Reddit AMA, Patton Oswalt called her one of his favorite up-and-coming comedians. Eliza was a writer and correspondent on Totally Biased (produced by Chris Rock), Fashion Police (with Joan Rivers), Adam Ruins Everything (truTV) and she was a staff writer for The Late Late Show with James Corden. In 2014 she was selected to be one of the “New Faces Of Comedy” at the Montreal Just For Laughs Festival. In 2015 she was selected for the “SF Sketchfest Dozen” and TimeOut LA named her one of 9 “Comics To Watch in 2015″. She is currently the headwriter of Drop The Mic coming to TBS this spring.</p>\n",
      "pageUrl": "16894-eliza-skinner"
    },
    {
      "id": 16283,
      "events": [],
      "emceeEvents": [],
      "name": "Clara N Bijl",
      "twitter": "clarabijl",
      "website": "http://www.funnyfrench.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/bijl_headshot_2105_-_sabrinabot_2.jpg",
      "photoUrl": "/api/img/performer-images/performer-claranbijl-300x300.jpg",
      "sortOrder": 20,
      "excludeFromList": false,
      "bio": "<p>Clara is an internationally-unknown stand-up comedian: one of the few humorists to be unknown in the entire world! </p>\n<p>Clara was raised in both the French Alps and Germany before she attended college in South Carolina; as you do when you come from France. </p>\n<p>Clara’s humor is witty and observational and comes with a European twang. </p>\n<p>Clara has appeared in the San Francisco International Comedy Competition, SF SketchFest, the Charleston Comedy Festival, the Montreux Comedy Festival, the San Diego Comedy Festival… She’s performed with Robin Williams, Tom Papa, Paul Reiser, Laurie Kilmartin, Anne Roumanoff &amp; many more.</p>\n<p>She was once stranded for hours on a broken escalator due to a power outage. </p>\n",
      "pageUrl": "16283-clara-n-bijl"
    },
    {
      "id": 15799,
      "events": [],
      "emceeEvents": [],
      "name": "Robby Hoffman",
      "twitter": "iAmRobbyHoffman",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/robbyhoffman_v1.jpg",
      "photoUrl": "/api/img/performer-images/performer-robbyhoffman-300x300.jpg",
      "sortOrder": 21,
      "excludeFromList": false,
      "bio": "<p>Robby Hoffman is a small red-headed ex-Chasidic lesbian Jew stand-up comedian and writer. She was recently New Faces at JFL42 (2015) and asked back to the festival (2016). She also performed at Off-JFL in Montreal (2016). She also performed at the All Jane festival in Portland (2016) and has been asked for industry selection at the Funny Women Fest in Los Angeles (2016). </p>\n<p>In her first couple years doing stand up, she had also won the WICF scholarship for Best Newcomer (2013) was named one of the “Top 10 Comedians” by the popular Montreal Mirror (2014), and hottest Top 50 on afterellen.com (2014). She was also in the TOP 10 of SiriusXM&#039;s Canada&#039;s Next Top Comic (2013) and created a hit mini web-series sponsored by Just for Laughs called Comedy in Biblical Proportions.</p>\n<p>Robby also writes a whole bunch for TV, most recently for Odd Squad (PBS), who took home the Emmy Award for Outstanding Writing in April (2016). She recently relocated from Toronto to LA where she is consistently booked on some of the most sought after shows in town.</p>\n",
      "pageUrl": "15799-robby-hoffman"
    },
    {
      "id": 15967,
      "events": [],
      "emceeEvents": [],
      "name": "Samantha Ruddy",
      "twitter": "Samlymatters",
      "website": "http://samantharuddy.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/img_7176.jpg",
      "photoUrl": "/api/img/performer-images/performer-samantharuddy-300x300.jpg",
      "sortOrder": 22,
      "excludeFromList": false,
      "bio": "<p>Samantha Ruddy is a comedian who hails from just outside Scranton, Pennsylvania, and now lives in Brooklyn. She brings to the stage a world of goofy observations and witty one-liners. She has been named 1 of the 50 Funniest in Brooklyn by Brooklyn Magazine, called a comic &quot;you should be obsessed with&quot; by BUST, and selected to perform as part of the Caroline&#039;s Breakout Artist Series. She has performed in the New York Comedy Festival, Laugh Your Asheville Off Festival, and Limestone Comedy Festival. In addition to her standup, she is a contributing writer to Collegehumor, Someecards, and Reductress.</p>\n",
      "pageUrl": "15967-samantha-ruddy"
    },
    {
      "id": 16429,
      "events": [],
      "emceeEvents": [],
      "name": "Robbie Pankow",
      "twitter": "robbiepankow",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/ice_cream.jpg",
      "photoUrl": "/api/img/performer-images/performer-robbiepankow-300x300.jpg",
      "sortOrder": 23,
      "excludeFromList": false,
      "bio": "<p>Robbie Pankow is a comedian and podcaster born and raised in Portland, OR. He has been described as &quot;right in my wheelhouse&quot; by some and &quot;acceptable&quot; by others. He placed in the finals of Helium Comedy Club&#039;s &quot;Portland&#039;s Funniest Person&quot; Contest in 2015. His podcast, Eat Food, Already and monthly showcase Whatever Forever have been taking Portland by a light storm and if he somehow gets his way, it&#039;s only gettin stormier!</p>\n",
      "pageUrl": "16429-robbie-pankow"
    },
    {
      "id": 16768,
      "events": [],
      "emceeEvents": [],
      "name": "Sean Devlin 叶 世民",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/sean_devlin_photo.jpg",
      "photoUrl": "/api/img/performer-images/performer-seandevlin-300x300.jpg",
      "sortOrder": 2,
      "excludeFromList": false,
      "bio": "<p>Sean Devlin 叶 世民 is a Filipino-Canadian comedian and filmmaker who has been performing stand up for 14 years. Previous festival appearances include Just For Laughs Northwest and Bumbershoot Festival. He has performed as an opening act for Hari Kondabolu, Aamer Rahman, Reggie Watts and Tig Notaro - as well musical acts Of Montreal and MGMT. His comedy has also been featured on CBC Radio, XM radio, Upworthy.com and in the CTV mini-mini series The Party.  His film work has been featured in the New York Times, The Guardian and popular online platforms such as Buzzfeed and Boing Boing. He works as a filmmaker and action coordinator for political pranksters The Yes Men.</p>\n",
      "pageUrl": "16768-sean-devlin--"
    },
    {
      "id": 16312,
      "events": [],
      "emceeEvents": [],
      "name": "Nick Chambers",
      "twitter": "chamberscomedy",
      "website": "http://www.chamberscomedy.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/_chambersheadshot2.jpg",
      "photoUrl": "/api/img/performer-images/performer-nickchambers-300x300.jpg",
      "sortOrder": 25,
      "excludeFromList": false,
      "bio": "<p>Born &amp; raised in Worcester MA, Nick Chambers began performing stand-up comedy on a whim in 2009 and hasn’t been able to stop since. His laid back delivery and conversational tone has quickly led to becoming a regular performer all over the East Coast where he has opened for national headliners like Kyle Dunnigan and Bridget Everett. In 2016, Nick was a semi-finalist in the Boston Comedy Festival and performed in the Oddball Comedy Festival. He also made is feature film debut in the comedy &quot;Good Kids.”</p>\n",
      "pageUrl": "16312-nick-chambers"
    },
    {
      "id": 16693,
      "events": [],
      "emceeEvents": [],
      "name": "Daniel Sloss",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/794210.jpg",
      "photoUrl": "/api/img/performer-images/performer-danielsloss-300x300.jpg",
      "sortOrder": 26,
      "excludeFromList": false,
      "bio": "<p>He started performing stand-up aged just 16 and has appeared on the UK’s premier television shows including <em>Sunday Night at the Palladium</em>, <em>Michael McIntyre’s Comedy Roadshow, 8 Out of 10 Cats, Rob Brydon Show, Jason Manford’s Comedy Rocks, Comic Relief’s Mock The Week, Paul O’Grady Show (</em>Daniel’s TV debut aged 18<em>), Comedy Store, BBC’s Stand Up For Sport Relief, Set List, Russell Howard’s Good News</em>, as well as starring in his own BBC show, <em>The Adventures Of Daniel</em> (aged 19). US television appearances to date include multiple appearances on <em>Conan</em>, <em>The Late Late Show with Craig Ferguson</em> and <em>@Midnight</em>.</p>\n<p>His new 2014 show <em>Really…?!</em> had its world premiere at the Edinburgh Fringe, yet again performing to huge audiences at the EICC with extra shows due to demand. <em>Really…?!</em>  subsequently embarked on a major European autumn tour with 20 shows across 15 countries as well as UK theatre dates including 2 shows at London's Royal Albert Hall, Elgar Room.</p>\n<p>Daniel has toured internationally throughout Australia, South East Asia and throughout Europe. He has starred at major UK outdoor Festivals including Rockness, Bestival, Latitude, Reading, Leeds and the all-star Austrian Alps Comedy &amp; snowboarding festival Altitude.</p>\n<p>In December 2013 Daniel made his USA television debut on <em>Conan</em>. To date Daniel has appeared on Conan 6 times and  has also appeared on <em>The Late Late Show with Craig Ferguson, </em><em>Pete Holmes Show</em> and<em> @Midnight</em>.</p>\n",
      "pageUrl": "16693-daniel-sloss"
    },
    {
      "id": 16677,
      "events": [],
      "emceeEvents": [],
      "name": "Marcus Coleman",
      "twitter": "MrMarcusColeman",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/15036270_10208481411615269_8855618650158451991_n.jpg",
      "photoUrl": "/api/img/performer-images/performer-marcuscoleman-300x300.jpg",
      "sortOrder": 27,
      "excludeFromList": false,
      "bio": "<p>Originally hailing from St. Louis (a fact he can’t stop bringing up.) Marcus Coleman was named of Portland’s “Geniuses of Comedy” by the Portland Mercury, he was also chosen to perform in their sold out showcase at the remarkable Revolution Hall.<br />\nA laid back shit-talker with a smile, he’s been called a “bright new star” and praised for “sharp, smart jabs on politics, family, and life as a black man” (Portland Mercury).</p>\n<p> Among the cool venues he’s been lucky enough to perform are: The Secret Society, Jackpot Recording Studios, Curious Comedy Theater, and Helium Comedy Club; where he was named Dirty Dozen Roast Battle champion and picked as one of their “New Faces”</p>\n<p>He hosts the raucous and unpredictable Midnight Mic every Friday night at Funhouse Lounge and was recently chosen to replace the beloved Nariko Ott (RIP) as of the many co-hosts of the weekly showcase You’re Welcome at the gorgeous stage at Mississippi Pizza.</p>\n",
      "pageUrl": "16677-marcus-coleman"
    },
    {
      "id": 16603,
      "events": [],
      "emceeEvents": [],
      "name": "Debra DiGiovanni",
      "twitter": "DEBRADIGIOVANNI",
      "website": "http://www.debradigiovanni.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/debradig.jpg",
      "photoUrl": "/api/img/performer-images/performer-debradigiovanni-300x300.jpg",
      "sortOrder": 28,
      "excludeFromList": false,
      "bio": "<p>Comedian Debra DiGiovanni has been awarded the Canadian Comedy Award for best female comic for the third time in 5 years. She’s been called the “Best Comedian to see after a Messy Break Up” and for three years running-she was named her hometown Toronto’s favorite comedian. Debra’s a favorite at the Montreal Just for Laughs Comedy Festival, and attended in 2014 for the 9th time. She’s done the popular Bridgetown Fest in Portland (2013) the Glasgow Comedy Fest in Scotland (2013) and Debra was thrilled to do the Just For Laughs festival in Sydney Australia (2013).  Her first stand up DVD for the Showtime Network “Single, Awkward Female.” and is now available on Netflix.</p>\n",
      "pageUrl": "16603-debra-digiovanni"
    },
    {
      "id": 15767,
      "events": [],
      "emceeEvents": [],
      "name": "Casey Crawford",
      "twitter": "caseycrawford78",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/casey_headshot.jpg",
      "photoUrl": "/api/img/performer-images/performer-caseycrawford-300x300.jpg",
      "sortOrder": 29,
      "excludeFromList": false,
      "bio": "<p>Casey Crawford is a stand up comedian originally from South Dakota now living in Boston. He tells short, dumb jokes in the style of Emo Philips, Steven Wright, and Zach Galifianakis. You might like Casey if you like those guys. Casey has participated in the Green Gravel Comedy Festival, the Limestone Comedy Festival, the Boston Comedy Festival, and the 2016 New Faces un-repped category at the Just For Laughs Festival.</p>\n",
      "pageUrl": "15767-casey-crawford"
    },
    {
      "id": 16853,
      "events": [],
      "emceeEvents": [],
      "name": "Phoebe Bottoms ",
      "twitter": "phoebebottoms",
      "website": "http://phoebebottoms.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/phoebe_.jpg",
      "photoUrl": "/api/img/performer-images/performer-phoebebottoms-300x300.jpg",
      "sortOrder": 30,
      "excludeFromList": false,
      "bio": "<p>Phoebe Bottoms is an Los Angeles based comedian, writer and Jim Henson Company trained puppeteer.  Since 2007 she has performed in clubs, basements, bars and VFW&#039;s all over the great country of ours.  Once described as, &quot;A fun thing that happened&quot; by one of the 453 citizens of Glenburn, North Dakota, her credits also include: Akumal Comedy Festival, Jewish Humor Festival and 10k Laughs Festival.  She is a two time winner  of Competitive Erotic Fan Fiction and has appeared on MTV, Adult Swim, TBS, Loot Crate and JASH.  Phoebe also produces and hosts The Comedy Palace in Los Feliz, which was recently named by Thrillist as one of the 10 Best Underground Comedy Shows in LA.</p>\n",
      "pageUrl": "16853-phoebe-bottoms-"
    },
    {
      "id": 16572,
      "events": [],
      "emceeEvents": [],
      "name": "Dan Harmon",
      "twitter": "danharmon",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/harmonapprovedphoto_04062016103330_large.jpg",
      "photoUrl": "/api/img/performer-images/performer-danharmon-300x300.jpg",
      "sortOrder": 31,
      "excludeFromList": false,
      "bio": "<p>Dan Harmon is the Emmy® winning creator/executive producer of the comedy series <em><strong>Community </strong></em>as well as the co-creator/executive producer of Adult Swim’s<em><strong> Rick &amp; Morty</strong></em>.<br />\nHarmon co-founded Channel 101, an untelevised non-profit audience-controlled network for undiscovered filmmakers, many of whom used it to launch mainstream careers, including the boys behind SNL’s Digital Shorts. Harmon, also partnered with Sarah Silverman to create her Comedy Central series, <em><strong>The Sarah Silverman Program</strong></em>, where he served as head writer for the first season.<br />\nHarmon went on to create, write and perform in the short-lived VH1 sketch series <em><strong>Acceptable TV</strong></em> before eventually creating the critically acclaimed and fan favorite comedy <em><strong>Community</strong></em>. The show originally aired on NBC for five seasons before being acquired by Yahoo which premiered season six of the show in March of 2015. In 2009 he won an Emmy for Outstanding Music and Lyrics for the opening number of the 81st Annual Academy Awards.</p>\n<p>In 2014 Harmon was the star of the documentary <em><strong>Harmontown </strong></em>which chronicled his 20-city stand-up / podcast tour of the same name. The film premiered at the SXSW Film Festival and was released theatrically in October of 2014.</p>\n<p>Through his production company Starburns, Harmon served as executive producer for the critically acclaimed animated feature film “Anomalisa”. After winning the Grand Jury Prize at the 2015 Venice Film Festival, the film was distributed by Paramount Pictures. “Anomalisa” has garnered numerous nominations and awards including an Oscar nomination for Animated Feature Film. Harmon most recently can be found hosting and executive producing <strong><em>History’s Great Minds</em></strong>. Harmon has an extensive upcoming slate including Seeso’s “HarmonQuest,” a fantasy comedy adventure series that melds live action comedians, a live studio audience, and animated sequences.</p>\n",
      "pageUrl": "16572-dan-harmon"
    },
    {
      "id": 16574,
      "events": [],
      "emceeEvents": [],
      "name": "Shane Torres",
      "twitter": "SyrupMountain",
      "website": "http://www.shaneisacomedian.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/shane_torres.jpg",
      "photoUrl": "/api/img/performer-images/performer-shanetorres-300x300.jpg",
      "sortOrder": 32,
      "excludeFromList": false,
      "bio": "<p>Shane Torres is a New York based standup comedian, writer, and actor originally from Fort Worth, TX.  Having made his late night debut on Conan just this year, you may have also seen him on Last Comic Standing or on IFC’s Comedy Bang Bang. He was featured at the Montreal Just For Laugh’s festival as a New Faces in 2013 and was one of Comedy Central’s Comics to Watch in 2012.</p>\n<p> </p>\n<p>Shane has performed at many festivals all over the country including Bridgetown Comedy Festival, Bumbershoot Music and Arts Festival, and many more. Shane has appeared on popular podcast such as Savage Love and Comedy Bang Bang. He tours across the globe at comedy clubs, rock venues, and theaters.</p>\n<p> </p>\n<p>Shane has appeared on popular podcast such as Savage Love and Comedy Bang Bang. He tours across the globe at comedy clubs, rock venues, and theaters. He is the creator of the podcast radio show Help Wanted . Shane has also contributed writing to Paste </p>\n<p>Magazine, Laughspin, The Portland Mercury, and Nailed Magazine.</p>\n",
      "pageUrl": "16574-shane-torres"
    },
    {
      "id": 16571,
      "events": [],
      "emceeEvents": [],
      "name": "Brent Weinbach",
      "twitter": "BrentWeinbach",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/brentweinbachheadshot_06302016050128_large.jpg",
      "photoUrl": "/api/img/performer-images/performer-brentweinbach-300x300.jpg",
      "sortOrder": 33,
      "excludeFromList": false,
      "bio": "<p>Brent Weinbach's stand-up comedy is weird and visual and post-modern and random and other stuff.  He also has a t-shirt with his name and his face on it.</p>\n<p>Brent is a winner and recipient of the Andy Kaufman Award, which is given out once a year to recognize innovation in stand-up comedy.  He is also responsible for various internet video sensations such as <em>Gangster Party Line</em> and <em>Early Facebook Commercial</em>, as well as the cult web series,<em> Pound House</em>.  Brent has appeared on <em>Conan</em>, <em>Lopez Tonight, Comedy Bang Bang, @midnight, Meltdown, The Middle, Eric Andre Show, Kroll Show</em>, and <em>Adventure Time</em>.</p>\n",
      "pageUrl": "16571-brent-weinbach"
    },
    {
      "id": 16589,
      "events": [],
      "emceeEvents": [],
      "name": "Mike Lawrence",
      "twitter": "TheMikeLawrence",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/mikelawrenceheadshotnormal_08042016091910_large.jpg",
      "photoUrl": "/api/img/performer-images/performer-mikelawrence-300x300.jpg",
      "sortOrder": 34,
      "excludeFromList": false,
      "bio": "<p>Mike Lawrence is a New York City based comedian from South Florida who has found success in both writing and stand up. He is a staff writer on Comedy Central’s <strong>Inside Amy Schumer</strong>, A&amp;E’s <strong>Black and White</strong>, and has written for TV Land’s<strong> The Jim Gaffigan Show</strong>, and Hulu’s<strong> Triumph 2016 Election Special</strong>, the 2015 <strong>MTV Movie Awards</strong>, the 2015 <strong>Webby Awards</strong>, and <strong>We Have Issues</strong> on E! Mike was recently nominated for two <strong>Emmy’s</strong> for being of the staff of <strong>Inside Amy Schumer</strong> and the <strong>Triumph 2016 Election Special</strong>, and won the inaugural Comedy Central special <strong>Roast Battle</strong> tournament, recorded live at the 2016 Just For Laughs Festival in Montreal.</p>\n<p>Mike is host of the Comedy Central Snapchat series <strong>You’re Wrong</strong> and is a recurring guest on the Comedy Central TV show <strong>@midnight.</strong> His stand-up has been featured on NBC’s <strong>Late Night with Seth Meyers</strong>, TBS’ <strong>Conan</strong>, FX’s <strong>Totally Biased</strong>, SyFy’s <strong>The Will Wheaton Project</strong>, and John Oliver’s <strong>New York Stand-Up Show</strong> on Comedy Central. In 2013 His half hour special for Comedy Central aired in conjunction with the release of his album “Sadamantium”, produced by Comedy Central Records.</p>\n<p>Additionally, Mike co-hosts the podcast <strong>Nerd of Mouth</strong> on Cave Comedy Radio and has appeared on countless others such as <strong>WTF with Marc Maron</strong>, Robert Kelly’s <strong>You Know What Dude</strong>, <strong>You Made It Weird with Pete Holmes</strong>, <strong>Who Charted</strong>, <strong>The Dana Gould Hour</strong>, <strong>The Adam Corolla Show</strong>, and <strong>The Artie Lange Show</strong>.</p>\n",
      "pageUrl": "16589-mike-lawrence"
    },
    {
      "id": 16521,
      "events": [],
      "emceeEvents": [],
      "name": "Bri Pruett",
      "twitter": "bripruett",
      "website": "http://bripruett.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/14633485_1217134591684653_2842367725205405589_o_0.jpg",
      "photoUrl": "/api/img/performer-images/performer-bripruett-300x300.jpg",
      "sortOrder": 35,
      "excludeFromList": false,
      "bio": "<p>This Portland original just wrapped a run of her comedic solo show Stellar, which the Willamette Week called &quot;Body-positive, pro-self-love, and pro-female sexuality...&quot;</p>\n<p>In addition to clubs and festivals, she&#039;s brought her sparkle to Doug Loves Movies, NPR&#039;s Live Wire!, and Comedy Central&#039;s Roast Battle.</p>\n<p>Someone once described her as a female Jack Black, she took it as a compliment.</p>\n",
      "pageUrl": "16521-bri-pruett"
    },
    {
      "id": 15971,
      "events": [],
      "emceeEvents": [],
      "name": "Robert Jenkins",
      "twitter": "RobJComedy",
      "website": "http://Robjcomedy.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/img_5346.jpg",
      "photoUrl": "/api/img/performer-images/performer-robertjenkins-300x300.jpg",
      "sortOrder": 36,
      "excludeFromList": false,
      "bio": "<p>Rob Jenkins uses his unique point of view, quick wit, and disarming delivery to tell you why he&#039;s right. You&#039;ll disagree, but you&#039;ll laugh anyway.</p>\n<p>A Detroit native, Rob has performed at many festivals including the Oddball Comedy &amp; Curiousity Festival, Crossroads Comedy Festival, and Laughfest where he was a 2016 participant in the Best of the Midwest Comedy Competition. Rob has appeared on the Fox Stand-Up Comedy Show “Laughs” and appeared in Dave Landau’s Detroit-based comedy “The King.” Rob has opened for Hannibal Buress, Kyle Kinane, Matt Broussard, Alonzo Bodden, Red Grant, and many others. In 2015, Rob released his first comedy CD &quot;Achievement Unlocked&quot; - it&#039;s available on iTunes, Amazon, xBox Music, and many other places.</p>\n",
      "pageUrl": "15971-robert-jenkins"
    },
    {
      "id": 16519,
      "events": [],
      "emceeEvents": [],
      "name": "Tom Thakkar",
      "twitter": "tomathakkar",
      "website": "http://tomthakkar.tumblr.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/9171_10106863273157439_7810243713824647968_n.jpg",
      "photoUrl": "/api/img/performer-images/performer-tomthakkar-300x300.jpg",
      "sortOrder": 37,
      "excludeFromList": false,
      "bio": "<p>Tom Thakkar (formerly Thomas Brady) is a comic living in Brooklyn by way of Bloomington, IN and Chicago. He is the son of a great, Red Lobster-managing mom and a deadbeat Indian dad, giving him the odd childhood experience of being a poor, pudgy Indian boy southern Indiana. In 2015, Tom was named a “New Face” by the Just for Laughs comedy festival in Montreal, as well as one of the “Best of the Midwest” by Gilda’s Laugh Fest. Ole Tom Thakkar has also been a featured performer at Limestone Comedy Festival, Chicago Comedy Exposition, Crom Fest Omaha, and more. Tom has been featured on Doug Loves Movies, VICE, NPR, The Todd Glass Show, PBS, and was named a &quot;Comedian you should know&quot; by Chicago Magazine. You can see Tom all over New York, opening for Nikki Glaser all over the country, or standing outside of a Chipotle trying to decide if he&#039;s earned it that day.</p>\n",
      "pageUrl": "16519-tom-thakkar"
    },
    {
      "id": 15859,
      "events": [],
      "emceeEvents": [],
      "name": "Kirsten Kuppenbender",
      "twitter": "kupptastic",
      "website": "http://www.kirstenkuppenbender.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/dsc_1378.jpg",
      "photoUrl": "/api/img/performer-images/performer-kirstenkuppenbender-300x300.jpg",
      "sortOrder": 38,
      "excludeFromList": false,
      "bio": "<p>Kirsten Kuppenbender is a Power House with a heart made of precious metal. She&#039;s a comedian, she&#039;s an actor and she is the visionary of a comedic revolution. In addition to her brilliant stand up and hosting skills, she is The Founder and Producer of Lez Stand Up: a Portland-based, all-queer, feminist comedy collective and showcase which performs up and down the West Coast.<br />\nYou may have seen her in Mercury&#039;s Undisputable Geniuses of Comedy showcase - 2016, Funny Women Festival LA - 2015, All Jane Festival 2015 &amp; 2013</p>\n",
      "pageUrl": "15859-kirsten-kuppenbender"
    },
    {
      "id": 16508,
      "events": [],
      "emceeEvents": [],
      "name": "Andrew Orolfo",
      "twitter": "Andrew_orolfo",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/fullsizerender_0.jpg",
      "photoUrl": "/api/img/performer-images/performer-andreworolfo-300x300.jpg",
      "sortOrder": 39,
      "excludeFromList": false,
      "bio": "<p>History tells us that Andrew Orolfo was never born, but created. In some cultures, their stories suggest he emerged from the magma of an active volcano, unaffected by it&#039;s immense temperatures. His only purpose to wander the world and document his explorations. After an expedition that lasted for decades he became lost, with no one to share his discoveries. But then he found himself. In a place called the Bay Area. Where he was introduced to Stand-Up comedy. Now he is able to reveal his tales, of what he was and what he has yet to become.</p>\n",
      "pageUrl": "16508-andrew-orolfo"
    },
    {
      "id": 16549,
      "events": [],
      "emceeEvents": [],
      "name": "Jason Goad",
      "twitter": "jjgoad",
      "website": "http://www.jjgoad.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/10491239_10204184552756621_6137886026090611465_n.jpg",
      "photoUrl": "/api/img/performer-images/performer-jasongoad-300x300.jpg",
      "sortOrder": 40,
      "excludeFromList": false,
      "bio": "<p>Jason Goad wanted a job working the fewest hours in the day, the fewest days of the week, and didn’t require getting up early. Jason found comedy later in life after attempts at being a novelist, short-story writer, and slam poet. He has squandered multiple thousands of dot com stock-option dollars and quit a career in the culinary arts twice.</p>\n<p>Comedy is the only thing Jason hasn’t had an overwhelming desire to quit. Described as “the Scared Straight of Seattle comedy,” or “if a Lou Reed song was funny,” Jason’s comedy comes from society’s grimy corners. Making frank jokes about terrible things, Jason has been featured at the Redwood Comedy Festival, the Bumbershoot Music and Arts Festival, the 36th Annual Seattle International Comedy Competition, and has written jokes for Brian Posehn.</p>\n<p>Jason lives in Seattle, Washington.</p>\n",
      "pageUrl": "16549-jason-goad"
    },
    {
      "id": 16593,
      "events": [],
      "emceeEvents": [],
      "name": "Tony Hinchcliffe",
      "twitter": "TonyHinchcliffe",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot3_04192016101338_large.jpg",
      "photoUrl": "/api/img/performer-images/performer-tonyhinchcliffe-300x300.jpg",
      "sortOrder": 41,
      "excludeFromList": false,
      "bio": "<p>A stand-up comedian considered a fresh new evolution to the now immensely popular roasting scene, Tony Hinchcliffe has worked as a staff-writer on the past five <em><strong>Comedy Central Roasts</strong></em>, including the most recent, Justin Bieber Roast, where he worked exclusively with Martha Stewart. He is also writing for the upcoming Roast of Rob Lowe. Tony hosts his own weekly show and podcast, “<em><strong>Kill Tony</strong></em>,” which has over 100k downloads per week. On the road he sells out with strong drawing power due to his podcast, being a regular on <em><strong>The Joe Rogan Experience</strong></em>, and years of opening theaters on tours with Jeffrey Ross, Joe Rogan, Dave Attell, and most recently Dave Chappelle. Here are some more of Tony's accomplishments just from 2015...NBC NYE writer, Will Ferrell one-hour special writer, <strong><em>Roast of Justin Bieber</em> writer</strong>, 311 tour opener, <em>On <strong>NBC last call w/ Carson Daly</strong></em>, Jeffrey Ross live from Prison (Comedy Central Special) writer, Congressional Correspondents Dinner writer, Dave Chappelle tour opener, and <em>Sleight of Mouth</em> Comedy Central Special writer. Most recently, Tony’s 1-hour special for Netflix, “<em><strong>One-Shot</strong></em>,” released on January 15, 2016. You can also catch Tony's roasting skills on Comedy Central's <strong>Roast Battle</strong> which took stage at the <strong>Just For Laughs</strong> Festival in Montreal this past July, 2016, as well as his stand-out performance on <strong>The Roast of Snoop Dogg.</strong></p>\n",
      "pageUrl": "16593-tony-hinchcliffe"
    },
    {
      "id": 16821,
      "events": [],
      "emceeEvents": [],
      "name": "George Civeris",
      "twitter": "georgeciveris",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/georgec.jpg",
      "photoUrl": "/api/img/performer-images/performer-georgeciveris-300x300.jpg",
      "sortOrder": 42,
      "excludeFromList": false,
      "bio": "<p>George Civeris is a Boston-based writer and comedian who performs all over New England and New York. Most recently, he won MoveOn.org&#039;s nationwide &quot;Laughter Trumps Hate&quot; contest, which was judged by a panel that included Judd Apatow, Adam McKay, and Baratunde Thurston (<a href=\"http://www.laughtertrumpshate.com/winners\">http://www.laughtertrumpshate.com/winners</a>). Last year, he performed at the Boston Comedy Festival, and in March 2017 he will be the comic-in-residence at Boston&#039;s famous Comedy Studio. He co-produces an award-winning weekly alternative comedy showcase called The Mendoza Line. As a gay immigrant, George is feeling pretty chill about the future.</p>\n",
      "pageUrl": "16821-george-civeris"
    },
    {
      "id": 16818,
      "events": [],
      "emceeEvents": [],
      "name": "Forrest Shaw",
      "twitter": "forrestshaw",
      "website": "http://forrestshaw.net",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/forrestshaw_beard_small.jpg",
      "photoUrl": "/api/img/performer-images/performer-forrestshaw-300x300.jpg",
      "sortOrder": 43,
      "excludeFromList": false,
      "bio": "<p>Forrest Shaw made his television debut on Conan and appeared on Gotham Comedy LIVE on AXS TV in early 2015. He has performed in numerous festivals such as, Comedy Central’s South Beach Comedy Festival, Boston Comedy Festival, Big Sky Comedy Festival, New York Underground Comedy Festival, World Series of Comedy, &amp; the Comedy Central Open Mic Fight and was awarded 2013’s Ultimate Miami Comedian. Forrest is featured in season 2 of the FXX show Legit and has also appeared on Animal Planet.  Forrest is a co-writer (and lead actor) of the award winning web series (live action and animated) Labor Days (labordays.tv). He is co-creator of the weekly What’s What Podcast (whatswhatpod.com). He can also be heard on Sirius/XM Satellite radio, Pandora, and Spotify. His debut album ‘Mister Grizzly’ was released on November 18, 2014 on Comedy Records.</p>\n",
      "pageUrl": "16818-forrest-shaw"
    },
    {
      "id": 16199,
      "events": [],
      "emceeEvents": [],
      "name": "Mekki Leeper",
      "twitter": "MekkiLeeper",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot_-_mekki_leeper.jpg",
      "photoUrl": "/api/img/performer-images/performer-mekkileeper-300x300.jpg",
      "sortOrder": 44,
      "excludeFromList": false,
      "bio": "<p>Mekki Leeper is a comedian based out of Philadelphia. He performs regularly at Good Good Comedy Theater, Helium Comedy Club, and has quickly become a staple in the Philadelphia comedy scene. He also produces shows like Focus Group, Trending Topics, Digital Graffiti, and JUST RIGHT. His work has been featured on NPR, Huffington Post, and College Humor.</p>\n",
      "pageUrl": "16199-mekki-leeper"
    },
    {
      "id": 16108,
      "events": [],
      "emceeEvents": [],
      "name": "Dash Kwiatkowski",
      "twitter": "thetrollverine",
      "website": "http://www.dashcomedy.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot1.jpg",
      "photoUrl": "/api/img/performer-images/performer-dashkwiatkowski-300x300.jpg",
      "sortOrder": 45,
      "excludeFromList": false,
      "bio": "<p>Dash Kwiatkowski is a chubby nerd. He&#039;s into comic books and jokes.</p>\n<p>He is currently the longest reigning Intercontinental Comedy Champion.</p>\n<p>Dash features at The Comedy Attic, Comedy on State, Dr. Grins, The Seattle Comedy Underground, and he is a regular at the SF Punch Line, The Sacramento Punch Line, and Cobbs comedy club. He&#039;s been featured in Sketchfest, Limestone, Laugh Your Asheville Off, Crom Omaha, and The Arch City Comedy Festival, as well as SF Comedy Day and the SF International Competition. He&#039;s the star of popular web series, Neighborhood Watchmen. </p>\n<p>He&#039;s really into Dim Sum. He has dope sideburns, but it&#039;s not a Wolverine thing, so be cool about it.</p>\n",
      "pageUrl": "16108-dash-kwiatkowski"
    },
    {
      "id": 16689,
      "events": [],
      "emceeEvents": [],
      "name": "Cody Hustak",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/cody_hustak.jpg",
      "photoUrl": "/api/img/performer-images/performer-codyhustak-300x300.jpg",
      "sortOrder": 46,
      "excludeFromList": false,
      "bio": "<p>First stepping on stage in Omaha, NE and later relocating to Austin, TX in 2010, Cody quickly became a favorite all over Texas and has since been featured at such festivals as the Montreal JFL Festival, Moontower Comedy Festival, SXSW, and Fun Fun Fun Fest. A finalist in the 2010, '11, '12, '13, and winner of the 2014 Funniest Person In Austin Contest, Cody has been described as offering thoughtful, methodic, absurdity complimented by a unique delivery and timing. These certainly aren't the bird, poop, and dick jokes your parents grew up knowing and loving.</p>\n",
      "pageUrl": "16689-cody-hustak"
    }
  ]
}