{
  "performers": [
    {
      "id": 11823,
      "events": [],
      "emceeEvents": [],
      "name": "Shain Brenden",
      "twitter": "shainbrenden",
      "website": "http://www.shainbrenden.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/shain.jpg",
      "photoUrl": "/api/img/performer-images/performer-shainbrenden-300x300.jpg",
      "sortOrder": 696,
      "bio": "<p>Shain Brenden is a comedian, writer, and full-time handsome person based in Los Angeles, California. He began his comedy career Christmas Day on a small military outpost in Afghanistan making his buddies laugh during a &quot;talent show&quot; for the troops (Shain included...he was a troop). He traded in his uniform and health care benefits for open mics and free chicken tenders and only regrets it sometimes when it’s late and he can’t sleep. His comedy reads like a page out of his private journal, taking stories of his family, failed relationships, and fleeting youth to deliver them with wit, charm and lots of lying. He&#039;s a good boy that tries his best everyday.</p>\n",
      "pageUrl": "11823-shain-brenden"
    },
    {
      "id": 11189,
      "events": [],
      "emceeEvents": [],
      "name": "Dino Archie",
      "twitter": "DinoArchie",
      "website": "http://www.dinoarchie.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/screen_shot_2015-11-19_at_12.31.07_pm.png",
      "photoUrl": "/api/img/performer-images/performer-dinoarchie-300x300.jpg",
      "sortOrder": 27,
      "bio": "<p>I&#039;m not doing that 3rd person tense as if someone else wrote this.  I started out writing and acting but I always wanted to be funny. I love stand up.  I like to make it feel like we&#039;re in a bar or living room where you can talk shit about anything and make it funny.  I split my time between Vancouver and LA.  Most recently won 1st place in the 2015 Seattle International Comedy Competition. Stand up TV debut, coming soon on Comedy Central’s “Adam Devine’s House Party.”  I have opened up for Hannibal Burress, Reggie Watts and toured with Chris D&#039;elia on the “Under No Influence Tour.”  Produced my first comedy album Choosy Lover. Check out <a href=\"http://www.dinoarchie.com\">www.dinoarchie.com</a> for dates. </p>\n<p>facebook.com/DinoArchieComedy<br />\n<a href=\"https://www.youtube.com/dinoarchie\">https://www.youtube.com/dinoarchie</a><br />\nDino’s debut CD “Choosy Lover” available to stream at <a href=\"http://www.dinoarchie.com\">www.dinoarchie.com</a> </p>\n<p>REVIEWS:<br />\n<a href=\"http://www.straight.com/arts/388196/las-dino-archie-works-his-laughs-vancouver\">http://www.straight.com/arts/388196/las-dino-archie-works-his-laughs-van...</a><br />\n<a href=\"http://beatroute.ca/2014/12/15/is-this-a-joke-comics-camaraderie-at-the-electric-owl/\">http://beatroute.ca/2014/12/15/is-this-a-joke-comics-camaraderie-at-the-...</a><br />\n<a href=\"http://www.straight.com/arts/760251/dino-archie-comedy-mix\">http://www.straight.com/arts/760251/dino-archie-comedy-mix</a></p>\n",
      "pageUrl": "11189-dino-archie"
    },
    {
      "id": 11203,
      "events": [],
      "emceeEvents": [],
      "name": "David Zoe Leon",
      "twitter": "DavidZoeLeon",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/newheadshot.jpg",
      "photoUrl": "/api/img/performer-images/performer-davidzoeleon-300x300.jpg",
      "sortOrder": 42,
      "bio": "<p>David Zoe Leon began his comedy career in Madison, WI and is currently living in Chicago, IL. David has shared the stage with many talented performers such as Emo Phillips, Bobcat Goldthwait, and T.J. Miller. David Leon&#039;s style of comedy, best described by the Onion A.V. club, &quot;plays on the yearning sentimentalist and inner-creep&quot; with a &quot;kid-on-sugar-high stage presence.&quot; David has performed at comedy clubs all over the country as well as festivals such as Bumbershoot Music &amp; Arts festival, Bridgetown Comedy Festival, the Chicago Comedy Exposition and the world&#039;s biggest bratwurst festival Brat Fest in Madison,WI. With a demented persona and unpredictable topics, David Leon puts on a show that demands intensity and imagination from his audience, all while having a smile on his face and a mustache on his heart.</p>\n<p>&quot;David Zoe Leon is my new favorite person.&quot;- Portland Mercury</p>\n",
      "pageUrl": "11203-david-zoe-leon"
    },
    {
      "id": 11226,
      "events": [],
      "emceeEvents": [],
      "name": "Carlos L Delgado",
      "twitter": "imcarlosdelgado",
      "website": "http://imcarlosdelgado.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/1149283_239563119556635_2073499450_o.jpg",
      "photoUrl": "/api/img/performer-images/performer-carlosldelgado-300x300.jpg",
      "sortOrder": 63,
      "bio": "<p>Carlos Delgado is a D.C based writer/performer/comedian who won the 2015 Totino’s + Nerdist Favorited Comedian contest. He&#039;s appeared on the &quot;Nerdist Stand Up Cluster 2015&quot; and opened for Chris Hardwick at San Diego Comic Con 2015. He is currently a writer and featured correspondent for the political satire TV show &quot;Redacted Tonight.&quot; He regularly performs back home in New York City and at clubs all over the country. He is also the co-host/co-producer of the weekly stand-up show &quot;Slow Dance Comedy,&quot; which was featured in the New York Times.</p>\n",
      "pageUrl": "11226-carlos-l-delgado"
    },
    {
      "id": 11230,
      "events": [],
      "emceeEvents": [],
      "name": "Atsuko Okatsuka",
      "twitter": "atsysays",
      "website": "http://www.atsukookatsuka.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot_1.jpg",
      "photoUrl": "/api/img/performer-images/performer-atsukookatsuka-300x300.jpg",
      "sortOrder": 67,
      "bio": "<p>Atsuko Okatsuka is a stand up comedian and filmmaker residing in Los Angeles.  She is the co-founder of Dis/orient/ed Comedy, the first ever all Asian, mostly female National stand up comedy tour.  She has opened for Margaret Cho at The Wiltern, performs on Anna Akana Presents: Show and Tell at the various Improv Comedy Clubs in Los Angeles, and has performed overseas in Singapore and Tokyo.  You can see her on MOCATV&#039;s web series Ambiance Man where she co-stars alongside Jack Black and Fred Armisen and in award winning independent features such as Littlerock, Pearblossom Hwy, and Lake Los Angeles, available to watch on iTunes, Amazon, and Netflix.</p>\n",
      "pageUrl": "11230-atsuko-okatsuka"
    },
    {
      "id": 11238,
      "events": [],
      "emceeEvents": [],
      "name": "Adrienne Airhart",
      "twitter": "craydrienne",
      "website": "http://www.craydrienne.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/adrienneairhartheadshot.jpg",
      "photoUrl": "/api/img/performer-images/performer-adrienneairhart-300x300.jpg",
      "sortOrder": 75,
      "bio": "<p>Adrienne is a former professional dancer turned stand up comedian, getting her start in the south Florida comedy scene before moving to Los Angeles in 2012. Full of darkness and angst, her stories are personal and vulnerable with a tendency to throw a left turn at the audience. Adrienne once opened for Patton Oswalt who described her as &quot;Hilarious...and disturbing&quot;; the two things she desires to be the most. Since she&#039;s UCB trained with a lifetime of musical theatre under her belt improv and sketch made perfect sense to dive into—you can watch Adrienne&#039;s web series &quot;Two Inches Apart&quot; on YouTube and see what it&#039;s like to be an angry young woman in the city.</p>\n",
      "pageUrl": "11238-adrienne-airhart"
    },
    {
      "id": 11245,
      "events": [],
      "emceeEvents": [],
      "name": "Martha Kelly",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/ugh_headshot.jpg",
      "photoUrl": "/api/img/performer-images/performer-marthakelly-300x300.jpg",
      "sortOrder": 82,
      "bio": "<p>Martha Kelly is an Austin-based comedian who has appeared on Late Night with Conan O'Brien, the Late Late Show with Craig Ferguson, and Comedy Central. She has performed at the Montreal Just for Laughs Festival, the Chicago Comedy Festival, and the Latino Laugh Festival. She plays Martha Brooks on the FX series \"Baskets.\"</p>\n",
      "pageUrl": "11245-martha-kelly"
    },
    {
      "id": 11245,
      "events": [],
      "emceeEvents": [],
      "name": "Martha Kelly",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/ugh_headshot.jpg",
      "photoUrl": "/api/img/performer-images/performer-marthakelly-300x300.jpg",
      "sortOrder": 83,
      "bio": "<p>Martha Kelly is an Austin-based comedian who has appeared on Late Night with Conan O'Brien, the Late Late Show with Craig Ferguson, and Comedy Central. She has performed at the Montreal Just for Laughs Festival, the Chicago Comedy Festival, and the Latino Laugh Festival. She plays Martha Brooks on the FX series \"Baskets.\"</p>\n",
      "pageUrl": "11245-martha-kelly"
    },
    {
      "id": 11320,
      "events": [],
      "emceeEvents": [],
      "name": "Sammy Arechar",
      "twitter": "sammyarechar",
      "website": "http://www.sammyarechar.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/image_2.jpeg",
      "photoUrl": "/api/img/performer-images/performer-sammyarechar-300x300.jpg",
      "sortOrder": 183,
      "bio": "<p>Born and raised in Wisconsin, Sammy Arechar is a bad boy. His sense of humor and his stage presence that is often described as &quot;personified chicken salad&quot; has landed him gigs opening for nationally touring comedians such as T.J. Miller, Matt Braunger, Garfunkel and Oates, Johnny Pemberton, Josh Fadem, Moshe Kasher, and Ari Shaffir, along with festivals such as the Milwaukee Comedy Festival, the 2014 Comedy Exposition of Chicago, Riot LA, and the Limestone Comedy Festival. His hobbies, along with telling jokes on stage, are looking handsome, seeing what&#039;s on TV, and seeing what&#039;s in the fridge.</p>\n",
      "pageUrl": "11320-sammy-arechar"
    },
    {
      "id": 11380,
      "events": [],
      "emceeEvents": [],
      "name": "Ella Gale",
      "twitter": "hellakale",
      "website": "http://ellagalecomedy.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/ella_gale.jpg",
      "photoUrl": "/api/img/performer-images/performer-ellagale-300x300.jpg",
      "sortOrder": 238,
      "bio": "<p>Ella thinks the best comedy is like an open house in another person’s brain, and she would like to invite you into hers. In May 2015 she took 3rd in the Funniest Person in Austin competition. Described by the Austin Chronicle as “exceedingly clever”, her jokes run the gamut from honest to absurd. She has performed at the Orlando Indie Comedy Festival, Hell Yes Fest, and the She Devil Comedy Festival. She co-hosts Naughty Bits, a sold-out Austin show where she gives comedians sex advice based on their jokes, and she writes and performs sketch with the eclectic, talented weirdos of Comedy Bazaar.</p>\n",
      "pageUrl": "11380-ella-gale"
    },
    {
      "id": 11402,
      "events": [],
      "emceeEvents": [],
      "name": "Sabrina Jalees",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/sabrina_jalees.jpg",
      "photoUrl": "/api/img/performer-images/performer-sabrinajalees-300x300.jpg",
      "sortOrder": 268,
      "bio": "<p>Sabrina is a Canadian Pakistani-Swiss comedian, keynote speaker and writer. She is currently writing on the upcoming NBC show Crowded and just filmed her web-series DTF: Down to Find Out for Comedy Central. She has appeared on Best Week Ever, Last Comic Standing, and Adam Devine’s House Party.</p>\n",
      "pageUrl": "11402-sabrina-jalees"
    },
    {
      "id": 11402,
      "events": [],
      "emceeEvents": [],
      "name": "Sabrina Jalees",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/sabrina_jalees.jpg",
      "photoUrl": "/api/img/performer-images/performer-sabrinajalees-300x300.jpg",
      "sortOrder": 269,
      "bio": "<p>Sabrina is a Canadian Pakistani-Swiss comedian, keynote speaker and writer. She is currently writing on the upcoming NBC show Crowded and just filmed her web-series DTF: Down to Find Out for Comedy Central. She has appeared on Best Week Ever, Last Comic Standing, and Adam Devine’s House Party.</p>\n",
      "pageUrl": "11402-sabrina-jalees"
    },
    {
      "id": 11621,
      "events": [],
      "emceeEvents": [],
      "name": "Eman El-Husseini",
      "twitter": "emanifique",
      "website": "http://www.emantertainment.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/11745820_10153449251220135_5207607550928887301_n_1.jpg",
      "photoUrl": "/api/img/performer-images/performer-emanelhusseini-300x300.jpg",
      "sortOrder": 485,
      "bio": "<p>Since her comedy debut Eman El-Husseini has racked up an impressive list of credits.<br />\nTraveling across Canada, the U.S and the Middle East she covers a wide range of topics,<br />\nfrom how lesbians are the new gentlemen to her parents’ wedding anniversary landing on, you<br />\nguessed it, September 11th.</p>\n<p>She has just launched the *podcast Unheard Of: Sex, Religion and Politics at the Dinner Table. (<a href=\"https://itunes.apple.com/ca/podcast/unheard-of/id1039645794?mt=2\">https://itunes.apple.com/ca/podcast/unheard-of/id1039645794?mt=2</a>) Interviewing a wide range of ordinary people with unconventional lives. Her guests vary from a former Jehovah’s Witness, to people who are transgender and asexual, to a convert to Islam and a porn actor, to name a few.</p>\n<p>Her latest credit; a follow on Twitter by Margaret Cho!</p>\n<p>Festival appearances:</p>\n<p>Amman Standup Comedy Festival(2009)<br />\nJust For Laughs Festival (2010 &amp; 2012)<br />\nJFL42 (2013) SiruisXM Next top Comic Competition<br />\nBoston Comedy Festival (2013)<br />\nCharleston Comedy Festival (2015)<br />\nCBC’s Cracking Up the Capital (2015)</p>\n",
      "pageUrl": "11621-eman-el-husseini"
    },
    {
      "id": 11641,
      "events": [],
      "emceeEvents": [],
      "name": "Stephen Agyei",
      "twitter": "stephenagyei",
      "website": "http://stephenagyei.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/aga_3319_1.jpg",
      "photoUrl": "/api/img/performer-images/performer-stephenagyei-300x300.jpg",
      "sortOrder": 504,
      "bio": "<p>Stephen Agyei &quot;has the whitest teeth in Denver.&quot; One of the city&#039;s most sought after comedians, shines behind a mischievous style industry veteran Lamont Ferguson once memorably described as “calculated fearlessness.” His commanding presence and charming smile translate to instant likability. A Regular at Comedy Works, Stephen has opened for some of the most prominent comedians in the country. Finalist in the 2012 Great American Comedy Festival, winner of the 2012 Comedy Works’ Clean Comedy contest, runner-­up the same year and 3 time finalist in the elite venue’s New Faces contest, the Denver­ based comic has quickly made a name for himself locally. Stephen graduated from the University of Colorado-Boulder with two degrees, and also was a Track and Field athlete at the Division I institution.</p>\n",
      "pageUrl": "11641-stephen-agyei"
    },
    {
      "id": 11645,
      "events": [],
      "emceeEvents": [],
      "name": "Jen D&#039;Angelo",
      "twitter": "jenlikespizza",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/jen_dangelo_headshot_2.jpg",
      "photoUrl": "/api/img/performer-images/performer-jend039angelo-300x300.jpg",
      "sortOrder": 508,
      "bio": "<p>Jen is a comedian from LA! She has appeared on Comedy Dynamic&#039;s &quot;Coming to the Stage&quot; for Hulu and will appear on the third season of Adam Devine&#039;s House Party on Comedy Central. She has also written for Workaholics, Cougar Town, and The Millers. Past festival credits include Just for Laughs Montreal, San Francisco Sketchfest, and the Big Sky International Comedy Competition. She also does a bunch of stuff at the UCB theater in LA. What a world!</p>\n",
      "pageUrl": "11645-jen-dangelo"
    },
    {
      "id": 11654,
      "events": [],
      "emceeEvents": [],
      "name": "Kate Willett ",
      "twitter": "katewillett",
      "website": "http://katewillett.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/kate-willett.jpg",
      "photoUrl": "/api/img/performer-images/performer-katewillett-300x300.jpg",
      "sortOrder": 517,
      "bio": "<p>San Francisco magazine describes Kate Willett as “a comedian you should know about,” so here’s the info: You can catch her Comedy Central debut this winter on &quot;This Is Not Happening.&quot; She’s a regular feature for Margaret Cho who she’s toured with nationally and internationally.  You might have seen her on Fusion TV or heard her on the Risk! podcast with Kevin Allison. She’s appeared in the 2015 Just for Laughs Montreal Comedy Festival, Limestone Comedy Festival, and San Francisco Sketchfest (4 years in a row). </p>\n<p>She was recently named one of the top &quot;Artists to Watch in 2016&quot; by the SF Weekly, has opened for comedians like Kyle Kinane, Jen Kirkman,  Anthony Jeselnik, Dana Gould, Jackie Kashian, Myq Kaplan, and Michael Che, and produces four of the best alternative comedy shows in the city including “The Mission Position” at Lost Weekend Video which CourtingComedy.com calls “the next great tradition in San Francisco Comedy.”</p>\n<p> She’s a regular feature at comedy clubs all over the country and a favorite of audience members, flannel clad skateboarders, and all of her twenty-three roommates.</p>\n",
      "pageUrl": "11654-kate-willett-"
    },
    {
      "id": 11749,
      "events": [],
      "emceeEvents": [],
      "name": "Atif Myers",
      "twitter": "atifmyers",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/bumper.jpg",
      "photoUrl": "/api/img/performer-images/performer-atifmyers-300x300.jpg",
      "sortOrder": 614,
      "bio": "<p>Originally from DC, Atif Myers is a comedian whose style of comedy is as unique as his background.Born to Moroccan and Jamaican parents, Atif fell in love with stand up as a child. He started doing stand up in 2008, and hasn’t looked back. He has made audiences laugh all over the world. He has performed in numerous cities across the world.Such as New York, Los Angeles, and Seoul, South Korea. In 2009 named Maryland’s funniest college student. Atif was also named one of the Rising Stars in the 2013 Arab Comedy Festival. In 2014 Atif was a finalist in the World Series of Comedy and the San Diego Comedy Festival. In 2015 he was named Best of the Fest in the Burbank comedy festival. Atif was a semifinalist in TBS&#039;s funniest college student, and has performed with Whitney Cummings, Tim Meadows, and Judah Friedlander. He is also a regular at the Laugh Factory Comedy Club, and The Icehouse comedy club. Atif also finds it awkward writing about himself in the third person.</p>\n",
      "pageUrl": "11749-atif-myers"
    },
    {
      "id": 11754,
      "events": [],
      "emceeEvents": [],
      "name": "Dave Merheje",
      "twitter": "davemerheje",
      "website": "http://davemerheje.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/169155_10150132220980586_502195585_8453667_6756152_o-1.jpg",
      "photoUrl": "/api/img/performer-images/performer-davemerheje-300x300.jpg",
      "sortOrder": 619,
      "bio": "<p>Winner of Just For Laugh&#039;s 2011 Irwin Barker Homegrown Comic Award and NOW Magazine&#039;s 2011 Best of Toronto Award for Best Male Stand-up in 2011, a Canadian Comedy Award-nominee for Best Stand-up in 2012 and another nomination for NOW Magazine&#039;s Best of Toronto Award in 2013, Dave Merheje is making waves as one of the edgiest comics in the country today. Drawing from his Lebanese-Canadian perspective and personal experiences straight from the streets, Merheje is unfettered by political correctness. His &quot;no fear&quot; approach to comedy has gained a loyal following. Pure raging energy, he is electric, aggressive and in-your-face. Nothing is sacred as he fires off on urban life, Middle Eastern politics, Islamic extremists, working in strip clubs, club culture, drugs and masturbation.</p>\n<p>In 2014 Dave returned to Just For Laughs in Montreal, for his FOURTH appearance. This past year has been full of successes for Merheje. He won the 2013 Canadian On Campus Activities (COCA) Performer of the Year award, has been nominated for NOW Magazine&#039;s Best of Toronto &quot;Best Male Stand-up&quot;, and shot several episodes for the upcoming television series Too Much Informationwhich will air on Super Channel!</p>\n",
      "pageUrl": "11754-dave-merheje"
    },
    {
      "id": 11761,
      "events": [],
      "emceeEvents": [],
      "name": "Jenny Zigrino",
      "twitter": "jennyzisnice",
      "website": "http://jennyzigirno.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/img_20150207_010001.jpg",
      "photoUrl": "/api/img/performer-images/performer-jennyzigrino-300x300.jpg",
      "sortOrder": 625,
      "bio": "<p>With the sweetness of the Midwest and the iron balls of the East Coast, Jenny Zigrino is a comedian that packs a punch of truly original humor. She&#039;s charmed audiences across the country with her wit, keen observations, embarrassing anecdotes, and brilliant honesty for a compelling performance you can&#039;t ignore.  </p>\n<p>She made her late night debut on Conan O&#039;Brien in May of 2015 and was a Comedy Central Comic to Watch of 2013. Since then, she&#039;s starred in then new Marlon Wayan&#039;s film &quot;50 Shades of Black&quot; and can be seen in the highly anticipated movie &quot;Bad Santa 2&quot; in November.  Her TV credits include Adam Divine&#039;s House Party, @Midnight, TBS, Oxygen, and Fox.</p>\n<p>She&#039;s a regular performer at the Women in Comedy Festival and has also performed at the New York Comedy Festival, RIOTLA Comedy Festival, The 9s Music Festival, Great American Comedy Festival, Cape Fear Comedy Festival, Boston Comedy Festival, and many others.</p>\n",
      "pageUrl": "11761-jenny-zigrino"
    },
    {
      "id": 11777,
      "events": [],
      "emceeEvents": [],
      "name": "Emily Galati",
      "twitter": "emilygalati",
      "website": "http://www.macdonaldentertainment.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/emily_galati.jpg",
      "photoUrl": "/api/img/performer-images/performer-emilygalati-300x300.jpg",
      "sortOrder": 641,
      "bio": "<p>Emily Galati<br />\nBiography<br />\nEmily Galati does not dwell on the differences between men and women or other cliche topics you have come to expect from female comics. Instead, she offers up intelligent and hilarious material, with impeccable timing and a wry smile.<br />\nIn 2013, Emily was chosen to represent Chicago in the &quot;Best of the Midwest&quot; Competition at Gilda&#039;s LaughFest. She was a semi-finalist in NBC&#039;s Stand Up for Diversity, and finalist in the “Bob and Tom” Comedy Contest held in Indianapolis.<br />\nEmily performs regularly at the legendary Zanies Comedy Club in Chicago and has traveled the country to work with national acts such as Jeffery Ross, Gilbert Gottfried, Dwayne Perkins, Jimmy Dore, Jeff Richards, Kyle Kinane, and Matt Braunger. You can also catch her on your television set performing on shows like “The Comedy Thrift Store”, “Funny Sundaes” and Comcast On Demand&#039;s “Laugh Out Loud”.<br />\nIn 2014 Emily appeared on NBC’s “Last Comic Standing” and the nationally syndicated “Comic’s Unleashed”.<br />\nEmily was born and raised in Phoenix, Arizona where she enjoyed sunny days and swimming in December. She currently resides in Chicago, Illinois and misses her pool.<br />\nemilygalati.com<br />\nFor Additional Information Please Contact: John MacDonald<br />\nMacDonald Entertainment<br />\n310-625-8334</p>\n",
      "pageUrl": "11777-emily-galati"
    },
    {
      "id": 11189,
      "events": [],
      "emceeEvents": [],
      "name": "Dino Archie",
      "twitter": "DinoArchie",
      "website": "http://www.dinoarchie.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/screen_shot_2015-11-19_at_12.31.07_pm.png",
      "photoUrl": "/api/img/performer-images/performer-dinoarchie-300x300.jpg",
      "sortOrder": 28,
      "bio": "<p>I&#039;m not doing that 3rd person tense as if someone else wrote this.  I started out writing and acting but I always wanted to be funny. I love stand up.  I like to make it feel like we&#039;re in a bar or living room where you can talk shit about anything and make it funny.  I split my time between Vancouver and LA.  Most recently won 1st place in the 2015 Seattle International Comedy Competition. Stand up TV debut, coming soon on Comedy Central’s “Adam Devine’s House Party.”  I have opened up for Hannibal Burress, Reggie Watts and toured with Chris D&#039;elia on the “Under No Influence Tour.”  Produced my first comedy album Choosy Lover. Check out <a href=\"http://www.dinoarchie.com\">www.dinoarchie.com</a> for dates. </p>\n<p>facebook.com/DinoArchieComedy<br />\n<a href=\"https://www.youtube.com/dinoarchie\">https://www.youtube.com/dinoarchie</a><br />\nDino’s debut CD “Choosy Lover” available to stream at <a href=\"http://www.dinoarchie.com\">www.dinoarchie.com</a> </p>\n<p>REVIEWS:<br />\n<a href=\"http://www.straight.com/arts/388196/las-dino-archie-works-his-laughs-vancouver\">http://www.straight.com/arts/388196/las-dino-archie-works-his-laughs-van...</a><br />\n<a href=\"http://beatroute.ca/2014/12/15/is-this-a-joke-comics-camaraderie-at-the-electric-owl/\">http://beatroute.ca/2014/12/15/is-this-a-joke-comics-camaraderie-at-the-...</a><br />\n<a href=\"http://www.straight.com/arts/760251/dino-archie-comedy-mix\">http://www.straight.com/arts/760251/dino-archie-comedy-mix</a></p>\n",
      "pageUrl": "11189-dino-archie"
    },
    {
      "id": 11854,
      "events": [],
      "emceeEvents": [],
      "name": "Janelle James ",
      "twitter": "janellejcomic",
      "website": "http://www.janellejamescomedy.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/janelle-james-b46a4212-11.jpg",
      "photoUrl": "/api/img/performer-images/performer-janellejames-300x300.jpg",
      "sortOrder": 721,
      "bio": "<p>Janelle James is a caribbean born comic who started doing standup in the midwest. Featuring a mix of raunch, family life and morbid thoughts about depression and aging, Janelle has performed all over the country in such places as the Laugh Factory, Gotham, Helium, Broadway and Carolines Comedy Clubs. She has also traveled extensively as the feature act with Hannibal Buress, Todd Barry and Rob Delaney and can be seen on Bravo, Aol, the Vice Network and NBC&#039;s upcoming Night Train with Wyatt Cenac.</p>\n",
      "pageUrl": "11854-janelle-james-"
    },
    {
      "id": 11887,
      "events": [],
      "emceeEvents": [],
      "name": "Mekki Leeper",
      "twitter": "MekkiLeeper",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/photo_0.jpg",
      "photoUrl": "/api/img/performer-images/performer-mekkileeper-300x300.jpg",
      "sortOrder": 751,
      "bio": "<p>Mekki Leeper is a comedian living in Philadelphia. He performs regularly at Helium Comedy Club. He was born to Moroccan parents, and raised in the backwoods of Pennsylvania. He directed and produced Dance Father Dance a 22 episode sketch web series in 2015. Mekki also produces and hosts Trending Topics, a monthly live show in Center City Philadelphia.</p>\n",
      "pageUrl": "11887-mekki-leeper"
    },
    {
      "id": 11929,
      "events": [],
      "emceeEvents": [],
      "name": "Martin Urbano",
      "twitter": "martinurbano",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot_25.jpg",
      "photoUrl": "/api/img/performer-images/performer-martinurbano-300x300.jpg",
      "sortOrder": 791,
      "bio": "<p>Martin Urbano is a stand-up comedian in Austin, TX. He has opened for Chris Kattan.</p>\n",
      "pageUrl": "11929-martin-urbano"
    },
    {
      "id": 11941,
      "events": [],
      "emceeEvents": [],
      "name": "Merrill Davis",
      "twitter": "merrilldavis",
      "website": "http://www.merrilldaviscomedy.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/annielesser.jpg",
      "photoUrl": "/api/img/performer-images/performer-merrilldavis-300x300.jpg",
      "sortOrder": 800,
      "bio": "<p>Merrill’s comedy brings a sense of wisdom, self-effacing charm, and silliness to the stage; much like a nanny who&#039;s just seen &quot;Adventures In Babysitting&quot;, and knows not to emulate the movie&#039;s plot but wants to just for fun.<br />\nShe&#039;s lovable and and enjoys animals at all times. Merrill has been featured in Another Period on Comedy Central, Comedy Dynamics on Hulu, Still Punching The Clown with Henry Phillips, and Image Doctors on Funny or Die. She regularly features for friends Jamie Lee and Debra DiGiovanni at The Irvine Improv, The Hollywood Improv and UCB.  She&#039;s performed all over Los Angeles, New York, San Francisco, Atlanta, and other cities you&#039;ve heard of.  She performs regularly at Upright Citizens Brigade Theater in shows like Fresh Out with Emily Heller and Adam Conover, Crash Test with Paul Scheer and Rob Huebel and other great shows around town.<br />\nAdditionally, she currently co-produces three popular shows in LA, Witch Hunt at The Virgil with Debra DiGiovanni, Rendezvous with Jazz Ponce at The Hollywood Improv Lab, and FUN! with Ashley Hamilton.<br />\nCome see Merrill soon. She would appreciate it. But seriously she would love to see you and would want you to break all your plans even if you don&#039;t have any.</p>\n",
      "pageUrl": "11941-merrill-davis"
    },
    {
      "id": 11953,
      "events": [],
      "emceeEvents": [],
      "name": "Sara Schaefer",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/unspecified.jpg",
      "photoUrl": "/api/img/performer-images/performer-saraschaefer-300x300.jpg",
      "sortOrder": 815,
      "bio": "<p>Sara Schaefer is a critically acclaimed stand up comedian, writer, and producer currently based in Los Angeles. She was recently the co-host of MTV’s late night show Nikki &amp; Sara Live. Sara has appeared on @Midnight, John Oliver’s New York Stand Up Show, Late Night with Jimmy Fallon, Best Week Ever, and Inside Amy Schumer. She won two Emmy awards for her work at Late Night with Jimmy Fallon, and has written for BestWeekEver.tv and Who Wants to Be A Millionaire. Her debut stand up album, Chrysalis, debuted in March 2015. </p>\n<p>Sara’s web series, Day Job, was named on of Time Out New York’s “50 Funniest Web Series.” Her podcast LIES with Sara Schaefer, debuted on WNYC and Nerdist Network in 2014. </p>\n<p>Some of Sara’s accolades include USA Today’s “100 People of the Year in Pop Culture,”Huffington Post’s “Favorite Female Comedians,” and Comedy Central’s Comics to Watch.</p>\n",
      "pageUrl": "11953-sara-schaefer"
    },
    {
      "id": 11953,
      "events": [],
      "emceeEvents": [],
      "name": "Sara Schaefer",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/unspecified.jpg",
      "photoUrl": "/api/img/performer-images/performer-saraschaefer-300x300.jpg",
      "sortOrder": 816,
      "bio": "<p>Sara Schaefer is a critically acclaimed stand up comedian, writer, and producer currently based in Los Angeles. She was recently the co-host of MTV’s late night show Nikki &amp; Sara Live. Sara has appeared on @Midnight, John Oliver’s New York Stand Up Show, Late Night with Jimmy Fallon, Best Week Ever, and Inside Amy Schumer. She won two Emmy awards for her work at Late Night with Jimmy Fallon, and has written for BestWeekEver.tv and Who Wants to Be A Millionaire. Her debut stand up album, Chrysalis, debuted in March 2015. </p>\n<p>Sara’s web series, Day Job, was named on of Time Out New York’s “50 Funniest Web Series.” Her podcast LIES with Sara Schaefer, debuted on WNYC and Nerdist Network in 2014. </p>\n<p>Some of Sara’s accolades include USA Today’s “100 People of the Year in Pop Culture,”Huffington Post’s “Favorite Female Comedians,” and Comedy Central’s Comics to Watch.</p>\n",
      "pageUrl": "11953-sara-schaefer"
    },
    {
      "id": 11964,
      "events": [],
      "emceeEvents": [],
      "name": "Tawanda Gona",
      "twitter": "GuyNamedTawanda",
      "website": "http://www.TawandaGona.Com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/10551449_2688337847669_2937440787900891461_o.jpg",
      "photoUrl": "/api/img/performer-images/performer-tawandagona-300x300.jpg",
      "sortOrder": 827,
      "bio": "<p>My name is Tawanda Gona, I&#039;m 27 and I&#039;ve been a comedian for 7 years. I started in Boston and came up through The Comedy Studio and later Laugh Boston. I was born in Zimbabwe but I moved to America when I was 2 so I&#039;m pretty much Americanized. I&#039;ve lived all over the east coast so I have this real sweet non regional dialect that makes me sound sarcastic or cynical all the time. I think the fact that I smile a lot adds to the confusion but I digress. I love Stand Up comedy.<br />\nI like to think my act is really representative of me, it deals with where I&#039;m from, how I feel, and the person I&#039;d like to be. Boston&#039;s been pretty decent to me however I&#039;ve lately been longing for more, to be completely blunt I&#039;m tired of being seen as a &quot;novelty&quot;. But again, I digress, I love comedy. I put together my own shows because I like to see my peers have fun in an environment I know they&#039;d thrive in. In doing that I&#039;ve learned what bookers look for and how shows should be run, so the experience has helped me dramatically.<br />\nMy goals change as time progresses but right now if I could live like Jerry did on Seinfeld I think I&#039;d be satisfied with my career. A couple of late night spots, passed at some clubs, and able to live entirely off a comics salary. Besides that I just want to get better as a stand up and be around people that make me want to be better as a stand up; pretty straight forward.</p>\n",
      "pageUrl": "11964-tawanda-gona"
    },
    {
      "id": 11975,
      "events": [],
      "emceeEvents": [],
      "name": "Brooks Wheelan",
      "twitter": "brookswheelan",
      "website": "http://brookswheelan.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/brooks008e.jpg",
      "photoUrl": "/api/img/performer-images/performer-brookswheelan-300x300.jpg",
      "sortOrder": 836,
      "bio": "<p>Brooks originally hails from Iowa where he attended the University of Iowa.  Most recently he appeared in season four of HBO’s Girls.  He was a writer and cast member on Season 39 of NBC’s Saturday Night Live.  In 2013, he made his stand up television debut on Comedy Central’s Adam Devine’s House Party and TBS’s Conan, and in 2012, he was invited to perform at the New York Comedy Festival as a part of Comedy Central’s Top 10 Comics to Watch, and was a breakout performer as a new face at the prestigious Just for Laughs Festival in Montreal as well as the Comedy Central South Beach Comedy Festival. Brooks is currently headlining colleges and clubs throughout the US. </p>\n<p>“Wheelan is himself a name to watch, getting great reviews for his sharp and sometimes dark observations of American life.” – London Times</p>\n",
      "pageUrl": "11975-brooks-wheelan"
    },
    {
      "id": 11975,
      "events": [],
      "emceeEvents": [],
      "name": "Brooks Wheelan",
      "twitter": "brookswheelan",
      "website": "http://brookswheelan.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/brooks008e.jpg",
      "photoUrl": "/api/img/performer-images/performer-brookswheelan-300x300.jpg",
      "sortOrder": 837,
      "bio": "<p>Brooks originally hails from Iowa where he attended the University of Iowa.  Most recently he appeared in season four of HBO’s Girls.  He was a writer and cast member on Season 39 of NBC’s Saturday Night Live.  In 2013, he made his stand up television debut on Comedy Central’s Adam Devine’s House Party and TBS’s Conan, and in 2012, he was invited to perform at the New York Comedy Festival as a part of Comedy Central’s Top 10 Comics to Watch, and was a breakout performer as a new face at the prestigious Just for Laughs Festival in Montreal as well as the Comedy Central South Beach Comedy Festival. Brooks is currently headlining colleges and clubs throughout the US. </p>\n<p>“Wheelan is himself a name to watch, getting great reviews for his sharp and sometimes dark observations of American life.” – London Times</p>\n",
      "pageUrl": "11975-brooks-wheelan"
    },
    {
      "id": 12068,
      "events": [],
      "emceeEvents": [],
      "name": "Jesus Trejo",
      "twitter": "JesusTrejo",
      "website": "http://www.JESUSTREJO.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/img_8889.jpg",
      "photoUrl": "/api/img/performer-images/performer-jesustrejo-300x300.jpg",
      "sortOrder": 927,
      "bio": "<p>Based out of Los Angeles, born and raised in Long Beach CA, Jesus has appeared on &quot;Adam Devine&#039;s House Party&quot; on Comedy Central, Season 2 of &quot;Stand- up &amp; Deliver&quot; on NuvoTV , and a recurring cast member on TBS&#039;s sitcom &quot;Sullivan &amp; Son&quot; as Javier. Jesus Trejo was selected  by OC Weekly as one of the &quot;Comics to watch&quot; in 2013, and was also pick to participate at the &quot;Laughing Skull Festival&quot; in Atlanta where he was a among the top 10 finalist in 2014. Last year was a great one for Jesus, where he took part in the prestigious Just for Laughs festival in Montreal Canada, as part of Jeff Ross&#039;s &quot;Roast Master&#039;s Invitational&quot;, and also had the opportunity to open for Louis C.K to a packed house at The Comedy Store in Los Angeles. His animated charm and self-deprecating style, along with his impressions will paint the funny picture of the world he lives in.</p>\n",
      "pageUrl": "12068-jesus-trejo"
    },
    {
      "id": 12094,
      "events": [],
      "emceeEvents": [],
      "name": "Curtis Cook",
      "twitter": "Curtis_Cook",
      "website": "http://www.curtiscookcomedy.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot_32.jpg",
      "photoUrl": "/api/img/performer-images/performer-curtiscook-300x300.jpg",
      "sortOrder": 951,
      "bio": "<p>Curtis Cook is a comic from Cleveland, Ohio now living in Portland, Oregon. He has performed in venues and festivals throughout the country, including Cleveland’s Accidental Comedy Festival, the Chicago Comedy Exposition, and San Francisco’s Sketchfest. </p>\n<p>The Portland Mercury described Curtis’ comedy as “sleepy, slam poetry,” and the Willamette Week lists him as among Portland’s funniest comics. </p>\n<p>In addition to performing stand-up, Curtis has been featured on Daily VICE and appeared on television programs in Kenya, Sierra Leone, and throughout the Middle East. He also co-hosts Earthquake Hurricane, a superlative comedy show every Wednesday night in PDX.</p>\n",
      "pageUrl": "12094-curtis-cook"
    },
    {
      "id": 12121,
      "events": [],
      "emceeEvents": [],
      "name": "Dinah Foley ",
      "twitter": "DinahFoley",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/dinah_foley_head_shot_2.jpg",
      "photoUrl": "/api/img/performer-images/performer-dinahfoley-300x300.jpg",
      "sortOrder": 975,
      "bio": "<p>Dinah Foley is a comedian in Portland, Oregon, noted for her squirrelly feminism and sharp elbows. She has performed on shows at Curious Comedy Theater, The Doug Fir, New Deal Distillery, Helium Comedy Club and has written more than one thing on Reductress and Portland&#039;s late night talk show Late Night Action. Among her credits are SF Sketchfest, opening for Bernie Sanders at the Moda Center, the NW Women’s Comedy Festival, Siren Nation, and .20 cents at the Hoot Loot slot machine at the Indian Head Casino in Warm Springs.</p>\n",
      "pageUrl": "12121-dinah-foley-"
    },
    {
      "id": 12122,
      "events": [],
      "emceeEvents": [],
      "name": "M.K. Paulsen",
      "twitter": "mkpaulsen",
      "website": "http://www.mkpaulsen.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/mk-studio-009-anindoorlady.jpg",
      "photoUrl": "/api/img/performer-images/performer-mkpaulsen-300x300.jpg",
      "sortOrder": 976,
      "bio": "<p>M.K. Paulsen is an award-winning Austin-based comedian where he is a regular at Cap City Comedy Club, The Velveeta Room and independent shows across the city.  He has been featured in The Huffington Post and was a Finalist in The Advocate Magazine’s National Queer Comedy Search “Stand Out”.  In addition to Austin, he has been active in the Washington, D.C. and Berlin, Germany comedy scenes where he gained a global perspective on various styles of comedy. He has appeared on numerous festivals across the country including Fun, Fun, Fun Fest in Austin and Hell Yes Fest in New Orleans, Louisiana.  In lieu of flowers, please consider making a financial contribution directly to him.</p>\n",
      "pageUrl": "12122-mk-paulsen"
    },
    {
      "id": 12131,
      "events": [],
      "emceeEvents": [],
      "name": "Anthony Robinson",
      "twitter": "WockaZulu",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/received_10208365054068812.jpeg",
      "photoUrl": "/api/img/performer-images/performer-anthonyrobinson-300x300.jpg",
      "sortOrder": 985,
      "bio": "<p>Who knew starting comedy at a lesbian owned cafe in Kansas City, Missouri would lead to a career in comedy? Since that fateful day in 2006,  the hallmarks of Anthony Roinson&#039;s sets has always been spontaneous brilliance and well written social commentary. Has opened for the likes of Baron Vaughn, Aamer Rahman, Ty Barnett, and Aparna Nancherla. Has performed at Bumbershoot and the Seattle International Comedy Competition.</p>\n",
      "pageUrl": "12131-anthony-robinson"
    },
    {
      "id": 12133,
      "events": [],
      "emceeEvents": [],
      "name": "Mary Radzinski ",
      "twitter": "maryradzinski",
      "website": "http://maryradzinski.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/radzinski_mary.jpg",
      "photoUrl": "/api/img/performer-images/performer-maryradzinski-300x300.jpg",
      "sortOrder": 986,
      "bio": "<p>Mary is a regular feature at Helium, Goodnights and Cap City comedy clubs.<br />\nMary opened for for Jim Norton&#039;s comedy special taping at the Somerville Theater in January, 2015 as well as Rosie O&#039;Donnell&#039;s most recent HBO comedy special at Levity Live.<br />\nShe was a finalist in the 2015 Boston Comedy Festival and Helium Comedy Club&#039;s 2014 &quot;Philly&#039;s Phunniest&quot; Contest. She was recently named Philadelphia Magazine&#039;s best comedian 2014.<br />\nMary was one of three featured comedians on CBS Channel 3&#039;s &quot;Talk Philly&quot;, and was also featured in Philadelphia Weekly&#039;s cover story, &quot;Funny Females of Philadelphia&quot;.<br />\nShe was a semi-finalist at the 2012 She-Devil Comedy Festival and performed at the 2013 Women in Comedy Festival. Mary also performed at the 2012 and 2013 Laugh Your Asheville Off Comedy Festival.</p>\n",
      "pageUrl": "12133-mary-radzinski-"
    },
    {
      "id": 12289,
      "events": [],
      "emceeEvents": [],
      "name": "Carmen Lagala",
      "twitter": "carmenlagala",
      "website": "http://www.vermontcomedydivas.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/carmen_headshot.jpg",
      "photoUrl": "/api/img/performer-images/performer-carmenlagala-300x300.jpg",
      "sortOrder": 1133,
      "bio": "<p>Carmen Lagala began doing comedy in her hometown in the state of Vermont. She tours with The Vermont Comedy Divas and it&#039;s charitable branch, &quot;Divas Do Good&quot;, which performs to raise money for human-service non-profit organizations. While in Vermont, she placed first in the Higher Ground Comedy Battle, was a finalist in Vermont&#039;s Funniest Contest, performed in Boston&#039;s Women in Comedy Festival, has been a feature performer in the Green Mountain Comedy Festival and has performed several times at the new state-of-the-art Vermont Comedy Club.<br />\nSince moving to New York City in 2014 Carmen has become a rising presence, hosting and headlining for the Devil Cup, She-Devil, and Laughing Devil festivals, and performing at beloved venues such The Creek and the Cave, UCBEast, and the Knitting Factory.<br />\nShe hosts two monthly comedy shows in New York City, &quot;Creek Bros&quot; and &quot;Wigging Out with Carmen.&quot;</p>\n",
      "pageUrl": "12289-carmen-lagala"
    },
    {
      "id": 12302,
      "events": [],
      "emceeEvents": [],
      "name": "Sarah Tollemache",
      "twitter": "stollemache",
      "website": "http://sarahtollemachecomedy.tumblr.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/sarahblue.jpg",
      "photoUrl": "/api/img/performer-images/performer-sarahtollemache-300x300.jpg",
      "sortOrder": 1148,
      "bio": "<p>Sarah Tollemache started her comedy career in middle school by winning Most Humorous in<br />\nher 8th Grade Class. Seven years later decided to take the stage at the local open mic in<br />\nHouston, TX and has been doing comedy ever since. After developing a voice in Houston Sarah<br />\ndecided to move to New York City where she’s been working on her craft ever since and slowly<br />\nbecoming a name on the New York comedy scene. As well as a stand up comic Sarah is a<br />\nsketch writer and has been on several sketch house teams at The Upright Citizens Brigade<br />\nTheater and is on a independent sketch group called Bullshit Women that currently has a run at<br />\nthe theater. Her comedy has been described dry and observational.</p>\n",
      "pageUrl": "12302-sarah-tollemache"
    },
    {
      "id": 12302,
      "events": [],
      "emceeEvents": [],
      "name": "Sarah Tollemache",
      "twitter": "stollemache",
      "website": "http://sarahtollemachecomedy.tumblr.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/sarahblue.jpg",
      "photoUrl": "/api/img/performer-images/performer-sarahtollemache-300x300.jpg",
      "sortOrder": 1149,
      "bio": "<p>Sarah Tollemache started her comedy career in middle school by winning Most Humorous in<br />\nher 8th Grade Class. Seven years later decided to take the stage at the local open mic in<br />\nHouston, TX and has been doing comedy ever since. After developing a voice in Houston Sarah<br />\ndecided to move to New York City where she’s been working on her craft ever since and slowly<br />\nbecoming a name on the New York comedy scene. As well as a stand up comic Sarah is a<br />\nsketch writer and has been on several sketch house teams at The Upright Citizens Brigade<br />\nTheater and is on a independent sketch group called Bullshit Women that currently has a run at<br />\nthe theater. Her comedy has been described dry and observational.</p>\n",
      "pageUrl": "12302-sarah-tollemache"
    },
    {
      "id": 12400,
      "events": [],
      "emceeEvents": [],
      "name": "Naomi Ekperigin",
      "twitter": "Blacktress",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/f7a1xr5u.jpeg",
      "photoUrl": "/api/img/performer-images/performer-naomiekperigin-300x300.jpg",
      "sortOrder": 1247,
      "bio": "<p>Naomi Ekperigin: Naomi is a NY based Stand Up Comedian and writer who is currently a Staff Writer on Comedy Central’s BROAD CITY. Previously Naomi worked on TOTALLY BIASED W/ KAMAU BELL and on the upcoming Sundance Channel show, THE APPROVAL MATRIX.</p>\n",
      "pageUrl": "12400-naomi-ekperigin"
    }
  ]
}