{
  "performers": [
    {
      "id": 16808,
      "events": [
        17156,
        17170,
        17206
      ],
      "emceeEvents": [
        17233
      ],
      "name": "Greg Coleman II",
      "twitter": "SayGCole",
      "website": "https://tinyurl.com/zevcqku",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot_1_3.jpg",
      "photoUrl": "/api/img/performer-images/performer-gregcolemanii-300x300.jpg",
      "sortOrder": 76,
      "excludeFromList": false,
      "bio": "<p>Greg Coleman has been active in the Minnesota comedy scene since 2012. Coleman was voted Best Comic of 2012 at the MN Comedy Awards, was acknowledged as a Top 10 Performer at the ABFF Comedy Competition in Los Angeles, CA, and was named one of the top 5 comics to watch in 2016 by The Growler dot com. Coleman has gained a reputation as a strong performer, with a twisted point of view and fun stories from his many years working in education. On stage, Coleman comes across as cool, confident, and comfortable</p>\n",
      "pageUrl": "16808-greg-coleman-ii"
    },
    {
      "id": 16925,
      "events": [
        17148,
        17182,
        17184,
        17192,
        17260
      ],
      "emceeEvents": [],
      "name": "Janeane Garofalo",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/janeane_garofalo_headshot.jpg",
      "photoUrl": "/api/img/performer-images/performer-janeanegarofalo-300x300.jpg",
      "sortOrder": 1,
      "excludeFromList": false,
      "bio": "<p>Janeane has had many memorable and critically acclaimed roles in film and television since bursting on the scene in 1992. She's appeared in films such as \"The Truth About Cats and Dogs,\" \"Wet Hot American Summer,\" \"Ratatouille\" and \"Reality Bites.\" She was a cast member of the Emmy award winning \"Ben Stiller Show,\" as well as the comedy classic \"The Larry Sanders Show,\" and had recurring roles on \"24\" and \"The West Wing.\" She appeared in Bravo's first scripted series \"Girlfriend's Guide to Divorce\" and can be seen in the Netflix series \"Wet Hot American Summer: First Day of Camp.\" Along with \"Little Boxes,\" Janeane will appear in several feature films in 2016, including \"Blue Angel\" and \"Speech and Debate.\"</p>\n<p>In addition to acting in film and television, Janeane is an outspoken activist and tours the country as a stand-up comedian. She was instrumental in the successful launching of the first liberal radio network, <a href=\"http://airamerica.com/\" target=\"_blank\">Air America Radio</a>, where she hosted her own talk show, \"<a href=\"http://airamerica.com/majorityreport/\" target=\"_blank\">The Majority Report</a>.\" A lightning rod for controversy, Janeane's well-informed opinions and unflinching honesty have inspired laughs as well as striking a chord with the left, right and everyone in between. She is a noted peace activist.</p>\n<p>Notable Roles: Janeane played the role of Paula, the acerbic talent booker, on \"<a href=\"http://www.sonypictures.com/homevideo/thelarrysanderscollection/\" target=\"_blank\">The Larry Sanders Show</a>,\" for which she received an Emmy nomination in 1997 and two Cable Ace nominations. During the fall of '94 she joined the cast of \"Saturday Night Live.\" Other television work includes the series finale of \"Mad About You\" and the critically-lauded final season of NBC's \"<a href=\"http://www2.warnerbros.com/web/westwingtv/index.jsp\" target=\"_blank\">The West Wing</a>,\" where she played Democratic campaign strategist Louise Thornton. In 2007, Janeane's voice was featured in the Disney/Pixar animated comedy Ratatouille. Janeane can also be seen in Stella writer/director David Wain's ensemble comedy, \"The Ten,\" the Lifetime movie \"Girl's Best Friend\" and as a recurring character on the 2009 season of \"<a href=\"http://www.fox.com/24/\" target=\"_blank\">24</a>.\"</p>\n<p> </p>\n",
      "pageUrl": "16925-janeane-garofalo"
    },
    {
      "id": 17008,
      "events": [
        17168,
        17231,
        17280
      ],
      "emceeEvents": [
        17190
      ],
      "name": "Andy Kindler ",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/kindler_2012_small.jpg",
      "photoUrl": "/api/img/performer-images/performer-andykindler-300x300.jpg",
      "sortOrder": 3,
      "excludeFromList": false,
      "bio": "<p>Andy Kindler currently recurs on Fox’s hit animation, <em>Bob’s Burgers </em>and Comedy Central’s <em>Tosh. O.   </em>He is also the host of Season 4 and 5 of Hulu’s standup series, <em>Coming to the Stage.  </em> Andy was a series judge on the seventh season of NBC’s <em>Last Comic Standing</em>, the star of two half-hour <em>Comedy Central Presents</em> specials and was a frequent guest and correspondent on <em>The Late Show with David Letterman </em>with over 40 appearances.  He recurred on <em>Everybody Loves Raymond</em>, Disney’s <em>Wizards of Waverly Place, </em>and IFC’s <em>Maron</em>.  Other noteworthy credits include the <em>HBO Young Comedians Special, Conan, The Daily Show, Dr. Katz Professional Therapist, Home Movies </em>and <em>The Larry Sanders Show</em>.  Every year Andy delivers his infamous <em>State of the Industry Address</em> each year at the Just for Laughs Festival in Montreal.</p>\n",
      "pageUrl": "17008-andy-kindler-"
    },
    {
      "id": 16927,
      "events": [
        17179,
        17182,
        17184,
        17188,
        17214
      ],
      "emceeEvents": [],
      "name": "Karen Kilgariff",
      "twitter": "KarenKilgariff",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/karen.jpg",
      "photoUrl": "/api/img/performer-images/performer-karenkilgariff-300x300.jpg",
      "sortOrder": 4,
      "excludeFromList": false,
      "bio": "<p>Comedian Karen Kilgariff worked as an actor on HBO's legendary sketch program Mr. Show and as the head writer for Ellen DeGeneres. But she's found a niche for herself as the composer of scathingly-funny songs about smart-phone obsession, drinking on holidays and dysfunctional relationships and as the co-host of the smash hit podcast My Favorite Murder.</p>\n",
      "pageUrl": "16927-karen-kilgariff"
    },
    {
      "id": 16919,
      "events": [
        17150,
        17186,
        17190,
        17219,
        17280
      ],
      "emceeEvents": [
        17183
      ],
      "name": "Jackie Kashian",
      "twitter": "jackiekashian",
      "website": "http://www.jackiekashian.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/dorkforestpodweb-4.jpg",
      "photoUrl": "/api/img/performer-images/performer-jackiekashian-300x300.jpg",
      "sortOrder": 5,
      "excludeFromList": false,
      "bio": "<p>Jackie Kashian is a comic, podcaster, writer, actor and occasional  bottle washer if there's some attention to garnered. Jackie's brand new album, I'm Not The Hero Of This Story, was #1 comedy album on iTunes and Amazon the first week of its release and is critically acclaimed. She is in the eleventh year of her podcast The Dork Forest, where she talks with people about what they love to do, think about and collect. All things are dorky and it's dork on dork dialog. She also has a new podcast on the Nerdist Network with Laurie Kilmartin called The Jackie and Laurie Show. And, seriously, that's just talking about comedy. <a href=\"http://www.jackiekashian.com\" target=\"_blank\">www.jackiekashian.com</a> has links to it all. </p>\n",
      "pageUrl": "16919-jackie-kashian"
    },
    {
      "id": 17364,
      "events": [
        17182,
        17187,
        17188,
        17191,
        17204
      ],
      "emceeEvents": [],
      "name": "Kyle Kinane",
      "twitter": "kylekinane",
      "website": "http://kylekinane.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/kinane.gif",
      "photoUrl": "/api/img/performer-images/performer-kylekinane-300x300.jpg",
      "sortOrder": 6,
      "excludeFromList": false,
      "bio": "<p>Kyle Kinane has been up and at it for almost half his life, mostly searching for what \"it\" might be. He has performed in the Leicester, Vancouver, Washington D.C., Portland, Just For Laughs/Chicago and the USCAF/Aspen comedy festivals, and has been on the TV via \"Last Call with Carson Daly,\" \"The Very Funny Show\" on TBS, \"Live at Gotham,\" \"Comedy Central Presents\" and \"The World Stands Up\" on the BBC. He was called \"bleak and misanthropic\" by the London Evening Standard, which he still feels may be a compliment. He is a comedian.</p>\n",
      "pageUrl": "17364-kyle-kinane"
    },
    {
      "id": 16920,
      "events": [
        17182,
        17207,
        17231
      ],
      "emceeEvents": [
        17151,
        17170
      ],
      "name": "Baron Vaughn",
      "twitter": "barvonblaq",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/static1.squarespace_0.jpg",
      "photoUrl": "/api/img/performer-images/performer-baronvaughn-300x300.jpg",
      "sortOrder": 7,
      "excludeFromList": false,
      "bio": "<p>Baron Vaughn is a series regular on Netflix’s <em>Grace &amp; Frankie </em>in the role of “Bud.” The first and second seasons are streaming on Netflix; third season will be released in 2017. He was on USA Network’s <em>Fairly Legal </em>(2010-2012), and has appeared in the films <em>Black Dynamite, Cloverfield</em>, and <em>The Other Guys</em> (Deleted Scenes). </p>\n<p>As a comedian, Baron’s performed stand-up on <em>Conan </em>(twice),<em> Late Late Show with Craig Ferguson, Late Night with Jimmy Fallon, </em>and Comedy Central’s <em>The Half Hour</em>. He's the self-proclaimed \"Master of Festivals\" most notably having performed in the HBO U.S. Comedy Arts Festival (Aspen), Just for Laughs Comedy Festival (Montreal), South Beach Comedy Festival (Miami), Moontower Comedy Festival (Austin), SXSW Festival (Austin), San Francisco Sketchfest, Bridgetown Comedy Festival (Portland), Vancouver Comedy Festival, Accidental Comedy Festival (Cleveland), Chicago Comedy Exposition, JashFesht (Palm Springs), Bonnaroo Music and Arts Festival (TN), and Bumbershoot Music and Arts Festival (Seattle). </p>\n<p>Baron has a new comedy recording, <em>Blaxistential Crisis</em>, currently available on AST Records.</p>\n",
      "pageUrl": "16920-baron-vaughn"
    },
    {
      "id": 16918,
      "events": [
        17213,
        17231,
        17254,
        17271,
        17272
      ],
      "emceeEvents": [],
      "name": "Matt Braunger",
      "twitter": "Braunger",
      "website": "http://www.mattbraunger.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/1046_matt_braunger_07.23.15_07-1438.jpg",
      "photoUrl": "/api/img/performer-images/performer-mattbraunger-300x300.jpg",
      "sortOrder": 8,
      "excludeFromList": false,
      "bio": "<p>Matt Braunger was raised in Portland, Oregon. A headlining comedian since 2007 and an actor since childhood, Matt studied theatre in New York and improvisation in Chicago.</p>\n<p>Matt’s television credits include a recurring role on ABC’s \"Agent Carter,\" NBC’s \"Up All Night,\" a series regular role on \"MADtv,\" as well as appearances on \"BoJack Horseman,\" \"Garfunkel and Oates,\" \"Maron,\" HBO’s \"Family Tree,\" \"The Michael J Fox Show,\" \"Happy Endings,\" \"CONAN,\" \"The Tonight Show with Conan O’Brien,\" \"The Late Show with David Letterman,\" \"The Pete Holmes Show,\" \"United States of Tara,\" \"Pushing Daisies,\" \"Carpoolers,\" \"The Late Late Show with Craig Ferguson, \" \"Acceptable TV,\" and \"Live At Gotham.\" He was also a regular guest on the \"Chelsea Lately\" roundtable and \"@midnight.\" Most recently Matt joined the cast of the popular TruTV series \"How to Be a Grown Up,\" and appeared in Showtime’s \"SXSW Comedy with W. Kamau Bell\" and Comedy Central’s \"The Meltdown.\"</p>\n<p>He won the 2008 “Best Of The Fest” at the inaugural Rooftop Comedy Festival in Aspen. In 2009, he was named to Variety’s Top 10 \"Comics to Watch,\" and Comedy Central’s \"Hot 9 in ’09\" list, his debut album \"Soak Up The Night\" was released by Comedy Central Records and he was named to the iTunes REWIND \"Top 20 Albums of 2009.\" In 2010, he recorded his half hour Comedy Central Presents special and in 2012 released his debut hour-long special entitled \"Shovel Fighter,\" also released as an album. Matt’s latest hour-long comedy special, \"Big, Dumb Animal\" is now available on Netflix.</p>\n<p>Along with touring comedy clubs across the country, Matt is also a regular at the Upright Citizens Brigade in Los Angeles, and he headlined the Old Milwaukee Comedy Tour for Funny Or Die in 2013. Matt has also performed at a variety of prestigious comedy festivals including the Just For Laughs Festival in Montreal and Chicago, The TBS Comedy Festival Las Vegas, and South By Southwest. Matt also co-founded the popular Bridgetown Comedy Festival that takes place annually in Portland.</p>\n",
      "pageUrl": "16918-matt-braunger"
    },
    {
      "id": 17224,
      "events": [
        17165,
        17207
      ],
      "emceeEvents": [
        17185
      ],
      "name": "Jonah Ray",
      "twitter": "jonahray",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/jonah_ray.png",
      "photoUrl": "/api/img/performer-images/performer-jonahray-300x300.jpg",
      "sortOrder": 9,
      "excludeFromList": false,
      "bio": "<p>Jonah Ray started his TV career as a writer's assistant before being fired then immediately being re-hired as a full time writer. Since then he has written and performed on shows such as “Adventure Time,” “@Midnight” and “Maron” and has appeared as a stand-up on “Conan” as well as the co-host and Executive Producer on “The Meltdown with Jonah &amp; Kumail\" which just wrapped up its 3rd season on Comedy Central. The first season of his own show, “Hidden America with Jonah Ray” can be seen on Seeso, with the second season premiering on May 4th. Ray is also stars in “Mystery Science Theater 3000: The Return” to be released on Netflix this April alongside Patton Oswalt, Baron Vaughn and Hampton Yount.</p>\n",
      "pageUrl": "17224-jonah-ray"
    },
    {
      "id": 17122,
      "events": [
        17149,
        17164,
        17204,
        17231
      ],
      "emceeEvents": [
        17248
      ],
      "name": "Ian Karmel",
      "twitter": "IanKarmel",
      "website": "http://www.iankarmel.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/unspecified.jpg",
      "photoUrl": "/api/img/performer-images/performer-iankarmel-300x300.jpg",
      "sortOrder": 10,
      "excludeFromList": false,
      "bio": "<p>Ian Karmel is a homegrown Portland comedian whose style zig-zags between the eclectic and the universal. Ian is currently a writer on <strong>CBS’ The Late Late Show with James Corden</strong>, previously he was writer and roundtable regular on E!’s<strong> Chelsea Lately</strong>. </p>\n<p>Karmel made his late night TV debut on <strong>TBS' Conan </strong>and was featured on <strong>Comedy Central’s Adam Devine’s House Party Season 2.  </strong>In 2015, he released his debut album <em>9.2 on Pitchfork</em> via the Portland based label <strong>Kill Rock Stars</strong>. In 2013, Ian was invited to the prestigious <strong>Just for Laughs Festival</strong> in Montreal, where he was a breakout stand up in the New Faces category. Ian’s other television credits include IFC’s <em><strong>Portlandia </strong></em><em>and the Travel Channel’s <strong>Best Sandwich in America, </strong></em>as well as a post-game analyst and commentator for the <strong>Portland Trailblazers</strong>. </p>\n<p>Other festival appearances include the <strong>Bridgetown Comedy Festival</strong> and <strong>Moontower Comedy Festival </strong>in Austin. His training includes <strong>The Groundlings</strong> and the <strong>Upright Citizens Brigade</strong> and he is a regular contributor for the <strong>Portland Mercury </strong>in which is he currently writes the highly anticipated weekly column<strong> “Everything as F*ck”</strong>. He can be seen headlining various clubs throughout America and currently lives in Los Angeles. </p>\n",
      "pageUrl": "17122-ian-karmel"
    },
    {
      "id": 16051,
      "events": [
        17180,
        17181,
        17188,
        17217,
        17231
      ],
      "emceeEvents": [
        17205
      ],
      "name": "Guy Branum",
      "twitter": "guybranum",
      "website": "http://www.guybranum.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/guybranum2.jpg",
      "photoUrl": "/api/img/performer-images/performer-guybranum-300x300.jpg",
      "sortOrder": 11,
      "excludeFromList": false,
      "bio": "<p>Guy Branum is a writer and comedian best known for his recurring segment \"No More Mr. Nice Gay\" on <em>Totally Biased with W. Kamau Bell</em>, serving as \"Staff Homosexual\" on <em>Chelsea Lately</em> and his performance as Natalie Portman's sassy gay friend in <em>No Strings Attached</em>. Noticing a trend? He's a recurring panelist on Comedy Central's <em>@Midnight</em> and <em>The Nightly Show with Larry Wilmore</em>. He is also the host and the creator of the beloved <em>Talk Show The Game Show</em> where celebrity guests face off to prove who's the best talk show guest by plugging, name-dropping, and anecdoteing their way to victory. The show takes place monthly at the Nerdmelt Showroom in LA and was just ordered to series for TruTV. Other TV credits include the upcoming <em>Road to Roast</em>, also on Comedy Central, SeeSo's <em>Comedy Show Show</em> and <em>Debate Wars</em>, or maybe you have seen Guy on E!, MTV, G4, CurrentTV and lots of other channels you'd need to upgrade your cable to watch. Guy's writing credits include <em>The Mindy Project</em> on Hulu, <em>Punk'd</em> and <em>Awkward</em> on MTV, <em>Billy on the Street</em> on truTV and <em>Fashion Police</em> on E!. That means he's watched the Grammys at Joan Rivers's house. Jealous? </p>\n<p>As a standup comic Guy has appeared at San Francisco Sketchfest, Moontower Comedy Festival in Austin, TX, Riot LA and Bridgetown Comedy Festival in Portland, OR. In 2015 Guy released his debut album <em>Effable</em> on AST Records. He also writes self-important essays for various blogs, had an editorial column in The New York Times and occasionally makes web videos where he dances around without his shirt on. But mostly, Guy is very, very beautiful and good at having sex.</p>\n",
      "pageUrl": "16051-guy-branum"
    },
    {
      "id": 16647,
      "events": [
        17159,
        17167,
        17189,
        17197
      ],
      "emceeEvents": [],
      "name": "Marcella Arguello",
      "twitter": "MarcellaComedy",
      "website": "http://MarcellaComedy.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/img_0241.jpg",
      "photoUrl": "/api/img/performer-images/performer-marcellaarguello-300x300.jpg",
      "sortOrder": 12,
      "excludeFromList": false,
      "bio": "<p>Too lazy to shoot hoops and too tall to model, Marcella Arguello stands over 6 feet. Although she may be taller than most men, the only thing more intimidating than her height is her comedy. Marcella mixes a combination of genuine reason with a sexy suggestion of street. Deemed as “sexually and ethnically ambiguous” she appeals to everyone and is not afraid to tell you how she really feels about subjects concerning race, gender, politic, relationships, family, work, music, pop culture and whatever else is on her mind that day.</p>\n<p>Time Out Magazine deemed Marcella an “LA Comedian to Watch in 2017” and is a fan favorite on Comedy Central’s @midnight. Most recently, she won her appearance on TruTv’s Comedy Knock Out and can be seen on The UCB Show’s upcoming second season on Seeso. She was featured on Viceland’s Flophouse, and in 2015 on NBC’s Last Call with Carson Daly; her stand up has been highlighted on rapper Tyler, The Creator’s mobile app and on Fox’s The Real. Her Twitter account (@marcellacomedy) has been featured on CNN, TIME.com, HuffingtonPost.com and various entertainment websites. She is a regular opener for Last Comic Standing Winner Felipe Esparza as well as NBC Superstore’s Nico Santos. She has opened for David Alan Grier, Norm MacDonald, J.B. Smoove, Hannibal Buress, Ron Funches, Godfrey, Bryan Callen, Aries Spears, Hasan Minhaj, Al Madrigal, Joey Coco Diaz, Melanie Comarcho, Melissa Villaseñor and has shared a stage with Bill Burr, Paul Mooney and Robin Williams.</p>\n<p>She has worked at The Improv Comedy Clubs all over the country and is a regular at The Punch Line Comedy Clubs in Northern California. She has performed at San Francisco Sketchfest, Riot LA Comedy Festival, overseas for American troops and comedian Sean Keane referred to her as the “finest export from Modesto since George Lucas.”</p>\n",
      "pageUrl": "16647-marcella-arguello"
    },
    {
      "id": 16828,
      "events": [
        17170,
        17173,
        17206,
        17210
      ],
      "emceeEvents": [],
      "name": "Kevin Avery",
      "twitter": "kevinavery",
      "website": "http://kevinaverycomedy.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/13603514_10157078314940517_4502523661211233666_o.jpg",
      "photoUrl": "/api/img/performer-images/performer-kevinavery-300x300.jpg",
      "sortOrder": 13,
      "excludeFromList": false,
      "bio": "<p>Kevin Avery is a comedian and Emmy award winning writer whose credits include HBO’s Last Week Tonight with John Oliver, VH1′s Best Week Ever and the critically acclaimed FX original series, Totally Biased with W. Kamau Bell, on which he had the distinction of serving as head writer. He was co-writer of the Comedy Central digital series, White Flight, and the cohost of the popular Wolfpop podcast, Denzel Washington is the Greatest Actor of All Time, Period, praised by Buzzfeed as “smart” and “funny” and recommended by Entertainment Weekly as a “Must List(en).”</p>\n",
      "pageUrl": "16828-kevin-avery"
    },
    {
      "id": 16894,
      "events": [
        17149,
        17187,
        17280
      ],
      "emceeEvents": [
        17167
      ],
      "name": "Eliza Skinner",
      "twitter": "elizaskinner",
      "website": "http://eliza.skinner@gmail.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/eliza_skinner_2017_0.jpg",
      "photoUrl": "/api/img/performer-images/performer-elizaskinner-300x300.jpg",
      "sortOrder": 14,
      "excludeFromList": false,
      "bio": "<p>Eliza Skinner is originally from Richmond, VA and started her performing career as an unnamed child revolutionary in a production of Evita. She is now a stand-up comedian and has appeared on The Pete Holmes Show, @Midnight, Chelsea Lately, Upload with Shaquille O’Neal, MTV, Showtime, AMC and the BBC. She has performed in festivals all over the world including RiotLA, SXSW, Bridgetown, the NY Comedy Festival and the Edinburgh Fringe. In his Reddit AMA, Patton Oswalt called her one of his favorite up-and-coming comedians. Eliza was a writer and correspondent on Totally Biased (produced by Chris Rock), Fashion Police (with Joan Rivers), Adam Ruins Everything (truTV) and she was a staff writer for The Late Late Show with James Corden. In 2014 she was selected to be one of the “New Faces Of Comedy” at the Montreal Just For Laughs Festival. In 2015 she was selected for the “SF Sketchfest Dozen” and TimeOut LA named her one of 9 “Comics To Watch in 2015″. She is currently the headwriter of Drop The Mic coming to TBS this spring.</p>\n",
      "pageUrl": "16894-eliza-skinner"
    },
    {
      "id": 16915,
      "events": [
        17186,
        17190,
        17361
      ],
      "emceeEvents": [],
      "name": "Laurie Kilmartin",
      "twitter": "anylaurie16",
      "website": "http://www.kilmartin.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/images-2.jpg",
      "photoUrl": "/api/img/performer-images/performer-lauriekilmartin-300x300.jpg",
      "sortOrder": 15,
      "excludeFromList": false,
      "bio": "<p>Laurie Kilmartin was a finalist on Last Comic Standing and has appeared on CONAN and Jimmy Kimmel Live. She is the co-author of the NYT bestseller \"Sh*tty Mom\" and is currently a staff writer on CONAN.</p>\n",
      "pageUrl": "16915-laurie-kilmartin"
    },
    {
      "id": 16917,
      "events": [
        17160,
        17165,
        17181
      ],
      "emceeEvents": [
        17320
      ],
      "name": "Dave Hill",
      "twitter": "mrdavehill",
      "website": "http://davehillonline.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/dave-hill1_0.jpg",
      "photoUrl": "/api/img/performer-images/performer-davehill-300x300.jpg",
      "sortOrder": 16,
      "excludeFromList": false,
      "bio": "<p>Dave Hill is a comedian, writer, musician, actor, radio host, and man-about-town originally from Cleveland, Ohio but now living in New York City in a totally sweet apartment with a party deck and everything. Hot chicks come over to hang out and eat cheese plates and stuff with him all the time and it’s awesome.</p>\n<p>Anyway, on the show business front, Dave has appeared on Comedy Central’s <em>@midnight</em> and<em> Inside Amy Schumer</em> programs, TBS' <em>Full Frontal with Samantha Bee, </em>and TruTV's <em>Comedy Knockout</em> others. He is a frequent on-air host for HBO and Cinemax and has been on channels like MTV, VH1, BBC-America, and the Sundance Channel a whole bunch too. Dave also starred in his own television program <em>The King of Miami</em> on the Mojo Network, which was cancelled even though Dave really liked it. The show also aired in the United Kingdom on Sky TV’s Film24 Channel. And you can still watch <a href=\"http://www.hulu.com/search?q=King+of+Miami\"><em>The King of Miami</em> on Hulu</a> too, which Dave is super pumped about. Oh, and Dave was a correspondent on <em>Hoppus on Music</em> starring Blink 182’s Mark Hoppus on the Fuse channel, which ruled. Dave has been on other shows and in obscure movies too but let’s keep moving for now.</p>\n<p>Dave performs live comedy over the world and has appeared at such festivals as the Melbourne International Comedy Festival, San Francisco Sketchfest, the Edinburgh Fringe Festival, the U.S. Comedy Arts Festival in Aspen, Sasquatch Festival, Bumbershoot, Bonnaroo, the Bridgetown Comedy Festival in Portland, the Crap Comedy Festival in Oslo, Outside Lands in San Francisco, and then some other ones too. He has also performed comedy at Sing Sing Correctional Facility twice and even ripped some guitar solos inside a Mexican prison once. In 2007, <em>Variety</em> magazine named Dave one of their “10 Comedians to Watch,” something he still won’t shut up about..</p>\n<p>Dave is also a musician who currently sings and plays guitar in the power pop band Valley Lodge, whose song “Go” is the theme song to HBO’s <em>Last Week Tonight with John Oliver</em>. He was also a member of Cleveland rock bands Sons of Elvis and Cobra Verde as well as Diamondsnake, a heavy metal band with Moby. Additionally, Dave has played guitar for Walter Schreifels and muscle metal band Thor and bass for Lucy Wainwright Roche and former Faith No More singer Chuck Mosley. He also contributed musical stores to films such as <em>Dirty Deeds</em>, <em>Shoot First and Pray You Live</em>, and then some other ones besides those two.</p>\n<p>Dave has made out with a lot of chicks, is sweet at guitar, and smells really great. You can ask anyone.</p>\n",
      "pageUrl": "16917-dave-hill"
    },
    {
      "id": 16571,
      "events": [
        17163,
        17173,
        17196
      ],
      "emceeEvents": [
        17194
      ],
      "name": "Brent Weinbach",
      "twitter": "BrentWeinbach",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/cityoflosangelesheadshot.jpg",
      "photoUrl": "/api/img/performer-images/performer-brentweinbach-300x300.jpg",
      "sortOrder": 17,
      "excludeFromList": false,
      "bio": "<p>Brent Weinbach is a recipient of the Andy KaufmanAward, which recognizes innovation in stand-up comedy.He is also responsible for various internet videosensations such as Gangster Party Line, Mind Jack, andUltimate Drumming Technique, as well as the cult webseries, Pound House.  Brent has appeared on Conan,Lopez Tonight, Comedy Central (The Meltdown,@midnight, Kroll Show, Another Period), and lots ofother places, and also toured with the Comedians ofComedy.</p>\n<p> </p>\n<p>\"...obscenely, disturbingly brilliant.\" -L.A. Weekly</p>\n<p>\"...weird in the best way\" -Time Out NY</p>\n",
      "pageUrl": "16571-brent-weinbach"
    },
    {
      "id": 16641,
      "events": [
        17176,
        17215,
        17320
      ],
      "emceeEvents": [
        17174,
        17209
      ],
      "name": "Shane Mauss",
      "twitter": "shanecomedy",
      "website": "http://shanemauss.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/shane.mauss_dmt.portrait_without.molecule_web.jpg",
      "photoUrl": "/api/img/performer-images/performer-shanemauss-300x300.jpg",
      "sortOrder": 18,
      "excludeFromList": false,
      "bio": "<p>Originally from Wisconsin, Shane Mauss caught his first break when he was awarded ‘Best Stand-Up” at The HBO US Comedy Arts Festival in 2007.  This led to his TV debut and first of five appearances on Conan.<br />\n <br />\nSince that time he’s been on Jimmy Kimmel, Showtime, has had a Comedy Central Presents, a Netflix special ‘Mating Season’, and most recently released album inspired by breaking both of his feet in a hiking mishap called ‘My Big Break’ which spent time at #1 on the comedy iTunes charts. <br />\n <br />\nShane has also been getting a lot of attention as a popular guest on podcasts such as Marc Maron’s WTF, Pete Holmes’ You Made It Weird, The Joe Rogan Experience, Bertcast, Duncan Trussell’s Family Hour, TOFOP, Crabfeast, Ari Shaffir&#039;s Skeptic Tanks, Doug Loves Movies, Never Not Funny, Getting Doug with High, Keith and The Girl.</p>\n<p>His favorite thing to do while traveling around the country is to find scientists in the area to interview for his podcast “Here We Are”.  The podcast explores psychology, sociology, neuroscience, behavioral economics, evolution, marketing and all things related to the meanings of life.</p>\n",
      "pageUrl": "16641-shane-mauss"
    },
    {
      "id": 17365,
      "events": [
        17182
      ],
      "emceeEvents": [],
      "name": "April Richardson",
      "twitter": "apey",
      "website": "http://aprilrichardson.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/april_richardson.png",
      "photoUrl": "/api/img/performer-images/performer-aprilrichardson-300x300.jpg",
      "sortOrder": 19,
      "excludeFromList": false,
      "bio": "<p>Hi! I'm stand-up comedian who grew up in Atlanta, Georgia, but I now live in Los Angeles. I've written for and been a regular panelist on Chelsea Lately, I co-hosted (along with Chris Fairbanks) a show called Almost Genius on TruTV for two seasons, I'm on Comedy Central's @midnight pretty often, and I'm on the road a lot as Chris Hardwick's feature act, as well as doing my own shows at comedy clubs and punk clubs all around our nation. I also created and hosted the popular (if I do say so myself, which feels weird) Go Bayside podcast, which ran for two years and critically deconstructed every episode of Saved by the Bell (yes, for real). I still write zines (remember those?) and I've also been told I make pretty good mixtapes. More can be found at aprilrichardson.com. </p>\n",
      "pageUrl": "17365-april-richardson"
    },
    {
      "id": 16591,
      "events": [
        17149,
        17190,
        17194
      ],
      "emceeEvents": [],
      "name": "Nick Vatterott",
      "twitter": "nickvatterott",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/nickvatterottheadshot_01272017125716_large_0.jpg",
      "photoUrl": "/api/img/performer-images/performer-nickvatterott-300x300.jpg",
      "sortOrder": 20,
      "excludeFromList": false,
      "bio": "<p>In 2010 The Hollywood Reporter named Nick Vatterott one of the “break-outs” at Montreal’s Just for Laughs Comedy Festival. Since then he has performed on <em>Conan</em>, <em>Late Night with Jimmy Fallon</em> and has a half hour special on Comedy Central. Nick was also a producer/writer/performer on Comedy Central’s stand-up sketch hybrid show <em>Mash-Up</em>, and with co-creator TJ Miller sold the project <em>Manimation</em> to Fox's ADHD. He was the recipient of the prestigious Andy Kaufman award in 2011 and before heading off to NYC, Chicago Magazine listed Nick as “The Funniest Man in Chicago.” Nick’s debut comedy record, FOR AMUSMENT ONLY was released in November 2014 by Comedy Central Records and was voted by Vulture, Laughspin, and Splitsider as one of the year’s best comedy albums. In addition to naming Vatterott’s album one of the best of 2014, Vulture.com also listed him as one of the top 50 comedians you should know in 2015. Nick has been called “one of the most dynamic performer’s today” by The Laugh Button and his LATE NIGHT WITH JIMMY FALLON set was received as “so damn brilliant” by The Chicago Reader.  Nick has also had correspondent work on THE BIG TEN NETWORK and is currently writing for GORBURGER on Comedy Central with TJ Miller.</p>\n",
      "pageUrl": "16591-nick-vatterott"
    },
    {
      "id": 16916,
      "events": [
        17154,
        17173,
        17180,
        17189,
        17198
      ],
      "emceeEvents": [],
      "name": "Nico Santos",
      "twitter": "nicosantoscomic",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/nico_santos.jpg",
      "photoUrl": "/api/img/performer-images/performer-nicosantos-300x300.jpg",
      "sortOrder": 21,
      "excludeFromList": false,
      "bio": "<p>Nico Santos stars as Mateo on NBC's comedy \"Superstore.\" Santos was born and raised in the Philippines and assimilated into American culture rather quickly by living in California by way of Portland, Oregon. He started doing stand up in San Francisco and, in just a short amount of time, conquered the Bay Area comedy scene with his acute observations and quirky characters.</p>\n<p>Charming audiences all across the country with his sharp sarcastic wit and outrageous sensibility, Santos has that rare ability to be crass and snarky while at the same time remaining completely likable. Santos has written for E! Network's \"Fashion Police\" and appeared on screen on Showtime's \"Pride Comedy Jam,\" as well as \"Ground Floor,\" \"Mulaney\" and \"2 Broke Girls.\" He was also a regular panelist on \"Chelsea Lately\" and made his film debut in \"Paul Blart: Mall Cop 2.\" </p>\n",
      "pageUrl": "16916-nico-santos"
    },
    {
      "id": 16685,
      "events": [
        17160,
        17165,
        17192,
        17202
      ],
      "emceeEvents": [],
      "name": "Annie Lederman",
      "twitter": "annielederman",
      "website": "http://www.annielederman.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/annie_lederman_approved_photo.jpg",
      "photoUrl": "/api/img/performer-images/performer-annielederman-300x300.jpg",
      "sortOrder": 22,
      "excludeFromList": false,
      "bio": "<p>Annie can most recently been seen as a cast member on MTV's Girl Code and as the voice of Cheryl on Grand Theft Auto 5. Annie Lederman also starred in We Have Issues, a pop-culture talk show on E! with co-host Julian McCullough. She has also appeared on This is Not Happening on Comedy Central, Chelsea Lately, @Midnight on Comedy Central, The Soup Investigate and Adam Devine's House Party.  In addition, Annie starred and wrote, Stand Ups, a scripted Comedy Central pilot, produced by Dan Powell (co-creator of Inside Amy Schumer,) with comedians Kurt Metzger &amp; Monroe Martin. She tours regularly worldwide as a stand-up comedian.</p>\n",
      "pageUrl": "16685-annie-lederman"
    },
    {
      "id": 15979,
      "events": [
        17207,
        17275,
        17280,
        17281
      ],
      "emceeEvents": [],
      "name": "Hampton Yount",
      "twitter": "Hamptonyount",
      "website": "http://www.hamptonyount.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/hampton_yount_standup.jpg",
      "photoUrl": "/api/img/performer-images/performer-hamptonyount-300x300.jpg",
      "sortOrder": 23,
      "excludeFromList": false,
      "bio": "<p>Hampton is a comedian and is also a human being filled with blood and guts. He started comedy in DC and later moved to LA where he’s currently working as a writer and performer. Please hire him (me, it’s always been me)</p>\n<p>He’s written and produced for: Ridiculousness on MTV, The Eric Andre Show, Loiter Squad, The Meltdown, and Mystery Science Theater 3000.</p>\n<p>Hampton has performed his stand up on Conan, Comedy Central, MTV, and for multiple festivals, including: Just For Laughs, SXSW, FYF, Bridgetown Comedy Festival, Oddball Comedy Fest, New York Comedy Festival, Comedy Central South Beach Festival</p>\n<p>Currently he is the voice of Crow T. Robot on Mystery Science Theater 3000 coming soon to Netflix. He has a new album out called \"Bearable\" that is his follow up to \"Unbearable\" and Joss Whedon called it “very funny” right before quitting twitter. His new hour of material is hella tight.</p>\n",
      "pageUrl": "15979-hampton-yount"
    },
    {
      "id": 16525,
      "events": [
        17151,
        17192,
        17197,
        17218
      ],
      "emceeEvents": [],
      "name": "Candice Thompson",
      "twitter": "jokesbycandice",
      "website": "http://candicethompsoncomedy.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/c_thompson_headshot_11-7-16.jpg",
      "photoUrl": "/api/img/performer-images/performer-candicethompson-300x300.jpg",
      "sortOrder": 24,
      "excludeFromList": false,
      "bio": "<p>Candice Thompson is a comedian/writer/actor that was born in Queens, raised in Cincinnati, and currently resides in Los Angeles.  She is the perfect mix of both East and West coasts with just the wrong amount of Midwest street cred.  Candice comes from an ethnically mixed family with both of her parents being of African-American and Native American descent, but often gets mistaken for just plain old white.</p>\n<p>Candice is one of the newest paid regulars at The Comedy Store, and the Hollywood Improv. You may have seen her most recently on The Tonight Show Starring Jimmy Fallon. She appeared on season 9 of NBC’s Last Comic Standing and was a correspondent on E! network’s The Comment Section. She is featured on MTV’s Acting Out and was also on season 2 of Comedy Central’s Roast Battle. You can hear her every week on iTunes as co-host of the podcast Offarious: The Show that’s Offensive &amp; Hilarious, and in the comedic YouTube sketch series she co-created, Creepy Caress.</p>\n<p>Candice’s comedy has often made people squirm in their seats and most recently, has gotten her ejected from a wedding, but it’s her edgy vs. adorable factor that keeps crowds begging for more.  Candice wants to thank her friends and family for all their support, but most of all she wants to thank God for making her better than everybody.</p>\n",
      "pageUrl": "16525-candice-thompson"
    },
    {
      "id": 15888,
      "events": [
        17160,
        17172,
        17205
      ],
      "emceeEvents": [],
      "name": "Joel Kim Booster",
      "twitter": "ihatejoelkim",
      "website": "http://www.ihatejoelkim.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/joel_conan.jpg",
      "photoUrl": "/api/img/performer-images/performer-joelkimbooster-300x300.jpg",
      "sortOrder": 25,
      "excludeFromList": false,
      "bio": "<p>Joel Kim Booster is a Chicago bred, Brooklyn based comedian, writer and playwright. Born in Jeju, South Korea, Joel was adopted at a young age and moved to the southwest suburbs of Chicago. Both homeschooled and evangelical, Joel has read the bible literally dozens of times, but has no idea where the state of Oregon is on a map. As a comedian he has appeared on <em>Conan</em>, Comedy Central’s <em>The Meltdown with Jonah and Kumail, </em>Logo’s <em>Comedy Cabaret </em>and truTV’s <em>Comedy Knockout</em>. His writing credits include <em>Billy on the Street </em>and the Comedy Central pilot <em>Problematic with Moshe Kasher</em>. Esquire Magazine recently listed Joel as one of their 10 Comedians to Watch in 2017.</p>\n",
      "pageUrl": "15888-joel-kim-booster"
    },
    {
      "id": 16039,
      "events": [
        17160,
        17187,
        17197,
        17203
      ],
      "emceeEvents": [
        17214
      ],
      "name": "Allen Strickland Williams",
      "twitter": "totallyallen",
      "website": "http://www.allenstricklandwilliams.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/asw_suit_of_headshots_lores.jpg",
      "photoUrl": "/api/img/performer-images/performer-allenstricklandwilliams-300x300.jpg",
      "sortOrder": 26,
      "excludeFromList": false,
      "bio": "<p>Allen Strickland Williams is a stand-up comedian and writer in Los Angeles. In the fall of 2014 Allen made his television stand-up debut on <em>Conan. </em>He’s appeared on <em>Comedy Dynamics: Coming to the Stage </em>on Hulu, <em>After Darth </em>from Abominable Pictures and <em>Flophouse </em>on Viceland. Allen was recently listed as one of the 10 Best Rising Stars in LA Comedy by The Culture Trip and appeared at the 2016 New York Comedy Festival as one of Comedy Central’s <em>Comics to Watch</em>, a showcase for the hottest up-and-coming comedians in the nation. Allen was featured on the <em>Holy Fuck</em> live comedy album, and has performed at SXSW and Moontower in Austin, Texas, the Bridgetown Comedy Festival in Portland, Oregon and Funny or Die's Oddball Comedy Festival in both San Diego and Irvine, California. He has performed in Los Angeles at the Upright Citizens Brigade Theatre, The Hollywood Improv, The Laugh Factory, The Comedy Store, Holy Fuck at The Downtown Independent and Nerdmelt Showroom. He’s headlined at Acme Comedy Co. in Minneapolis and featured at Comedy Works in Denver, the Punchline in San Francisco, the American Comedy Co. in San Diego and both of the UCB Theatres in New York City. When not tinkering with jokes or going up on stage, Allen works as a freelance writer for VICE.com and produces videos with his sketch group WOMEN, which has been featured on <em>Tosh.0</em> and IFC.com's<em> Comedy Crib.</em></p>\n",
      "pageUrl": "16039-allen-strickland-williams"
    },
    {
      "id": 16905,
      "events": [
        17189,
        17204,
        17254
      ],
      "emceeEvents": [],
      "name": "Ahmed Bharoocha",
      "twitter": "ahmedbharoocha",
      "website": "http://ahmedbharoocha.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/rawimage_1.jpg",
      "photoUrl": "/api/img/performer-images/performer-ahmedbharoocha-300x300.jpg",
      "sortOrder": 27,
      "excludeFromList": false,
      "bio": "<p>Conan and Comedy Central veteran Ahmed Bharoocha is half Irish Catholic, half Pakistani-Indian-Burmese-Muslim, and wholly a master of punctuating striking social commentary with high-energy theatrics. During high school, his family relocated from Santa Barbara to Rhode Island, where Bharoocha made the leap from Stitches Comedy Club dishwasher to open micer. While attending the University of Rhode Island, he frequented Boston’s Comedy Studio, becoming a Comic in Residence in the process. </p>\n<p>In 2010, Bharoocha won the Magner’s International Comedy Festival and soon moved to Los Angeles (specifically his sister’s dining-room floor). There he began producing weekly web shorts with Ryan O’Flanagan and Jack Robichaud for their Dead Kevin YouTube channel; the viral sketch trio has since been featured on Tosh.0, Funny or Die and named one of L.A. Weekly’s 2013 Comedy Acts to Watch. As a solo stand-up, Bharoocha’s festival performances include Just for Laughs Montreal, the Moontower Comedy Festival, Riot L.A., the Great American Comedy Festival and Scotland’s Glasgow International Comedy Festival. Most recently he appeared on Adam DeVine’s House Party, Viceland’s Flophouse and was cast as a series regular on this fall’s Adult Swim series Dream Corp.</p>\n",
      "pageUrl": "16905-ahmed-bharoocha"
    },
    {
      "id": 16190,
      "events": [
        17160,
        17167,
        17172,
        17202,
        17206,
        17216
      ],
      "emceeEvents": [],
      "name": "Myq Kaplan",
      "twitter": "myqkaplan",
      "website": "http://myqkaplan.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/myq-kaplan-b46a5276-5_1.jpg",
      "photoUrl": "/api/img/performer-images/performer-myqkaplan-300x300.jpg",
      "sortOrder": 28,
      "excludeFromList": false,
      "bio": "<p>Myq Kaplan is a comedian named Mike Kaplan.<br />\nHe has been seen on the Tonight Show, Conan, the Late Show with David Letterman, Late Night with Seth Meyers, in his own half-hour Comedy Central Presents special, and in his own one-hour special on Netflix, &quot;Small, Dork, and Handsome.&quot; He has been a finalist on Last Comic Standing and most recently appeared on America&#039;s Got Talent. His debut album &quot;Vegan Mind Meld&quot; was one of iTunes&#039; top 10 comedy albums of the year, and his latest album &quot;No Kidding&quot; is out now. And that&#039;s only the past! Even more to come in the future! Check out myqkaplan.com for more information, and/or live your life however you choose. Thanks!</p>\n",
      "pageUrl": "16190-myq-kaplan"
    },
    {
      "id": 16603,
      "events": [
        17160,
        17187,
        17192,
        17197
      ],
      "emceeEvents": [],
      "name": "Debra DiGiovanni",
      "twitter": "DEBRADIGIOVANNI",
      "website": "http://www.debradigiovanni.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/debradig.jpg",
      "photoUrl": "/api/img/performer-images/performer-debradigiovanni-300x300.jpg",
      "sortOrder": 29,
      "excludeFromList": false,
      "bio": "<p>Comedian Debra DiGiovanni has been awarded the Canadian Comedy Award for best female comic for the third time in 5 years. She’s been called the “Best Comedian to see after a Messy Break Up” and for three years running-she was named her hometown Toronto’s favorite comedian. Debra’s a favorite at the Montreal Just for Laughs Comedy Festival, and attended in 2014 for the 9th time. She’s performed at the Bridgetown Fest in Portland, the Glasgow Comedy Fest in Scotland, and the Just For Laughs Festival in Sydney Australia.  Her first stand up special for Showtime  “Single, Awkward Female” is now available on Netflix.</p>\n",
      "pageUrl": "16603-debra-digiovanni"
    },
    {
      "id": 16401,
      "events": [
        17155,
        17181,
        17202,
        17320
      ],
      "emceeEvents": [],
      "name": "Andres du Bouchet",
      "twitter": "dubouchet",
      "website": "http://andresdubouchet.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/andres_copy.jpg",
      "photoUrl": "/api/img/performer-images/performer-andresdubouchet-300x300.jpg",
      "sortOrder": 30,
      "excludeFromList": false,
      "bio": "<p>An Emmy-nominated television writer, Andres is currently writing for and frequently appearing on <em>Conan</em>, TBS’ primetime talk show. He has also appeared on <em>Bob’s Burgers</em>, <em>Brooklyn Nine-Nine</em>, and Jonah Ray’s <em>Hidden America</em>. In addition, he frequently performs stand-up comedy in Los Angeles, where he currently resides. </p>\n<p>His unique characters, monologues, sketches, and absurdist style make him hard to miss, as do his loudness and size.</p>\n<p>Follow Andres on Twitter: <a href=\"http://www.twitter.com/dubouchet\" target=\"_blank\">@dubouchet</a></p>\n<p>Listen to Andres’ albums on <a href=\"https://itunes.apple.com/us/artist/andres-du-bouchet/id466934684\">iTunes</a>.</p>\n",
      "pageUrl": "16401-andres-du-bouchet"
    },
    {
      "id": 16657,
      "events": [
        17165,
        17217,
        17320
      ],
      "emceeEvents": [],
      "name": "Brooke Van Poppelen",
      "twitter": "BVPcomedy",
      "website": "http://www.brookevanpoppelen.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/bvp_headshot_blonde.jpg",
      "photoUrl": "/api/img/performer-images/performer-brookevanpoppelen-300x300.jpg",
      "sortOrder": 31,
      "excludeFromList": false,
      "bio": "<p>Brooke Van Poppelen is a NYC based comic, actress, writer, and host of Hack My Life on truTV. Brooke has appeared on The Nightly Show with Larry Wilmore, @Midnight and John Oliver’s New York Stand Up Show on Comedy Central, The Late Late Show with Craig Ferguson on CBS, IFC’s Comedy Drop, and Night Train hosted by Wyatt Cenac for NBC’s Seeso. She has appeared as a guest on ABC’s The View and Dr. Oz ,and also as a talking head &amp; panelist on multiple MTV, truTV &amp; vh1 shows. Brooke worked as a writer &amp; producer for several seasons of Girl Code and Guy Code and many other MTV shows. Her first comedy album, Hard Feelings was released by Sure Think ATX in October and hit #1 on iTunes.</p>\n<p>Brooke can be seen in the web series  Seeing Other People, which she co-wrote and co-stars in with Giulia Rozzi. The six episode web series has been gathering attention from the likes of  IFC.com, Glamour and Laugh Spin.</p>\n<p>Brooke’s stand up comedy has been praised by Splitsider, Esquire and Brightest Young Things. She was recently selected for the Headliners Showcase as part of the Melbourne International Comedy Festival and has also performed at The Bentzen Ball, Riot Fest LA, SXSW, The Eugene Mirman Comedy Festival and Bridgetown and returned to SXSW in 2016 as the host of the Interactive Awards Ceremony. </p>\n<p>In NYC &amp; LA she performs at UCB on shows like Whiplash or Fresh Out! In Brooklyn she can be seen at Union Hall — a lot — especially on her show Comfort Zone which she hosts with singer songwriter Julian Velard.</p>\n<p>Prior to NYC she performed and trained in Chicago at IO, The Second City, and The Playground Theater. Brooke hails from the Detroit suburbs and loves coney dogs.</p>\n",
      "pageUrl": "16657-brooke-van-poppelen"
    },
    {
      "id": 15749,
      "events": [
        17180,
        17187,
        17197,
        17203,
        17213
      ],
      "emceeEvents": [],
      "name": "Chris Fairbanks ",
      "twitter": "chrisfairbanks",
      "website": "http://www.chrisfairbanks.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/chris_fairbanks_sharks_0.jpg",
      "photoUrl": "/api/img/performer-images/performer-chrisfairbanks-300x300.jpg",
      "sortOrder": 32,
      "excludeFromList": false,
      "bio": "<p>CHRIS FAIRBANKS is the co-host of ALMOST GENIUS on truTV.</p>\n<p>Originally from Montana, Chris headlines comedy venues nationally. His fast paced, quirky and constantly improvised act has been showcased on Comedy Central, Conan, Last Comic Standing, Jimmy Kimmel Live, Vh1 and TruTV. Chris has appeared in the film “Punching Henry,\" on Comedy Central's @midnight, on Seeso (NBC’s new comedy streaming platform), and on the road opening for Daniel Tosh. </p>\n<p>Chris’ first comedy album, “Fairbanks!” was named one of Amazon and Amazon MP3’s Top Ten of 2010. He also hosts the popular podcast, “Do You Need a Ride”, with Karen Kilgariff on All Things Comedy. They shuttle their guests to or from the airport, somewhat dangerously, in a '08 Honda Accord mobile sound studio. </p>\n<p>Chris is also self-employed as a freelance artist, illustrating for magazines, skateboards, and educational textbooks.</p>\n",
      "pageUrl": "15749-chris-fairbanks-"
    },
    {
      "id": 16187,
      "events": [
        17154,
        17168,
        17182,
        17190,
        17196
      ],
      "emceeEvents": [
        17191
      ],
      "name": "Ron Lynch",
      "twitter": "ronlynch1",
      "website": "https://www.facebook.com/ron.lynch1",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/ron_lynch_2016.jpg",
      "photoUrl": "/api/img/performer-images/performer-ronlynch-300x300.jpg",
      "sortOrder": 33,
      "excludeFromList": false,
      "bio": "<p>Been doing comedy forever.  TV stuff.  Used to do jokey jokes, now more characters and weird stuff.</p>\n<p>Ron provided this bio, along with a link to his IMDB page. We deleted the link. If you see him on the street, ask him to tell you about his TV and film credits.</p>\n",
      "pageUrl": "16187-ron-lynch"
    },
    {
      "id": 16855,
      "events": [
        17150,
        17168,
        17202,
        17219,
        17271
      ],
      "emceeEvents": [],
      "name": "Maggie Maye",
      "twitter": "Maggiemayehaha",
      "website": "http://Maggiemayehaha.wordpress.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/15369253_10108616896342530_8883825666896952655_o.jpg",
      "photoUrl": "/api/img/performer-images/performer-maggiemaye-300x300.jpg",
      "sortOrder": 34,
      "excludeFromList": false,
      "bio": "<p>Maggie Maye loves candy almost as much as she also loves performing comedy. She made her late night debut on Conan and was featured in AXS TV presents: Gotham Comedy Live. She’s performed in the Bridgetown Comedy Festival, San Francisco Sketchfest (as one of the Sketchfest Dozen), Moontower Comedy &amp; Oddity Festival, SXSW, and the All Jane Comedy Festival. She’s opened for Hannibal Burress, Paul Rodriguez, Gladys Knight, and Earth, Wind and Fire. Her work has been featured in the Huffington Post, Variety, LaughSpin, and the New York Times. She’s been named a comic to watch by Splitsider, the Austin American Statesman, and the Austin Chronicle (who also named her as 2016 Best of Austin Stand up comic). Maggie is also a member of award winning improv and sketch shows, Damn, Gina! and Doper than Dope. Her comedy is described the same way she is: sassy, charming, and smart. A 6-year-old once told her she was the funniest person ever. And kids rarely lie.</p>\n",
      "pageUrl": "16855-maggie-maye"
    },
    {
      "id": 16037,
      "events": [
        17205,
        17214
      ],
      "emceeEvents": [
        17172
      ],
      "name": "Lisa Best",
      "twitter": "_lisabest",
      "website": "http://www.lisabestcomedy.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/best_bench_sleep_lores.jpg",
      "photoUrl": "/api/img/performer-images/performer-lisabest-300x300.jpg",
      "sortOrder": 35,
      "excludeFromList": false,
      "bio": "<p>Lisa Best is a comedian, writer and performer from Los Angeles and has quickly made a name for herself in LA’s alternative scene as a brilliantly quirky comic and skilled story teller. In the spring of 2014, Lisa began headlining colleges across the country. She is a regular performer at Meltdown with Jonah and Kumail, The Laugh Factory in Hollywood, The Hollywood Improv, the Upright Citizens Brigade theatre, and was chosen to perform her hour at the Nerdmelt showroom for An Evening with Lisa Best. She has been showcased by Comedy Central and IFC, and has been seen at The Laugh Factory in Scottsdale, The Comedy Attic in Bloomington, Comedy Works in Denver, The Laughing Skull and The Improv in Atlanta and numerous other clubs around the county. She has been a featured performer at Sarah Silverman's 1st annual JASH Fesht in Palm Springs, All Jane Comedy Festival in Portland, Los Angeles' alternative comedy festival RIOT, and two years in a row at the Bridgetown Comedy Festival where The Portland Monthly wrote that Lisa \"has a flair for turning embarrassing stories into comedy gold.\" She is also a co-host for the Travel Channel pilot <em>Cheat Day, </em>performed stand up on Viceland’s <em>Flophouse </em>and appeared in digital sketches for Comedy Central, Funny or Die and IFC's Comedy Crib. But enough about her, how are you?</p>\n",
      "pageUrl": "16037-lisa-best"
    },
    {
      "id": 16346,
      "events": [
        17148,
        17172,
        17184,
        17198,
        17233
      ],
      "emceeEvents": [],
      "name": "Drew Lynch",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/drewlynch002.jpg",
      "photoUrl": "/api/img/performer-images/performer-drewlynch-300x300.jpg",
      "sortOrder": 36,
      "excludeFromList": false,
      "bio": "<p>In 2015, Drew Lynch captured the hearts of America with his Golden Buzzer performance on Season 10 of America’s Got Talent. “The person I was before would probably never hangout with who I am today” is the statement that resonated most in capturing audiences across the country, as they fell in love with Drew’s charming wit and genuine vulnerability every week of the competition. “Do something every day that scares you” is a motto Drew lives by.</p>\n<p>Drew becoming a comedian was almost as unintentional as capturing America’s hearts.  Originally from Indianapolis, at the age of 19, Drew moved to Los Angeles with aspirations of becoming an actor; a dream he had since he was a kid. An unexpected softball accident just a year into his acting career left Drew with a severe stutter and crushed his hopes of ever performing again.</p>\n<p>But his continued drive to become an entertainer forced him in a different direction, often reflecting on the “softball that humbly changed his life and gave him a career”. Drew’s vulnerabilty in dealing with his stutter and making it relatable to real-life situations propelled him each week of the competition – advancing him to the finals and ultimately landing him first runner-up on season 10 of America’s Got Talent.  Drew attributes much of his success from his ability to be honest, genuinely facing the “elephant in the room” head on.  Inspired by comedians Bo Burnham, Louis C.K, he now headlines Comedy Clubs across the country.</p>\n<p>Since his success on America’s Got Talent, Drew’s career has come full circle and he has broken back into the acting scene. Drew recently garnered a recurring role on the Marc Maron Show, has appeared on “Dr. Oz,” and as a celebrity guest on the game show “Idiot Test.” He is collaborating on a book, and ultimately becoming the actor he always dreamed of, with a now different and enlightened perspective on who he thought he was, and who he is today.</p>\n<p> </p>\n",
      "pageUrl": "16346-drew-lynch"
    },
    {
      "id": 16895,
      "events": [
        17148,
        17187,
        17204,
        17234,
        17250
      ],
      "emceeEvents": [],
      "name": "Billy Wayne Davis",
      "twitter": "billywaynedavis",
      "website": "http://billywaynedavis.tumblr.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/billywayne.jpg",
      "photoUrl": "/api/img/performer-images/performer-billywaynedavis-300x300.jpg",
      "sortOrder": 37,
      "excludeFromList": false,
      "bio": "<p>Originally from Crossville, TN, Billy Wayne Davis is a stand-up &amp; writer who has performed in 41 states, 4 countries and Texas. He has appeared on Conan, NBC's Last Comic Standing, WTF with Marc Maron, hosted a Morgan Spurlock produced documentary for CMT, named a 2015 Fresh Face of Comedy by the Just for Laughs Festival in Montreal, opened for Grammy winning country artist Sturgill Simpson’s 30 city Living the Dream Tour, and just released his second comedy album, “Billy Wayne Davis: Live at Third Man Records.”</p>\n",
      "pageUrl": "16895-billy-wayne-davis"
    },
    {
      "id": 17237,
      "events": [
        17189,
        17192,
        17204,
        17248
      ],
      "emceeEvents": [],
      "name": "Dulcé Sloan",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/_gmb6732_copy.jpg",
      "photoUrl": "/api/img/performer-images/performer-dulcsloan-300x300.jpg",
      "sortOrder": 38,
      "excludeFromList": false,
      "bio": "<p>Offering a fresh and honest perspective that’s rare to find, Dulcé Sloan is one of TimeOut LA's Top Comics to Watch for 2017 and and the Winner of the 2016 Big Sky Comedy  Festival . She was honored as the <em>2015 NBC Stand Up Showcase Winner </em>and as a<em> 2015 Montreal Just For Laughs New Face.</em>She made her late-night debut last year on <em>Late with Conan O'Brien</em> and her day-time debut as a \"Comedian You Should Know\" on the <em>Steve Harvey Show.</em> She can be seen on <em>Greatest Ever </em>and <em>Comedy Knock Out</em> on <em>truTV</em>. Dulcé's signature sass and confidence drives her hilarious views on everything from her personal relationships to the absurdities of society. </p>\n<p> </p>\n",
      "pageUrl": "17237-dulc-sloan"
    },
    {
      "id": 16732,
      "events": [
        17150,
        17194,
        17205,
        17235
      ],
      "emceeEvents": [],
      "name": "Caitlin Gill",
      "twitter": "ROBOTCAITLIN",
      "website": "http://www.caitlingillcomedy.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/c.gill_.jpg",
      "photoUrl": "/api/img/performer-images/performer-caitlingill-300x300.jpg",
      "sortOrder": 39,
      "excludeFromList": false,
      "bio": "<p>Caitlin has performed for Flophouse on Viceland, at the Oddball Comedy Tour, the Outside Lands Festival, SF Sketchfest, Bridgetown Comedy Festival and in some of the best comedy clubs in the nation. Her writing has been featured on Hidden America with Jonah Ray, the series Take My Wife and in The New York Times. She was voted Best Comedian in the East Bay Express “Best Of” Edition in 2013.  You can also hear her on podcasts like Put Your Hands Together, Competitive Erotic Fan Fiction and NPR's Snap Judgement. She co-hosts Crabapples every week at the Hollywood Improv Lab with Bobcat Goldthwait.</p>\n",
      "pageUrl": "16732-caitlin-gill"
    },
    {
      "id": 16928,
      "events": [
        17168,
        17176,
        17202,
        17208,
        17249
      ],
      "emceeEvents": [],
      "name": "Matt Kirshen",
      "twitter": "mattkirshen",
      "website": "http://www.mattkirshen.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/kirshen.jpg",
      "photoUrl": "/api/img/performer-images/performer-mattkirshen-300x300.jpg",
      "sortOrder": 40,
      "excludeFromList": false,
      "bio": "<p>London born Matt Kirshen's precision wit has earned him an impressive reputation on the international comedy circuit. His appearances on Comedy Central’s @Midnight, StarTalk with Neil deGrasse Tyson, Late Night with Jimmy Fallon, The Late Late Show with Craig Ferguson, Paul Provenza’s Green Room, The Nerdist, and as a finalist on NBC's Last Comic Standing have earned him a whole host of fans in the United States and a surprising number of other countries worldwide.<br />\n <br />\nHis debut CD, \"I Guess We'll Never Know\" was named in Laughspin Magazine's top 10 albums of the year and his hit appearance at Just For Laughs festival in Montreal resulted in no fewer than 4 of his gags appearing in the Montreal Gazette's round up of their best jokes of the fest.<br />\n <br />\nWhile it's his TV appearances that most American comedy fans will recognize him from, they are often surprised at the breadth and scope of his material, described by one reviewer as \"intelligent, but with the emphasis firmly on the funny.</p>\n",
      "pageUrl": "16928-matt-kirshen"
    },
    {
      "id": 16136,
      "events": [
        17179,
        17205,
        17260
      ],
      "emceeEvents": [],
      "name": "Janine Brito",
      "twitter": "janinebrito",
      "website": "http://janinebrito.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/janine_brito_bridgetownheadshot.jpg",
      "photoUrl": "/api/img/performer-images/performer-janinebrito-300x300.jpg",
      "sortOrder": 41,
      "excludeFromList": false,
      "bio": "<p>JANINE BRITO is a stand up comic, and was a writer and on-air correspondent on the FX series, Totally Biased with W. Kamau Bell, produced by Chris Rock. She&#039;s also half Cuban, half Icelandic, and aaaall lesbian.</p>\n",
      "pageUrl": "16136-janine-brito"
    },
    {
      "id": 16903,
      "events": [
        17156,
        17204,
        17280
      ],
      "emceeEvents": [
        17202
      ],
      "name": "Matt Knudsen ",
      "twitter": "mattknudsen",
      "website": "http://mattknudsen.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/0412_0.jpg",
      "photoUrl": "/api/img/performer-images/performer-mattknudsen-300x300.jpg",
      "sortOrder": 42,
      "excludeFromList": false,
      "bio": "<p>Matt Knudsen (Kah-nood-son) was born in Hawaii, raised in the Mid-west and sailed around the world as a merchant marine. After trips to Europe, Africa and The Far East, he eventually put down his sea bag, picked up a microphone and began performing stand up comedy all across the country. </p>\n<p>As an actor, you may have seen Matt share the big screen with Oscar winner Sean Penn, in the Warner Brothers feature Gangster Squad or you may also recognize him from his appearances in shows like Crazy Ex-Girlfriend, Key &amp; Peele, Workaholics, The League, Big Love, Boston Legal or Malcolm in the Middle just to name a few. Matt has also been a part of several high profile commercial campaigns for companies including: Apple, IBM, GE, Volkswagen, DirecTV, Pepsi and more; which have aired during the Superbowl and The Olympics.  </p>\n<p>As a comedian, he’s appeared on Conan, The Late Late Show, Last Call, ASX Live and Comics Unleashed, as well as dozens of festivals, including: Montreal Just for Laughs (Best of the Fest), The San Francisco Sketchfest, Bridgetown, High Plains, Limestone; and has even been part of an evening of entertainment at The White House for President and Mrs. Obama. </p>\n<p>His critically acclaimed albums The Comedy Stylings of Matt Knudsen and American are top downloads on iTunes, heard regularly on SiriusXM radio and “Mix droll observation with a dry, almost hypnotic delivery,” (The Onion A.V. Club); and with Knudsen’s unique style, “The personal feels universal, and the universal feels personal. The only explanation for this phenomenon is that it&#039;s all finely crafted comedy from a strong central voice…a great stand up album.” (The Huffington Post)</p>\n",
      "pageUrl": "16903-matt-knudsen-"
    },
    {
      "id": 16574,
      "events": [
        17204,
        17218,
        17249,
        17250,
        19056
      ],
      "emceeEvents": [
        17150
      ],
      "name": "Shane Torres",
      "twitter": "SyrupMountain",
      "website": "http://www.shaneisacomedian.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/shane_torres-approved_photo_1.jpg",
      "photoUrl": "/api/img/performer-images/performer-shanetorres-300x300.jpg",
      "sortOrder": 43,
      "excludeFromList": false,
      "bio": "<p>Shane Torres is a New York based standup comedian, writer, and actor originally from Fort Worth, TX.  Having made his late night debut on Conan just this year, you may have also seen him on Last Comic Standing or on IFC’s Comedy Bang Bang. He was featured at the Montreal Just For Laugh’s festival as a New Faces in 2013 and was one of Comedy Central’s Comics to Watch in 2012.</p>\n<p>Shane has performed at many festivals all over the country including Bridgetown Comedy Festival, Bumbershoot Music and Arts Festival, and many more. Shane has appeared on popular podcast such as Savage Love and Comedy Bang Bang. He tours across the globe at comedy clubs, rock venues, and theaters.</p>\n<p>Shane has appeared on popular podcast such as Savage Love and Comedy Bang Bang. He tours across the globe at comedy clubs, rock venues, and theaters. He is the creator of the podcast radio show Help Wanted . Shane has also contributed writing to Paste Magazine, Laughspin, The Portland Mercury, and Nailed Magazine.</p>\n",
      "pageUrl": "16574-shane-torres"
    },
    {
      "id": 15887,
      "events": [
        17155,
        17190,
        17194
      ],
      "emceeEvents": [],
      "name": "Ian Abramson",
      "twitter": "iantherage",
      "website": "http://www.ianabramson.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/abramson_onion_avfest1_creditmattanderson-min_1.jpg",
      "photoUrl": "/api/img/performer-images/performer-ianabramson-300x300.jpg",
      "sortOrder": 44,
      "excludeFromList": false,
      "bio": "<p>Ian Abramson is from Moreno Valley, California, where he learned to walk, read, and drive, but not in that order. His stand-up is a mix of precise wordplay, longer emotionally absurd jokes, and larger conceptual pieces. In 2014 Chicago Magazine named Ian “Best Experimental Comedian” and also listed him in a separate article as one of the “16 Comedians You Should See This Fall.” In 2015 Ian was LA Weekly’s Best Up-and-Coming Comedian and a New Face for the world renowned Just For Laughs Comedy Festival in Montreal, Canada.  </p>\n<p>Ian Abramson is a regular contributor to The Onion and also the creator and host of the buzzed-about Comedy Central digital show 7 Minutes in Purgatory where comedians perform to a camera in one room while the audience watches in another room. He was also a creative consultant for Funny or Die’s digital series Our Fascinating Planet starring Demetri Martin. Ian has appeared on SeeSo’s The Comedy Show Show, Hulu’s Coming to the Stage and performed at Bonnaroo Music and Arts Festival, Pemberton Music Festival in Canada, SXSW and Moontower Comedy Festival in Austin, New York Comedy Festival, San Francisco Sketchfest, Bridgetown Comedy Festival in Portland, The Onion/A.V. Club festival in Chicago and Funny or Die’s Oddball Festival. Recent TV credits include appearances on History Channel’s Join or Die and on ABC’s The Middle.</p>\n",
      "pageUrl": "15887-ian-abramson"
    },
    {
      "id": 16921,
      "events": [
        17149,
        17172,
        17210,
        17260
      ],
      "emceeEvents": [
        17181
      ],
      "name": "Bryan Cook",
      "twitter": "BryanCooking",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/bryan_new_headshot_small.jpg",
      "photoUrl": "/api/img/performer-images/performer-bryancook-300x300.jpg",
      "sortOrder": 45,
      "excludeFromList": false,
      "bio": "<p>Comic/writer Bryan Cook was named one of LA Weekly’s “10 Comedy Acts to Watch” in 2014. He is the host of Competitive Erotic Fan Fiction (named by Rolling Stone as one of the Top Ten Comedy Podcasts.) Along with Eliza Skinner, Cook co-hosts the popular LA comedy night, “Big Money,” at The Virgil every Thursday.</p>\n",
      "pageUrl": "16921-bryan-cook"
    },
    {
      "id": 16800,
      "events": [
        17164,
        17235,
        17248,
        17275
      ],
      "emceeEvents": [
        17204
      ],
      "name": "Sean Jordan",
      "twitter": "SeanSJordan",
      "website": "http://seanjordancomedy.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/denver.jpg",
      "photoUrl": "/api/img/performer-images/performer-seanjordan-300x300.jpg",
      "sortOrder": 46,
      "excludeFromList": false,
      "bio": "<p>Sean is a stand up comedian living in Los Angeles by way of South Dakota.  He made it out even though South Dakota is the greatest state in the country!  Sean spent his formative years in Portland OR where voted the funniest person in 2014.  In 2015 he was named one of the &quot;Comics to Watch&quot; by Splitsider and in 2016 was awarded the same title by Comedy Central.  Sean moved to Los Angeles almost a year ago where he waisted no time digging into the stand up scene performing on the top shows in the city while also maintaining a non stop touring schedule.  If you&#039;re a podcast fan then you&#039;ve most likely heard Sean as a regular guest and fan favorite on Doug Benson&#039;s podcast Doug Loves Movies.  You may have also heard him on Professor Blastoff, The Crabfeast, All Fantasy Everything, Competitive Erotic Fan Fiction, Put Your Hands Together and ARIYNBF (Alison Rosen is Your New Best Friend).  Sean is no stranger to the festival circuit doing festivals like this one all over the country.  Those festivals include: Sketchfest in San Francisco, High Plains Comedy Festival in Denver and CROM Comedy Fest in Omaha to name a few.  Sean was also a part time staff writer on Live Wire radio and just recently wrapped up as a member of a writing team for a Comedy Central pilot.</p>\n",
      "pageUrl": "16800-sean-jordan"
    },
    {
      "id": 16521,
      "events": [
        17164,
        17189,
        17203,
        17254,
        19056
      ],
      "emceeEvents": [
        17160
      ],
      "name": "Bri Pruett",
      "twitter": "bripruett",
      "website": "http://bripruett.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/14633485_1217134591684653_2842367725205405589_o_0.jpg",
      "photoUrl": "/api/img/performer-images/performer-bripruett-300x300.jpg",
      "sortOrder": 47,
      "excludeFromList": false,
      "bio": "<p>This Portland original just wrapped a run of her comedic solo show Stellar, which the Willamette Week called &quot;Body-positive, pro-self-love, and pro-female sexuality...&quot;</p>\n<p>In addition to clubs and festivals, she&#039;s brought her sparkle to Doug Loves Movies, NPR&#039;s Live Wire!, and Comedy Central&#039;s Roast Battle.</p>\n<p>Someone once described her as a female Jack Black, she took it as a compliment.</p>\n",
      "pageUrl": "16521-bri-pruett"
    },
    {
      "id": 16869,
      "events": [
        17164,
        17210,
        17214
      ],
      "emceeEvents": [
        17163,
        17196
      ],
      "name": "Steven Wilber",
      "twitter": "WilberWithAnE",
      "website": "http://stevenstevensteven.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/photofunia-1486527963.jpg",
      "photoUrl": "/api/img/performer-images/performer-stevenwilber-300x300.jpg",
      "sortOrder": 48,
      "excludeFromList": false,
      "bio": "<p>Steven Wilber (born July 31, 1962) is an American actor, film producer and martial artist.<br />\nHis prominent film roles include New Jack City (1991), White Men Can&#039;t Jump (1992) and the Marvel Comics character Blade in the Blade film trilogy (1998–2004). </p>\n<p>He formed a production company, Amen-Ra Films, in 1991, and a subsidiary, Black Dot Media, to develop projects for film and television.<br />\nHe has been training in martial arts since the age of 12, earning a 5th dan black belt in Shotokan Karate and 2nd dan black belt in Hapkido.</p>\n",
      "pageUrl": "16869-steven-wilber"
    },
    {
      "id": 16557,
      "events": [
        17163,
        17182,
        17196
      ],
      "emceeEvents": [],
      "name": "Jesse Elias",
      "twitter": "FinalFanJesse7",
      "website": "http://jesseelias.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/jesse-medium_0.jpg",
      "photoUrl": "/api/img/performer-images/performer-jesseelias-300x300.jpg",
      "sortOrder": 49,
      "excludeFromList": false,
      "bio": "<p>Jesse Elias is a comedian grown in San Francisco and shipped to Los Angeles. He draws inspiration from music and literature of the 19th century and cartoons and candy of the 1990s. Over the years he has performed in Montreal Just for Laughs, Bridgetown, Outside Lands, LA Riot, and SF Sketchfest. He was named one of the best new comics in LA by Splitsider.com. He has appeared on Jimmy Kimmel Live, Viceland&#039;s Flophouse, and written for The Eric Andre Show. Jesse learned everything he knows about being funny by studying the ancient comedies of Plautus and Terrence.</p>\n",
      "pageUrl": "16557-jesse-elias"
    },
    {
      "id": 15977,
      "events": [
        17149,
        17191,
        17194,
        17198
      ],
      "emceeEvents": [],
      "name": "Drennon Davis",
      "twitter": "DrennonDavis",
      "website": "http://www.drennondavis.org/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/drennon_davis_01_-_photo_by_mandee_johnson_-_www.mandeejohnson.com_-_c_mjp_cleftclips.jpg",
      "photoUrl": "/api/img/performer-images/performer-drennondavis-300x300.jpg",
      "sortOrder": 50,
      "excludeFromList": false,
      "bio": "<p>From his elaborate characters and sketches, to his provocative songs and animation, Drennon has made a name for himself as one of the most innovative minds in today’s comedy scene. His live performances of the Imaginary Radio Program combine live music and beat-boxing with one-man sketches into a show that the Los Angeles Comedy Bureau writes \"not only lives up to its name, but exceeds expectation in what you could possibly think it is.\"</p>\n<p>Drennon recently appeared on TBS’s <em>Conan</em>, and has previously appeared on Comedy Central's <em>Adam Devine's House Party</em>, NBC's <em>Last Call</em> and was a semifinalist on <em>Last Comic Standing</em>.  His animated show The Long Legs can be seen on MTV's New Liquid Television. Drennon also provided the theme song to Seeso’s <em>The Show Show</em>, which also features Drennon’s Imaginary Radio Program live show.</p>\n<p>He was featured in LA Weekly's Top 10 Comedy Acts to Watch in 2014 and 2015 Best Comedy Duo (with Karen Kilgariff), as well as Splitsider's Top 10 Up &amp; Coming Acts in LA in 2015. Drennon is a recurring presence at comedy festivals all over the world including the Edinburgh Fringe Festival, SXSW, Riot LA Alternative Comedy Festival, San Francisco’s Sketchfest, Vancouver Comedy Festival, the Oddball Comedy Festival and many more!</p>\n",
      "pageUrl": "15977-drennon-davis"
    },
    {
      "id": 15786,
      "events": [
        17150,
        17172,
        17203,
        17215
      ],
      "emceeEvents": [],
      "name": "Michelle Biloon",
      "twitter": "biloon",
      "website": "http://www.biloon.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/biloonheadshotweb2.jpg",
      "photoUrl": "/api/img/performer-images/performer-michellebiloon-300x300.jpg",
      "sortOrder": 51,
      "excludeFromList": false,
      "bio": "<p>Michelle Biloon is a standup comic straight outta Philly by way of Los Angeles by way of Austin. You may have heard her on the popular podcasts Comedy Bang Bang, 2 Dope Queens, or Doug Loves Movies. You may have seen her perform standup in your city opening for Patton Oswalt or headlining a show her own damn self. She&#039;s also appeared on Chelsea Lately, The Late Late Show with Craig Ferguson, Comics Unleashed, Comedy.tv, and Premium Blend.</p>\n<p>Want to know more about Michelle? She loves Judge Judy. She does the New York Times Crossword Puzzle every day. And she is motherfucking hilarious.</p>\n<p>Her mother has been quoted as saying, &quot;I watched the tape of her before I left for bowling and I laughed so hard that I had to go redo my makeup.&quot; And that&#039;s the truth, jackasses.</p>\n",
      "pageUrl": "15786-michelle-biloon"
    },
    {
      "id": 16277,
      "events": [
        17156,
        17213,
        17249
      ],
      "emceeEvents": [
        17250
      ],
      "name": "Ismael Loutfi",
      "twitter": "Ismaelian",
      "website": "http://ishmaeliswrong.tumblr.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/knittingfactorypicture_003_0.jpg",
      "photoUrl": "/api/img/performer-images/performer-ismaelloutfi-300x300.jpg",
      "sortOrder": 52,
      "excludeFromList": false,
      "bio": "<p>Ismael Loutfi is a sweet boy with a kind face. He’s been called “gifted,” “quick-witted,” and a “neurotic toe-rag” by numerous friends’ parents. Underneath that sweetness lies a deeply acerbic sense of humor- the sort of thing you might develop growing up a Muslim in rural North Florida. In 2016, he was a finalist in the Laughing Skull Comedy Festival. A month later, he went on to be a New Face of comedy at the Just For Laughs Comedy Festival in Montreal. Since then, he has been a Stand Up NBC finalist and Comic to Watch at LA’s Riot Comedy Festival. He can be seen on the VICELAND series Flophouse.</p>\n",
      "pageUrl": "16277-ismael-loutfi"
    },
    {
      "id": 16474,
      "events": [
        17150,
        17179,
        17206,
        17233
      ],
      "emceeEvents": [],
      "name": "Andrew Sleighter",
      "twitter": "andrewsleighter",
      "website": "http://andrewcomedy.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/photographedbyrobertmarejr.jpg",
      "photoUrl": "/api/img/performer-images/performer-andrewsleighter-300x300.jpg",
      "sortOrder": 53,
      "excludeFromList": false,
      "bio": "<p>Andrew Sleighter started in comedy looking for the perfect funny line to open a biography. Since then, Andrew’s laid-back style and clever writing has won him appreciation from fans and respect from his peers.</p>\n<p>A regular at colleges and comedy clubs across the country,  Andrew’s also performed (and gotten drunk) at some of the most prestigious comedy festivals in and out of the country including Bumbershoot, Bridgetown, The Cabo Comedy Festival, The Aspen Comedy  Festival, Laughing Skull, and the Johnny Carson Great American Comedy Festival.</p>\n<p>Andrew wrote and blogged for the Sports Show with Norm Macdonald on Comedy Central and was a regular on the MTV prank show Money From Strangers. He’s performed on Nuvo TV’s Stand Up &amp; Deliver, Last Comic Standing, and made his late-night stand-up debut on Conan in 2016.</p>\n<p>Andrew’s comedy has the ability to reach wide ranges of audiences and works in a diversity of rooms. Reliable and consistent, he rarely ends a show by lighting the stage on fire out of rage. Most importantly, he’s constantly fascinated by and eager to keep learning about stand-up.</p>\n",
      "pageUrl": "16474-andrew-sleighter"
    },
    {
      "id": 16325,
      "events": [
        17157,
        17193,
        17213,
        17250
      ],
      "emceeEvents": [],
      "name": "Caleb Synan",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/caleb_synan.jpg",
      "photoUrl": "/api/img/performer-images/performer-calebsynan-300x300.jpg",
      "sortOrder": 54,
      "excludeFromList": false,
      "bio": "<p>Caleb Synan has made appearances on CONAN, NBC’s Last Comic Standing, and the Bob and Tom Show. His deceptively smart blend of Southern charm and razor sharp wit has also made him a festival favorite, with appearances at Montreal’s Just For Laughs, Laugh Your Asheville Off, The Charleston Comedy Festival, and Athfest 2015. He also won “Wittiest” in Franklin County High School’s 2009 Yearbook. And he’s a pretty nice guy.</p>\n<p>\n </p>\n<p>\n </p>\n",
      "pageUrl": "16325-caleb-synan"
    },
    {
      "id": 16768,
      "events": [
        17163,
        17187,
        17235,
        17361
      ],
      "emceeEvents": [],
      "name": "Sean Devlin 叶 世民",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/sean_devlin_photo.jpg",
      "photoUrl": "/api/img/performer-images/performer-seandevlin-300x300.jpg",
      "sortOrder": 55,
      "excludeFromList": false,
      "bio": "<p>Sean Devlin 叶 世民 is a Filipino-Canadian comedian and filmmaker who has been performing stand up for 14 years. Previous festival appearances include Just For Laughs Northwest and Bumbershoot Festival. He has performed as an opening act for Hari Kondabolu, Aamer Rahman, Reggie Watts and Tig Notaro - as well musical acts Of Montreal and MGMT. His comedy has also been featured on CBC Radio, XM radio, Upworthy.com and in the CTV mini-mini series The Party.  His film work has been featured in the New York Times, The Guardian and popular online platforms such as Buzzfeed and Boing Boing. He works as a filmmaker and action coordinator for political pranksters The Yes Men.</p>\n",
      "pageUrl": "16768-sean-devlin--"
    },
    {
      "id": 16318,
      "events": [
        17152,
        17180,
        17187,
        17202
      ],
      "emceeEvents": [],
      "name": "Mike Lebovitz",
      "twitter": "mikelebovitz",
      "website": "http://bridgetown.festivalthing.com/mikelebovitz%40gmail.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/img_1165.png",
      "photoUrl": "/api/img/performer-images/performer-mikelebovitz-300x300.jpg",
      "sortOrder": 56,
      "excludeFromList": false,
      "bio": "<p>Mike Lebovitz began his comedy career at the age of six with clowning classes at the local JCC. He&#039;s been delighting and confounding audiences with his intoxicating brand of wild-eyed humor ever since. Equal parts lovable and absurd, Mike&#039;s act careens from topic to topic like a runaway freight train with some questionable couplings. Audiences have described the experience as &quot;spontaneous,&quot; &quot;joyful&quot; and &quot;slightly terrifying.&quot; </p>\n<p>A burgeoning international star now based in New York, Mike has offended nostrils in Montreal as a &quot;New Face&quot; of the 2013 Just For Laughs, and in Switzerland where he won the international competition at the 2013 The Montreux Comedy Fest. He returned to Montreux in 2014 as the &quot;Godfather&quot; of the competition.</p>\n",
      "pageUrl": "16318-mike-lebovitz"
    },
    {
      "id": 16337,
      "events": [
        17150,
        17167,
        17172,
        17181,
        17281
      ],
      "emceeEvents": [],
      "name": "Troy Walker",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/troy_11_0.jpg",
      "photoUrl": "/api/img/performer-images/performer-troywalker-300x300.jpg",
      "sortOrder": 57,
      "excludeFromList": false,
      "bio": "<p>If you haven't heard yet, the Denver comedy scene is blowing up and comedian Troy Walker is one of the most talented local rising stars.</p>\n<p>Troy Walker has quickly become one of Denver's most sought-after comedians, a designation he'd dismiss with a modest scoff, despite its accuracy. A regular at Comedy Works, Walker has won the Comedy Works \"New Faces\" contest twice.</p>\n<p>Walker has had the pleasure of opening for some of the most  prominent comedians in the country and also serves as a fine ambassador of Denver comedy at national and local comedy festivals including The Aspen Rooftop Comedy Festival, The Great American Comedy Festival, The Laughing Skull Comedy Festival, Portland's Bridgetown Comedy Festival, The Telluride Comedy Festival, and most recently as one of Just for Laughs Montreal's New Faces of Comedy.</p>\n<p>After witnessing his storytelling abilities and commanding  presence on-stage it should come as no surprise that he's also a licensed attorney  who graduated  from The University of Denver's Sturm College of Law.</p>\n",
      "pageUrl": "16337-troy-walker"
    },
    {
      "id": 15799,
      "events": [
        17175,
        17192,
        17216,
        17254
      ],
      "emceeEvents": [],
      "name": "Robby Hoffman",
      "twitter": "iAmRobbyHoffman",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/robbyhoffman_v1.jpg",
      "photoUrl": "/api/img/performer-images/performer-robbyhoffman-300x300.jpg",
      "sortOrder": 58,
      "excludeFromList": false,
      "bio": "<p>Robby Hoffman is a small red-headed ex-Chasidic lesbian Jew stand-up comedian and writer. She was recently New Faces at JFL42 (2015) and asked back to the festival (2016). She also performed at Off-JFL in Montreal (2016). She also performed at the All Jane festival in Portland (2016) and has been asked for industry selection at the Funny Women Fest in Los Angeles (2016). </p>\n<p>In her first couple years doing stand up, she had also won the WICF scholarship for Best Newcomer (2013) was named one of the “Top 10 Comedians” by the popular Montreal Mirror (2014), and hottest Top 50 on afterellen.com (2014). She was also in the TOP 10 of SiriusXM&#039;s Canada&#039;s Next Top Comic (2013) and created a hit mini web-series sponsored by Just for Laughs called Comedy in Biblical Proportions.</p>\n<p>Robby also writes a whole bunch for TV, most recently for Odd Squad (PBS), who took home the Emmy Award for Outstanding Writing in April (2016). She recently relocated from Toronto to LA where she is consistently booked on some of the most sought after shows in town.</p>\n",
      "pageUrl": "15799-robby-hoffman"
    },
    {
      "id": 16715,
      "events": [
        17151,
        17199,
        17250,
        17281
      ],
      "emceeEvents": [],
      "name": "Justin Hicks ",
      "twitter": "Hicks_jn",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/_dsc6526small.jpg",
      "photoUrl": "/api/img/performer-images/performer-justinhicks-300x300.jpg",
      "sortOrder": 59,
      "excludeFromList": false,
      "bio": "<p>Justin Hicks is a stand up comedian based in Austin, TX.  Justin was raised in small town Connecticut and has lived in Texas since 2010.  Much of his comedy is drawn from his upbringing and southern experiences.  He has a calm demeanor and cool delivery that is unique and easy to connect with.  Justin&#039;s humor covers topics ranging from chap-stick to R&amp;B music (he may or may not be the best R&amp;B comic in central Texas).  Justin began performing comedy in 2015.  He was a semi-finalist in the 2016 Funniest Person in Austin competition and has preformed at the Crossroads Comedy Festival (Indianapolis, IN)  and MR Fest (San Marcos, TX).</p>\n",
      "pageUrl": "16715-justin-hicks-"
    },
    {
      "id": 15722,
      "events": [
        17148,
        17164,
        17173,
        17218
      ],
      "emceeEvents": [
        17198
      ],
      "name": "Amy Miller",
      "twitter": "amymiller",
      "website": "http://amymillercomedy.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/img_0138.png",
      "photoUrl": "/api/img/performer-images/performer-amymiller-300x300.jpg",
      "sortOrder": 60,
      "excludeFromList": false,
      "bio": "<p>Amy Miller is a fast-rising talent on the West Coast and national scene. Originally from Oakland, California Amy found her comedy chops in the Bay Area scene and is still a favorite at the San Francisco Punch Line and Cobb’s Comedy Club. After a move to Portland, Amy quickly rose to the top of the Northwest comedy scene, winning Portland’s Funniest Comedian in Helium Comedy Club’s contest, as well as being voted Portland’s Funniest 2013 and 2015 in the Willamette Week. Amy was a breakout favorite in Season 9 of Last Comic Standing. Roseanne Barr called her “a star” and a “contender for next alpha female comedian.” Keenen Ivory Wayans said she had one of the “fiercest jokes he had ever heard.” Amy works comedy clubs and festivals around the country, working with headliners from Norm Macdonald to Arsenio Hall to singer Ryan Adams.</p>\n<p>Recent credits:<br />\n- Last Comic Standing Semi-Finalist, Season 9<br />\n- Viceland&#039;s Flophouse, featured comic<br />\n- Doug Loves Movies, regular guest<br />\n- Winner, Portland’s Funniest Person, Helium Comedy Club<br />\n- Album being released on Kill Rock Stars November 25th<br />\n- First woman to win Helium&#039;s contest<br />\n- San Francisco Sketchfest multiple years<br />\n- Bridgetown Comedy Festival multiple years<br />\n- Riot LA Festival<br />\n- NPR’s Marketplace<br />\n- The Bennington Show</p>\n",
      "pageUrl": "15722-amy-miller"
    },
    {
      "id": 16416,
      "events": [
        17170,
        17235,
        17320
      ],
      "emceeEvents": [],
      "name": "Shalewa Sharpe",
      "twitter": "silkyjumbo",
      "website": "http://shalewasharpe.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/shalewa_sharpe_barn.jpg",
      "photoUrl": "/api/img/performer-images/performer-shalewasharpe-300x300.jpg",
      "sortOrder": 61,
      "excludeFromList": false,
      "bio": "<p>Shalewa Sharpe tells jokes. She developed her sly yet goofy style in Atlanta, where she was raised. Currently in Brooklyn, New York, she has joked on the extremely popular “Night Train with Wyatt Cenac” show and the influential weekly Comedy Night at The Knitting Factory. She has joked on “You’re The Expert,” a public radio game show featured on Boston’s WBUR. She has joked at festivals, too - at RiotLA (Los Angeles), the Eugene Mirman Comedy Festival (Brooklyn), Comedy Exposition (Chicago) and Red Clay Comedy Festival (Atlanta). She co-produces and hosts a number of shows, including “Thug Passion Presents,” a lively table read and celebration of classic Black movies. In May 2016, her debut album, “Stay Eating Cookies,” was released on Rotknee Presents Records; it can be found on iTunes &amp; Amazon and heard on Spotify, Pandora, and Sirius XM radio. She tells jokes on Twitter (@silkyjumbo) and posts self portraits of varying success on Instagram (@silkyjumbo).</p>\n",
      "pageUrl": "16416-shalewa-sharpe"
    },
    {
      "id": 16930,
      "events": [
        17159,
        17176,
        17260,
        17281
      ],
      "emceeEvents": [],
      "name": "Nate Craig",
      "twitter": "NateCraigLive",
      "website": "http://www.natecraig.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/nate.jpg",
      "photoUrl": "/api/img/performer-images/performer-natecraig-300x300.jpg",
      "sortOrder": 62,
      "excludeFromList": false,
      "bio": "<p>This is Nate's 2nd appearance at Bridgetown. He's a nationally touring headliner and regular at The Hollywood Improv, Comedy Store, UCB Theaters (NY &amp; LA) and Nerdmelt Showroom. He was recently featured on Season two of Comedy Central's \"Roast Battle\" and MTV's \"Acting Out\". He's been on AXS Gotham Comedy Live and has appeared on Comedy Central's Tosh.0 and \"Mash-up\" which he also wrote for. He's also written for \"Ridiculousness\" on MTV and his new album Nate Craig \"Eggshell\" is featured in the Pandora \"Comedy Spotlight\" at Pandora.com. Nate has headlined both the \"Laugh Your Asheville Off\" and \"San Francisco Comedy and Burrito Festivals\" and been featured at the Bridgetown, RIOT LA, and HBO Las Vegas Comedy Festivals. He's been on \"You Made it Weird\" with Pete Holmes, has written for \"A Prairie Home Companion\" with Garrison Keillor, and was featured on the \"Best of the Bob &amp; Tom Radio Show\".  He does theater tours with Bill Burr, headlines all over the country and has multiple full length comedy albums available on iTunes and everywhere else.</p>\n",
      "pageUrl": "16930-nate-craig"
    },
    {
      "id": 15930,
      "events": [
        17156,
        17170,
        17215,
        17249
      ],
      "emceeEvents": [],
      "name": "Chinedu Unaka",
      "twitter": "chineducomedy",
      "website": "http://chineducomedy.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/chinedu.jpg",
      "photoUrl": "/api/img/performer-images/performer-chineduunaka-300x300.jpg",
      "sortOrder": 63,
      "excludeFromList": false,
      "bio": "<p>Chinedu is an LA based comedian, actor and writer, best known for his stand up appearances on television, internationally and around the United States. Recently Chinedu was seen on the hit comedy series The Mindy Project (FOX/HULU) and will be featured on an upcoming season of HULU&#039;s Coming to the Stage . He also just returned from an overseas tour performing for the US Troops stationed across the Middle East, a comedy tour of India and has a short film he starred in, alongside Luke Cage&#039;s Simone Missick, that&#039;s coming to HBO in 2017.  Chinedu was also a top finalist in 3 comedy festivals, headlines his own college tour and features for Damon Wayans Jr.</p>\n",
      "pageUrl": "15930-chinedu-unaka"
    },
    {
      "id": 16352,
      "events": [
        17197,
        17199,
        17214,
        17275
      ],
      "emceeEvents": [],
      "name": "Brad Silnutzer",
      "twitter": "bradlivesdreams",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/bradpic.jpg",
      "photoUrl": "/api/img/performer-images/performer-bradsilnutzer-300x300.jpg",
      "sortOrder": 64,
      "excludeFromList": false,
      "bio": "<p>Brad Silnutzer is a stand up, writer, producer, and host who was recently named one of Comedy Central’s 2016 Comics to Watch.  Brad created, produces, and hosts Brew HaHa: The Comedy Show Drinking game. He has written for shows such as Penn and Teller&quot; Fool Us for CW, Talent Overload for Verizon Go90, and The Hook Up for MTV.</p>\n<p>As a young lad, Brad started his performing career as the Ovaltine boy saying such lines as, &quot;More Ovaltine Please&quot; and &quot;Mom, why are you making me do this?&quot;.  Now, he can be found wandering the streets on LA wondering why he left two promising careers to start doing comedy.</p>\n",
      "pageUrl": "16352-brad-silnutzer"
    },
    {
      "id": 16457,
      "events": [
        17169,
        17187,
        17199
      ],
      "emceeEvents": [
        17159,
        17213
      ],
      "name": "David Venhuizen",
      "twitter": "david_venhuizen",
      "website": "http://davidvenhuizen.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/15972750_10100683388815544_8662568898550880063_o.jpg",
      "photoUrl": "/api/img/performer-images/performer-davidvenhuizen-300x300.jpg",
      "sortOrder": 65,
      "excludeFromList": false,
      "bio": "<p>David Venhuizen is a Los Angeles based comedian originally from South Dakota. He has performed on the LA Riot, Moontower, SF Sketchfest, Green Gravel, Crom, Orlando Indie, and Hell Yes comedy festivals. He also runs a monthly stand-up show called Idiots at The Clubhouse in Los Feliz  and performs in the sketch group The Fringe Riders with Dan Gill and Colin McCormick.</p>\n",
      "pageUrl": "16457-david-venhuizen"
    },
    {
      "id": 16360,
      "events": [
        17199,
        17215,
        17361
      ],
      "emceeEvents": [
        17158
      ],
      "name": "Kristin Key",
      "twitter": "thekristinkey",
      "website": "http://www.kristinkey.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/kristin_key_headshot.png",
      "photoUrl": "/api/img/performer-images/performer-kristinkey-300x300.jpg",
      "sortOrder": 66,
      "excludeFromList": false,
      "bio": "<p>Kristin Key grew up a minister’s daughter in a small town in West Texas. Much like Footloose, she was raised in a no-drinking, no-dancing, no instrumental music environment, so she immediately took up drinking, dancing and playing an instrument. Proving that the almighty has a strange sense of humor, Kristin came out of the closet at 15. Needless to say, it did not go well. So, Kristin decided to “take it back”, retreat back into the closet, and try a little harder to be straight.</p>\n<p>At 19, while in college to become a paramedic, Key signed up for Open Mic Night at the local comedy club. As soon as she took the stage she felt at home. Though her observations and wit made her a local favorite, she remained in the closet, fearful of losing her local fan base. Small shows in the Texas panhandle turned into 35 states worth of comedy over the next 5 years. Audiences couldn't help but love the original comedy songs and rapid-fire style of comedy coming from the \"Preacher's Kid\", and though female comics struggled to find work she was booked not for being a woman, but for simply being funny.</p>\n<p>When Last Comic Standing held their auditions in Austin, Texas, she stood in line hoping for a chance to be seen. After 7 hours of waiting, she got her chance and her ticket to Hollywood to compete with the best in the comedy world. At the end of the season she stood among the final six and watched as her fan base exploded. With validation from millions of comedy fans, Key moved to L.A. and began preparing a new act to take on the road.</p>\n<p>While participating in an anti-bullying fundraiser, Kristin finally broke her silence and decided to share her hilarious story of coming out, taking it back, living in the closet, and meeting her wife. After 15 years in comedy, Kristin has found a way to perfectly blend together her thought provoking hilarious true stories and original songs with outrageous off-the-cuff improv moments, ensuring that no two shows are the same.</p>\n<p>She is most recognized for her appearance on Last Comic Standing, additional credits include: Comics Unleashed, VH- 1’s 100 Greatest Series, The Bob and Tom show and Sirius and XM Satellite Radio. She has released several comedy and music albums, including a new Christmas album, “It’s Beginning to Look a Lot Like Kristin” (now available on Amazon, Google, and iTunes). Much has changed from the dusty west Texas town of Amarillo to the bright lights of L.A. but the one thing that hasn't changed is that fast-paced quick witted comedy that has kept audiences rolling in the aisles from the beginning.</p>\n",
      "pageUrl": "16360-kristin-key"
    },
    {
      "id": 16405,
      "events": [
        17163,
        17179,
        17206
      ],
      "emceeEvents": [
        17180
      ],
      "name": "Brandie Posey",
      "twitter": "brandazzle",
      "website": "http://brandieposey.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/bp_headshot.jpg",
      "photoUrl": "/api/img/performer-images/performer-brandieposey-300x300.jpg",
      "sortOrder": 67,
      "excludeFromList": false,
      "bio": "<p>Originally from Annapolis, Maryland, Brandie Posey is a stand up comedian, writer &amp; producer who now calls LA&#039;s comedy scene home. She has been featured as a performer at the New York Comedy Festival, RIOT Comedy Festival, San Francisco Sketchfest, FEST in Gainesville, Bridgetown Comedy Festival, The All Jane Festival, among many others. She has opened for the legendary punk band Against Me! and has appeared on MTV, E! &amp; Comedy Central. Brandie made her feature film debut in the indie dark comedy, &quot;The Worst Year Of My Life&quot; directed by Jonathan Smith. Her first stand up record Opinion Cave debuted at #1 on iTunes &amp; #12 on Billboard.com in 2016.</p>\n<p>She is honored to rep the LA comedy scene on the compilation album &quot;Holy Fuck. Album Comedy.&quot; and and tours the country, headlining every dark corner with a microphone. She is the co-creator &amp; host of Picture This!, a popular comedy-animation show with franchises in LA, New York &amp; San Francisco. On Comedy Central&#039;s Snapchat &amp; at the Upright Citizens Brigade Theatre &amp; Hollywood Improv, Brandie co-hosts Lady to Lady alongside Barbara Gray &amp; Tess Barker.  Lady to Lady is also a celebrated weekly podcast on the Maximum Fun Podcast Network with over 2.7 million downloads &amp; loyal fans around the world.</p>\n",
      "pageUrl": "16405-brandie-posey"
    },
    {
      "id": 16784,
      "events": [
        17164,
        17214,
        17260
      ],
      "emceeEvents": [],
      "name": "Curtis Cook",
      "twitter": "Curtis_Cook",
      "website": "http://CurtisCookComedy.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/bridgetown_photo_0.jpg",
      "photoUrl": "/api/img/performer-images/performer-curtiscook-300x300.jpg",
      "sortOrder": 68,
      "excludeFromList": false,
      "bio": "<p>Curtis Cook is a comic from Ohio now living in Los Angeles, California. He&#039;s been seen on Portlandia, Flophouse, and in venues and festivals throughout the country, including the Cleveland Comedy Festival, the Chicago Comedy Exposition, and San Francisco’s Sketchfest.</p>\n<p>In addition to performing standup, Curtis has appeared on Daily VICE and television programs in Kenya, Sierra Leone, and throughout the Middle East. He&#039;s also a former host of Earthquake Hurricane and a contributing writer for the Willamette Week and Laugh Staff.</p>\n",
      "pageUrl": "16784-curtis-cook"
    },
    {
      "id": 16530,
      "events": [
        17173,
        17189,
        17361
      ],
      "emceeEvents": [],
      "name": "Irene Tu",
      "twitter": "irene_tu",
      "website": "http://irenetu.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/irene_tu_headshot_daniel_schuleman.jpg",
      "photoUrl": "/api/img/performer-images/performer-irenetu-300x300.jpg",
      "sortOrder": 69,
      "excludeFromList": false,
      "bio": "<p>Irene Tu is a San Francisco-based stand-up comedian, writer, and actor. In 2016, she was named one of the “Bay Area’s 11 Best Stand Up Comedians” by the SFist and one of 20 “Women to Watch” by KQED. She has been featured in SF Sketchfest, Limestone Comedy Festival, RIOT LA and on Seeso and Viceland. Irene hosts several popular shows in the Bay Area: Man Haters, The Mission Position, and Millennials Ruin Everything (they do). You can follow her @irene_tu. irenetu.com</p>\n",
      "pageUrl": "16530-irene-tu"
    },
    {
      "id": 16312,
      "events": [
        17151,
        17203,
        17233
      ],
      "emceeEvents": [
        17175
      ],
      "name": "Nick Chambers",
      "twitter": "chamberscomedy",
      "website": "http://www.chamberscomedy.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/_chambersheadshot2.jpg",
      "photoUrl": "/api/img/performer-images/performer-nickchambers-300x300.jpg",
      "sortOrder": 70,
      "excludeFromList": false,
      "bio": "<p>Born &amp; raised in Worcester MA, Nick Chambers began performing stand-up comedy on a whim in 2009 and hasn’t been able to stop since. His laid back delivery and conversational tone has quickly led to becoming a regular performer all over the East Coast where he has opened for national headliners like Kyle Dunnigan and Bridget Everett. In 2016, Nick was a semi-finalist in the Boston Comedy Festival and performed in the Oddball Comedy Festival. He also made is feature film debut in the comedy &quot;Good Kids.”</p>\n",
      "pageUrl": "16312-nick-chambers"
    },
    {
      "id": 16926,
      "events": [
        17150
      ],
      "emceeEvents": [
        17207,
        17208
      ],
      "name": "Andy Wood",
      "twitter": "andytwood",
      "website": "http://andytwood.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/andy_wood_headshot_1.jpg",
      "photoUrl": "/api/img/performer-images/performer-andywood-300x300.jpg",
      "sortOrder": 71,
      "excludeFromList": false,
      "bio": "<p>In addition to performing standup comedy for the last dozen or so years, Andy Wood has written for, produced or appeared on shows including Science Channel's <em>How To Build Everything</em>, IFC's <em>Portlandia</em>, YouTube Red's <em>Mind Field</em>, TruTV's <em>You Can Do Better</em>, E!'s <em>Love You, Mean It with Whitney Cummings</em>, <em>Ridiculousness</em>, and <em>The MTV Movie Awards</em>. He also produced and acted in <em>Jason Nash Is Married</em>, the first feature released by Comedy Central’s CC: Studios. Andy's the director and co-founder of the Bridgetown Comedy Festival, and along with Matt Kirshen he's co-hosted the weekly podcast Probably Science since 2012, thereby tricking his parents into believing he hasn't wasted his engineering degree. And tricking Neil deGrasse Tyson into coming over to his apartment to appear on the show just last month. He's also obsessed with bar trivia, and if you ask him to join your pub quiz team he is honor-bound to accept.</p>\n",
      "pageUrl": "16926-andy-wood"
    },
    {
      "id": 16818,
      "events": [
        17176,
        17198,
        17214
      ],
      "emceeEvents": [],
      "name": "Forrest Shaw",
      "twitter": "forrestshaw",
      "website": "http://forrestshaw.net",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/forrestshaw_beard_small.jpg",
      "photoUrl": "/api/img/performer-images/performer-forrestshaw-300x300.jpg",
      "sortOrder": 72,
      "excludeFromList": false,
      "bio": "<p>Forrest Shaw made his television debut on Conan and appeared on Gotham Comedy LIVE on AXS TV in early 2015. He has performed in numerous festivals such as, Comedy Central’s South Beach Comedy Festival, Boston Comedy Festival, Big Sky Comedy Festival, New York Underground Comedy Festival, World Series of Comedy, &amp; the Comedy Central Open Mic Fight, and he was awarded 2013’s Ultimate Miami Comedian. Forrest is featured in season two of the FXX show Legit and has also appeared on Animal Planet.  Forrest is a co-writer (and lead actor) of the award winning web series (live action and animated) Labor Days (labordays.tv). He is co-creator of the weekly What’s What Podcast (whatswhatpod.com). He can also be heard on Sirius/XM Satellite radio, Pandora, and Spotify. His debut album ‘Mister Grizzly’ was released on November 18, 2014 on Comedy Records.</p>\n",
      "pageUrl": "16818-forrest-shaw"
    },
    {
      "id": 15957,
      "events": [
        17217,
        17361
      ],
      "emceeEvents": [
        17271
      ],
      "name": "Raj Desai",
      "twitter": "_rajdesai",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/raj_desai_photo_.png",
      "photoUrl": "/api/img/performer-images/performer-rajdesai-300x300.jpg",
      "sortOrder": 73,
      "excludeFromList": false,
      "bio": "<p>Raj Desai is a writer and stand-up comedian residing in Los Angeles.  He recently wrote for Triumph the Insult Comic Dog&#039;s Hulu specials, for which he was nominated for a 2016 Primetime Emmy Award and a 2017 Writers Guild Award.  He also worked as a writer/blogger on Comedy Central&#039;s &quot;The Jeselnik Offensive&quot; and has had humor pieces published by &quot;The New Yorker&quot; and &quot;McSweeney&#039;s.&quot;</p>\n<p>He has performed stand-up on the &quot;Late Late Show with Craig Ferguson,&quot; &quot;Last Comic Standing,&quot; and Comedy Central’s &quot;Live at Gotham.&quot;   He continues to perform standup around L.A. at The Comedy Store, The Improv, Nerdmelt, UCB and other venues in and outside L.A.</p>\n<p>He has also acted in ABC&#039;s &quot;Fresh Off the Boat&quot; and Comedy Central&#039;s &quot;Hampton Deville,&quot; in addition to playing Reba on the hit sitcom &quot;Reba.&quot;</p>\n",
      "pageUrl": "15957-raj-desai"
    },
    {
      "id": 15748,
      "events": [
        17149,
        17181,
        17206
      ],
      "emceeEvents": [],
      "name": "Gareth Reynolds ",
      "twitter": "reynoldsgareth",
      "website": "http://www.garethreynolds.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/gareth_reynolds_2016.jpg",
      "photoUrl": "/api/img/performer-images/performer-garethreynolds-300x300.jpg",
      "sortOrder": 74,
      "excludeFromList": false,
      "bio": "<p><strong>GARETH REYNOLDS</strong> hails from the sweet streets of Milwaukee, Wisconsin originally. After moving to Los Angeles, Gareth starred in NBC’s ‘The Real Wedding Crashers’ which was as creatively stimulating as it was successful. However, through that show he began producing and writing ooriginal material, eventually making shows at COMEDY CENTRAL, the TRAVEL CHANNEL, and MTV.</p>\n<p>In 2015 he began doing an American History podcast called ‘The Dollop’ with Dave Anthony, which currently gets over 1.3 million downloads each month. The podcast has taken him all over the world to perform it. He just appeared in the ABC show ‘Hail Mary’ in which he is one of the leads and is a writer on NETFLIX original series Flaked. He currently has a development deal with FOX, and he now tours the country doing stand up. He also has a cat named Jose.</p>\n",
      "pageUrl": "15748-gareth-reynolds-"
    },
    {
      "id": 16304,
      "events": [
        17155,
        17169,
        17213
      ],
      "emceeEvents": [
        17173
      ],
      "name": "JR De Guzman",
      "twitter": "jrdeguzm",
      "website": "http://j.deguzman.r@gmail.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/jrdheadshotlowquality.jpg",
      "photoUrl": "/api/img/performer-images/performer-jrdeguzman-300x300.jpg",
      "sortOrder": 75,
      "excludeFromList": false,
      "bio": "<p>Born in the Philippines and raised in California, JR De Guzman began performing comedy while working as a music teacher, which he quickly learned just meant teaching Taylor Swift songs to teenagers. He has entertained all over the world, having performed for Stand-Up Tokyo and ROR Comedy in Japan, the Jokers Ball in Indonesia, the Badaboom Comedy Series in Amsterdam, the Edmonton Comedy Festival, and countless other international shows. Combining music and comedy, JR serenades the audience into laughter with songs, jokes, and stories of traveling the world, life after college, and family. He has shared the stage with Tim Allen, Margaret Cho, Daniel Tosh, Jerrod Carmichael, Iliza Shlesinger, and more. Catch him on Coming to the Stage Season 2 on Hulu, Comedy Central&#039;s Kevin Hart Presents: Hart of the City, and MTV&#039;s Acting Out. Also, check out his debut album on Sirius XM Radio&#039;s Laugh&#039;s USA.</p>\n",
      "pageUrl": "16304-jr-de-guzman"
    },
    {
      "id": 17009,
      "events": [],
      "emceeEvents": [
        17188
      ],
      "name": "Eugene Mirman",
      "twitter": "EugeneMirman",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/eugene_mirman.jpg",
      "photoUrl": "/api/img/performer-images/performer-eugenemirman-300x300.jpg",
      "sortOrder": 2,
      "excludeFromList": false,
      "bio": "<p>Brooklyn resident Eugene Mirman escaped the clutches of Russian communism at the age of four when his family immigrated from Moscow to Lexington, MA (where along with Paul Revere and John Adams he kicked off the American revolution). He attended Hampshire College and designed his own major of Comedy – doing a one-hour standup act as his thesis (for which he was made fun of, don’t worry).</p>\n<p>Eugene currently stars as the voice of “Gene” on Fox’s hit animated series Bob’s Burgers. He is also known for portraying comedian/mobster Yvgeny Mirminsky on Adult Swim’s Delocated, Eugene the landlord on Flight of the Conchords, Dr. Eugene Mirman on Aqua Teen Hunger Force and Eugene, the Russian foreign exchange student, on Home Movies. He is a frequent co-host of Star Talk with Neil deGrasse Tyson and hosts the audio series Hold On with Eugene Mirman for Audible, which has featured such guests as Jim Gaffigan, “Weird Al” Yankovic, and Reggie Watts. Eugene has also appeared on Archer, @Midnight, Inside Amy Schumer, Late Night With Conan O’Brien, Russell Howard’s Good News, Late Night with Seth Myers, Broad City, Last Week Tonight with John Oliver and more.</p>\n<p>Eugene’s comedy special Eugene Mirman: An Evening of Comedy in a Fake Underground Laboratory aired on Comedy Central in 2012 and his most recent special, Vegan on His Way to the Complain Store, premiered on Netflix in 2015. In 2015 he also released a nine-disc vinyl box set on SubPop entitled I’m Sorry (You’re Welcome), which could also be purchased as a chair, a bathrobe, and a puppy.</p>\n<p>Eugene was named Best New York City Comedian by the Village Voice, one of “50 Funniest” by Time Out New York, and one of the 10 best comedians of the last decade by Paste Magazine. Eugene was also named by Rolling Stone as “Hot Twitterer” and keeps his 400k+ followers entertained daily.</p>\n<p>A pioneer of the comedy variety show since the days of Rififi, Eugene co-founded Pretty Good Friends along with Julie Smith Clem, which began as a weekly comedy show in Brooklyn, but grew into tours, large outdoor shows, and TV and radio projects. Out of these shows, Eugene and Julie also created (originally as a joke) the Eugene Mirman Comedy Festival, which is now a yearly institution in Brooklyn and beyond.</p>\n",
      "pageUrl": "17009-eugene-mirman"
    },
    {
      "id": 16261,
      "events": [
        17160,
        17187,
        17202
      ],
      "emceeEvents": [
        17219
      ],
      "name": "T.J. Chambers",
      "twitter": "tjchambersLA",
      "website": "http://www.imdb.com/name/nm3811789/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/17923_10153007202657530_3007057481884671315_n.jpg",
      "photoUrl": "/api/img/performer-images/performer-tjchambers-300x300.jpg",
      "sortOrder": 77,
      "excludeFromList": false,
      "bio": "<p>A 10-year veteran of the Great Stand Up Wars, T.J. Chambers escaped largely unharmed and was later awarded the lauded Presidential Drink Ticket of Freedom. He now whiles away his days as a barely sought-after comedy writer in both his home port of Los Angeles and abroad. Some of his many credits include Betty White&#039;s Off Their Rockers (starring old people!) and Dancing With The Stars (watched by old people!). A few groups of letters that have seen fit to trade him money for jokes are NBC, Fox, MTV, ITV, USA, Syfy, and Channel 4. That one has a number in it! T.J. is proud to return to Bridgetown.</p>\n",
      "pageUrl": "16261-tj-chambers"
    },
    {
      "id": 16177,
      "events": [
        17154,
        17168,
        17169,
        17191
      ],
      "emceeEvents": [
        17206
      ],
      "name": "Andy Erikson",
      "twitter": "andyerikson",
      "website": "http://www.andyerikson.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/160210_erikson-043-940x1410.jpg",
      "photoUrl": "/api/img/performer-images/performer-andyerikson-300x300.jpg",
      "sortOrder": 78,
      "excludeFromList": false,
      "bio": "<p>Andy Erikson’s love of squirrels and unicorns is only surpassed by her love of performing standup comedy. She intertwines silly one liners with whimsical stories in a playful, but thought provoking way. She was once a semi-finalist for the Andy Kaufman award, has won several comedy competitions, and has performed at many prestigious festivals. In 2015 she made her television debut on NBC’s Last Comic Standing, placing in the top 5. She was also featured on The Guest List: Live From The Barrel House on Seeso. In 2016 she was a guest star on Scream Queens on Fox and played Chanel #7. Her favorite thing about comedy is making friends.</p>\n<p>Guest Star on Scream Queens on Fox. (4 episodes, Season 2, 2016)<br />\n3rd place on season 9 of NBC’s Last Comic Standing // 2015<br />\nThe Guest List: Live From the Barrel House // Seeso 2015<br />\n2014 Bridgetown Comedy Fest<br />\nFinalist at the 2013 Great American Comedy Festival<br />\nSelected by Star Tribune as the Best of MN Comedian Tweeter of 2012.<br />\nSemi-Finalist in the 2011 Laughing Skull Comedy Festival<br />\nWinner of the House of Comedy’s 2010 Funniest Person Contest<br />\nSemi-Finalist at the 2009 Boston Comedy Festival<br />\nMember of the 1st place team at Rooftop Comedy’s 2009 National College Comedy Contest in Aspen<br />\nVoted MVP of the National College Comedy Competition at the 2009 Aspen Comedy Festival<br />\n2009 Semi-finalist for the Andy Kaufman Award<br />\nDuluth’s Funniest Person in 2009<br />\n2nd place in the Twin Cities Funniest Person Contest 2008</p>\n",
      "pageUrl": "16177-andy-erikson"
    },
    {
      "id": 16884,
      "events": [
        17158,
        17205,
        17361
      ],
      "emceeEvents": [],
      "name": "Natasha Muse",
      "twitter": "NatashaMuse",
      "website": "http://NatashaMuse.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/natashamuseplantsmallerfile.jpg",
      "photoUrl": "/api/img/performer-images/performer-natashamuse-300x300.jpg",
      "sortOrder": 79,
      "excludeFromList": false,
      "bio": "<p>Natasha Muse is like the C3P0 of San Francisco comedy: a bunch of small bears once mistook her for a golden god but in reality she’s a bumbling robot (as well as a mom, a transsexual, and a firm agnostic). The SF Weekly once declared her a “Comedian to Watch” in 2014, and in 2016 they upgraded her to an “Artist to Watch.” Natasha features at the SF Punchline and Cobb’s Comedy Club, and has worked with such comedy luminaries as Maria Bamford, Roseanne Barr, Janeane Garofalo, Wyatt Cenac, and God.<br />\nNatasha’s comedy is so good, it’s not even funny.</p>\n",
      "pageUrl": "16884-natasha-muse"
    },
    {
      "id": 16021,
      "events": [
        17175,
        17210
      ],
      "emceeEvents": [
        17192
      ],
      "name": "Kathleen Kanz",
      "twitter": "",
      "website": "http://www.kathleenkanz.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/tbs_1336_ret_kathleenkanz_sm.jpg",
      "photoUrl": "/api/img/performer-images/performer-kathleenkanz-300x300.jpg",
      "sortOrder": 80,
      "excludeFromList": false,
      "bio": "<p>Kathleen Kanz is the winner of the 2016 Vermont’s Funniest Comedian contest and the first woman to hold that title.  In January 2016, she featured for Gilbert Gottfried, the first headliner at the brand new Vermont Comedy Club.  She’s been producing and performing comedy in Vermont since 2007.  Her style favors compact jokes containing twisted logic.  She’s the founder of two popular and successful annual events: the Green Mountain Comedy Festival (2009), and Comic Relief - A Benefit for COTS (2013).  She has jokes in two books, “She&#039;s So Funny” and “Squeaky Clean Comedy” and was published in the debut issue of &quot;Swivel – The Nexus of Women &amp; Wit&quot;.</p>\n",
      "pageUrl": "16021-kathleen-kanz"
    },
    {
      "id": 16602,
      "events": [
        17155,
        17165,
        17190
      ],
      "emceeEvents": [],
      "name": "Josh Johnson",
      "twitter": "joshjohnson",
      "website": "http://therealjoshjohnson.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/josh_johnson_-_photo_1.jpg",
      "photoUrl": "/api/img/performer-images/performer-joshjohnson-300x300.jpg",
      "sortOrder": 81,
      "excludeFromList": false,
      "bio": "<p>Josh Johnson, most recently featured on Kevin Hart's “Hart of the City” on Comedy Central, was named one of Comedy Central's Comics to Watch in 2015 and a ‘New Face’ at the Just For Laughs Comedy Festival in 2016. Currently a writer for “The Tonight Show Starring Jimmy Fallon” and with a calendar filled with festivals and over 70+ college dates this year alone, he is quickly becoming one of the fastest rising stars of the year. A native of Louisiana and Chicago-bred comic, Josh has performed at festivals across the country such as Bridgetown, Out of Bounds, New York Comedy Festival, and Riot LA. Josh was a 2014 NBC Stand Up for Diversity semifinalist, and the 2015 winner of Snubfest in Chicago and the Devil Cup in New York.</p>\n<p> ‘[Josh] Johnson is only 24 years old and probably shouldn’t be this good this soon.’ - The Chicago Tribune</p>\n<p>‘and we can’t do a list without mentioning Josh Johnson, who has some killer material and is going to be a serious powerhouse’- Interrobang<strong> </strong></p>\n",
      "pageUrl": "16602-josh-johnson"
    },
    {
      "id": 16670,
      "events": [
        17155,
        17167,
        17175,
        17191,
        17216
      ],
      "emceeEvents": [],
      "name": "Zach Sherwin",
      "twitter": "zachsherwin",
      "website": "http://www.zachsherwin.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/zach_sherwin.jpg",
      "photoUrl": "/api/img/performer-images/performer-zachsherwin-300x300.jpg",
      "sortOrder": 82,
      "excludeFromList": false,
      "bio": "<p>Zach Sherwin is a Los Angeles-based comedian, writer, rapper, and actor whose YouTube videos have been viewed over 400 million times. He has appeared on “America’s Got Talent” (NBC), “Totally Biased with W. Kamau Bell” (FX, FXX), and “The Pete Holmes Show” (TBS), written for the Emmy-nominated shows “Epic Rap Battles of History” (YouTube) and “Crazy Ex-Girlfriend” (The CW), and released albums on Comedy Central Records, A Special Thing Records, and Bandcamp. He is also the creator and host of “Watch Your Language,” a weekly half-hour talk show on Alpha, Nerdist’s streaming-video-on-demand platform. Time Out LA named him one of their &quot;Comedians To Watch For 2017.&quot;</p>\n",
      "pageUrl": "16670-zach-sherwin"
    },
    {
      "id": 16107,
      "events": [
        17157,
        17175,
        17249,
        19056
      ],
      "emceeEvents": [
        17216
      ],
      "name": "Katie Nguyen",
      "twitter": "ktnuggin",
      "website": "http://katie-nguyen.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/katienguyen-95_900x600pxl.jpg",
      "photoUrl": "/api/img/performer-images/performer-katienguyen-300x300.jpg",
      "sortOrder": 83,
      "excludeFromList": false,
      "bio": "<p>Katie Nguyen writes and performs stand-up, improv, and sketch. She is an ensemble member at the Brody Theater and has performed at SF Sketchfest, the Stumptown Improv Fest, and the Bridgetown Comedy Festival. Katie is a host of the show Earthquake Hurricane, was named one of the Portland Mercury&#039;s Undisputable Geniuses of Comedy, and was a finalist in the Portland&#039;s Funniest Person contest.</p>\n",
      "pageUrl": "16107-katie-nguyen"
    },
    {
      "id": 16212,
      "events": [
        17164,
        17203,
        17218
      ],
      "emceeEvents": [],
      "name": "Nathan Brannon",
      "twitter": "nathanbrannon",
      "website": "http://www.nathanbrannon.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/20160728_094253_2_0.jpg",
      "photoUrl": "/api/img/performer-images/performer-nathanbrannon-300x300.jpg",
      "sortOrder": 84,
      "excludeFromList": false,
      "bio": "<p>Bio: \" Nathan is a comedian out of Portland, Oregon, who is consistently adding to his list of accomplishment year after year.  In 2016, Nathan recorded his second album, titled 'Because', with distinguished record label Kill Rock Stars. Nathan also signed with Kill Rock Stars in 2015, was the winner of the Seattle International Comedy Competition in 2014, voted into the Willamette Week's \"Portland's Funniest 5\" in 2013 while releasing his first comedy album \"I Black Out\" that same year, and was crowned “Portland’s Funniest Person” in 2012.</p>\n<p>He has been featured on national programs such as NPR's 'Weekend Edition,' and 'Laughs' on Fox. Nathan has also opened for national headliners such as Dave Chappelle, Damon Wayans, Maria Bamford, and has photoshopped himself into photos with many more. Currently, Nathan is seeking a funnier way to end this paragraph. \"</p>\n",
      "pageUrl": "16212-nathan-brannon"
    },
    {
      "id": 15923,
      "events": [
        17159,
        17164,
        17193
      ],
      "emceeEvents": [
        17281
      ],
      "name": "Gabe Dinger",
      "twitter": "GabeDinger",
      "website": "http://www.GabeDinger.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/_eep5822.jpg",
      "photoUrl": "/api/img/performer-images/performer-gabedinger-300x300.jpg",
      "sortOrder": 85,
      "excludeFromList": false,
      "bio": "<p>Portland native, Gabe Dinger, has been making audiences laugh for the last 10 years. His sharp wit, irreverent observations, and ability to improvise make Gabe’s shows varied and exciting. He has performed at several comedy festivals, including: Bridgetown Comedy Festival, Laughing Skull, and SF Sketchfest. As a member of the improv troupe Whiskey Tango, he has also performed in the LA Improv Festival, SF Sketchfest, and the Del Close Marathon in New York City. More notably Gabe was recently on Fuse TV&#039;s new show &quot;Uproarious&quot;, and was featured in Big Freeda&#039;s video &quot;Make It Jingle&quot;.</p>\n",
      "pageUrl": "15923-gabe-dinger"
    },
    {
      "id": 15951,
      "events": [
        17158,
        17170,
        17192,
        17214
      ],
      "emceeEvents": [],
      "name": "Pat Brown",
      "twitter": "patbrownshow",
      "website": "http://www.comedianpatbrown.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/pat-brown-sidelean2.jpg",
      "photoUrl": "/api/img/performer-images/performer-patbrown-300x300.jpg",
      "sortOrder": 86,
      "excludeFromList": false,
      "bio": "<p>Pat Brown is a well regarded comedy writer and seasoned performer. Her style can be summed up as smart playfulness wrapped in social commentary. She finds humor in the small--the routine of her daily life and the big--the complexities of human behavior and she makes jokes about both with clever insightfulness.</p>\n<p>Proudly and forever a ‘tomgirl,’ Pat grew up in Kansas City, MO, an oasis for an active kid that loved sports, outdoors and good barbeque. Pat grew up surrounded by funny, her father and brother were an endless source of entertainment. Pat became aware of her talent for comedy during many after school ‘hanging out’ sessions in the company of her small, diverse band of friends.  Her gift became more widely recognized in high school and she was voted “Most Humorous” in her senior year.</p>\n<p>Pat attended S.C.S.U. on a basketball scholarship, where she graduated with a degree in Theatre.  She then moved to Atlanta, GA, where she bounced around in several fields until she found stand up comedy. She debuted as a stand up at the Comedy Act Theatre. She also performs improv with UCB, Blacktop Circus and Laughing Matters.</p>\n<p>Pat&#039;s film appearances include: 2015 White Water as Sophie, TVOne’s Original Movie, Blood Ties, starring Zoe Saldana, Three Can Play That Game, starring Vivica A. Fox, and Somebodies as Aunt Agnes.</p>\n<p>Her TV appearances include: Fuse TV Uproarious, Gotham Axis Live, Laughs on Fox, BET Comic View, Bounce TV’s Off The Chain, NBC Comic’s Unleashed, Comedy Central’s Laffapalooza</p>\n<p>AWARDS<br />\n2013 Winner “She Devil Comedy Competition”<br />\n2007 Winner “Best Female Comic” at Las Vegas Comedy Competition</p>\n",
      "pageUrl": "15951-pat-brown"
    },
    {
      "id": 16276,
      "events": [
        17152,
        17169,
        17205,
        17210
      ],
      "emceeEvents": [],
      "name": "Nick Sahoyah",
      "twitter": "sahoyah",
      "website": "http://facebook.com/nicksahoyah",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/80s.png",
      "photoUrl": "/api/img/performer-images/performer-nicksahoyah-300x300.jpg",
      "sortOrder": 87,
      "excludeFromList": false,
      "bio": "<p>Nick Sahoyah started his comedy career in the summer of 2010 at a gross coffee shop on Capitol Hill. Since then he has had the pleasure of performing stand up across the country participating in festivals such as Limestone Comedy Festival, Out of Bounds, The Comedy Exposition, Hell Yes Fest, and SF Sketchfest,. In Seattle he cohosts the live talk show Not Too Late with Elicia Sanchez at Eclectic Theater, and QTPOC Is Not A Rapper, a showcase and mic at Scratch Deli. Aside from stand up, you may recognize Nick from his web show 8-Hit Gaming, his short film Poster Boy! on vimeo, or his appearance in the feature length Jinkx Monsoon documentary Drag Becomes Him.</p>\n",
      "pageUrl": "16276-nick-sahoyah"
    },
    {
      "id": 16464,
      "events": [
        17156,
        17196,
        17213,
        17250
      ],
      "emceeEvents": [],
      "name": "Sara June",
      "twitter": "heysarajune",
      "website": "http://www.heysarajune.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/sara_june_with_plaid_medium.jpeg",
      "photoUrl": "/api/img/performer-images/performer-sarajune-300x300.jpg",
      "sortOrder": 88,
      "excludeFromList": false,
      "bio": "<p>Sara June is a comedian based in Los Angeles. She’s performed at Fun Fun Fun Fest, SF Sketchfest and Riot LA; she also makes surreal sketch videos, which you can watch on heysarajune.com.</p>\n",
      "pageUrl": "16464-sara-june"
    },
    {
      "id": 16199,
      "events": [
        17163,
        17193,
        17218,
        17280
      ],
      "emceeEvents": [],
      "name": "Mekki Leeper",
      "twitter": "MekkiLeeper",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot_-_mekki_leeper.jpg",
      "photoUrl": "/api/img/performer-images/performer-mekkileeper-300x300.jpg",
      "sortOrder": 89,
      "excludeFromList": false,
      "bio": "<p>Mekki Leeper is a comedian based out of Philadelphia. He performs regularly at Good Good Comedy Theater, Helium Comedy Club, and has quickly become a staple in the Philadelphia comedy scene. He also produces shows like Focus Group, Trending Topics, Digital Graffiti, and JUST RIGHT. His work has been featured on NPR, Huffington Post, and College Humor.</p>\n",
      "pageUrl": "16199-mekki-leeper"
    },
    {
      "id": 15897,
      "events": [
        17181,
        17204,
        17275,
        17281
      ],
      "emceeEvents": [],
      "name": "Julia Claire",
      "twitter": "ohjuliatweets",
      "website": "http://www.julia-claire.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/julia-claire-b46a3663-10-1.jpg",
      "photoUrl": "/api/img/performer-images/performer-juliaclaire-300x300.jpg",
      "sortOrder": 90,
      "excludeFromList": false,
      "bio": "<p>Julia is a comedian and writer based in New York City, by way of Boston. Pedaling her sharp, almost always self-deprecating jokes, she quickly became a staple in the Boston comedy scene, performing at bar shows, clubs and colleges all over the East Coast and beyond. She has performed in the Boston Comedy Festival, the Limestone Comedy Festival, the Brooklyn Comedy Festival and the New York Comedy Festival, and has opened for Aparna Nancherla, Beth Stelling, Mark Normand, Charlie Pickering, Carmen Lynch, and SNL&#039;s Aidy Bryant. Since moving to New York she has performed in venues all over the city including UCB and Night Train at Littlefield. She has been featured on NPR&#039;s You&#039;re the Expert and Nerdist&#039;s Competitive Erotic Fan Fiction.</p>\n",
      "pageUrl": "15897-julia-claire"
    },
    {
      "id": 16519,
      "events": [
        17157,
        17219,
        17233,
        17249,
        19056
      ],
      "emceeEvents": [],
      "name": "Tom Thakkar",
      "twitter": "tomathakkar",
      "website": "http://tomthakkar.tumblr.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/9171_10106863273157439_7810243713824647968_n.jpg",
      "photoUrl": "/api/img/performer-images/performer-tomthakkar-300x300.jpg",
      "sortOrder": 91,
      "excludeFromList": false,
      "bio": "<p>Tom Thakkar (formerly Thomas Brady) is a comic living in Brooklyn by way of Bloomington, IN and Chicago. He is the son of a great, Red Lobster-managing mom and a deadbeat Indian dad, giving him the odd childhood experience of being a poor, pudgy Indian boy in southern Indiana. In 2015, Tom was named a “New Face” by the Just for Laughs comedy festival in Montreal, as well as one of the “Best of the Midwest” by Gilda’s Laugh Fest. Ole Tom Thakkar has also been a featured performer at Limestone Comedy Festival, Chicago Comedy Exposition, Crom Fest Omaha, and more. Tom has been featured on Doug Loves Movies, VICE, NPR, The Todd Glass Show, PBS, and was named a &quot;Comedian you should know&quot; by Chicago Magazine. You can see Tom all over New York, opening for Nikki Glaser all over the country, or standing outside of a Chipotle trying to decide if he&#039;s earned it that day.</p>\n",
      "pageUrl": "16519-tom-thakkar"
    },
    {
      "id": 15738,
      "events": [
        17148,
        17180,
        17187,
        17217
      ],
      "emceeEvents": [],
      "name": "Sonia Denis",
      "twitter": "sonideni",
      "website": "http://sonideni.tumblr.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/sonia_denis_-_headshot.jpg",
      "photoUrl": "/api/img/performer-images/performer-soniadenis-300x300.jpg",
      "sortOrder": 92,
      "excludeFromList": false,
      "bio": "<p>Sonia is a NYC-based comedian who recently relocated from Chicago. She was honored as a Comedy Central 2016 Comic to Watch at the New York Comedy Festival, and is currently on tour with her live show “Afrofuturism” in DC and Chicago through the Second City Touring Company. </p>\n",
      "pageUrl": "15738-sonia-denis"
    },
    {
      "id": 16502,
      "events": [
        17155,
        17173,
        17216
      ],
      "emceeEvents": [
        17165
      ],
      "name": "Matt Lieb",
      "twitter": "lieb123456789",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/matt_lieb_headshot_2.jpg",
      "photoUrl": "/api/img/performer-images/performer-mattlieb-300x300.jpg",
      "sortOrder": 93,
      "excludeFromList": false,
      "bio": "<p>Matt Lieb is a comic and comedy writer from San Francisco, where he was named one of the &quot;Best Comedians in the Bay Area&quot; by SFist and Courting Comedy. Matt is a correspondent on The Star Wars Show on StarWars.com, a writer/performer on Al Jazeera&#039;s only comedy show Newsbroke, and staff writer for Audible&#039;s original series &quot;Bedtime Stories for Cynics with Nick Offerman.&quot; Matt&#039;s stand up was featured on the show &quot;Flophouse&quot; on VICELAND, &quot;The Guest List&quot; on SeeSo, Gabriel Iglesias&#039; &quot;Stand Up Revolution Radio&quot; on SiriusXM, and is featured on Hulu.</p>\n",
      "pageUrl": "16502-matt-lieb"
    },
    {
      "id": 16790,
      "events": [
        17152,
        17175,
        17189,
        17260
      ],
      "emceeEvents": [],
      "name": "Arish Singh",
      "twitter": "arishish",
      "website": "http://www.arishcomedy.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/arish_singh_head1.jpg",
      "photoUrl": "/api/img/performer-images/performer-arishsingh-300x300.jpg",
      "sortOrder": 94,
      "excludeFromList": false,
      "bio": "<p>The comedy of Arish Singh, with its unique fusion of absurdist humor and political commentary, has been praised by many, and described by others as, “Yeah, just not my thing.” Singh has opened for national acts like Tim Heidecker (Tim &amp; Eric), Hasan Minhaj (The Daily Show) and Kamau W. Bell (Totally Biased), and has performed on stand-up showcases like Hot Tub with Kurt Braunohler &amp; Kristen Schaal, Andy Kindler’s Particular Show and Chicago’s Comedians You Should Know. In 2016, Singh was featured in the Chicago Comedy Exposition, the Milwaukee Comedy Festival, Green Gravel Comedy Festival and Minneapolis&#039;s 10,000 Laughs. In 2017, he was featured in the Indie Orlando Comedy Festival, the Memphis Comedy Festival, and the Crom Comedy Festival.</p>\n<p>Singh appeared in the Triumph the Insult Comic Dog 2016 Election Special, but as a political protester, not a comedian. In January 2016, Singh made national news for protesting at a Donald Trump rally where he and fellow comedian and activist Taylor Williams were ejected for unfurling a banner reading &quot;stop hate.&quot; Singh followed up by putting on fundraiser stand-up shows for CAIR and the Sikh Coalition, two groups committed to fighting hate crimes. He used the shows to discuss how the right&#039;s political use of Islamophobia has affected life for Sikhs and Muslims and other minority groups in the United States.</p>\n<p>Singh co-produces SolidHilarity, a comedy show that fundraises for activist groups and labor unions, and he is a proud contributor to the pungently political and humorous podcasts of the “dirtbag left,” such as Street Fight Radio and the Katie Halper show, a program where he discussed the outcome of the election with comedian Judah Friedlander. Singh believes, more than ever, another world is possible: Chardi Kala.</p>\n",
      "pageUrl": "16790-arish-singh"
    },
    {
      "id": 16103,
      "events": [
        17159,
        17169,
        17214,
        17234
      ],
      "emceeEvents": [],
      "name": "John Novosad",
      "twitter": "HippiemansPlan",
      "website": "http://hippieman.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/img_8358email.jpg",
      "photoUrl": "/api/img/performer-images/performer-johnnovosad-300x300.jpg",
      "sortOrder": 95,
      "excludeFromList": false,
      "bio": "<p>My name is John Novosad. I am from Boulder, Colorado. I am based out of the Comedy Works in Denver, Colorado. I am a stand-up comic. I tour nationally. I was married for eleven years. I am divorced. We did not have any children. I’m six feet tall. I weigh one hundred and ninety-three pounds. I first did stand-up in 1980. I toured extensively between 1985 and 1993. I worked a day job and did comedy part-time from 1994 through 2001. I have been a full-time comic since 2002. Performing stand-up is great fun. It drives me to open mics on my nights off. </p>\n<p>My credits include:<br />\nWinner of the Laughing Skull Comedy Festival competition 2016<br />\nWinner of the Laughlin Comedy Festival competition 2015<br />\nComedy Exposition 2016<br />\nHigh Plains Comedy Festival 2016, 2015, 2013<br />\nAspen Laff Festival 2015, 2014<br />\nFeatured performer at the Comedy Works in Denver, Colorado<br />\nTwo appearances on the Late Late Show with Craig Ferguson<br />\nOne appearance on Bryon Allen’s Comedy.TV</p>\n",
      "pageUrl": "16103-john-novosad"
    },
    {
      "id": 16487,
      "events": [
        17159,
        17181,
        17193
      ],
      "emceeEvents": [],
      "name": "Kara Klenk",
      "twitter": "karaklenk",
      "website": "http://www.karaklenk.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/img_3215_small.jpg",
      "photoUrl": "/api/img/performer-images/performer-karaklenk-300x300.jpg",
      "sortOrder": 96,
      "excludeFromList": false,
      "bio": "<p>Kara Klenk is a stand up comic, writer, and actor who grew up in Connecticut, the no-one-proclaimed comedy capital of New England. She was recently named by Time Out New York as one of the Top 10 Funniest Women in NYC, and the overwhelming fame that followed drove her to Los Angeles, where she currently resides.</p>\n<p>Kara has appeared on several cable channels and websites and has written for Nickelodeon, MTV, TVLand, and Comedy Central. She also produces/hosts a long-running stand up show, If You Build It, at the Upright Citizen's Brigade Theater in NYC and LA. </p>\n<p>It took her 2 weeks to learn Snapchat, but she's got it now.</p>\n<p> </p>\n<p> </p>\n",
      "pageUrl": "16487-kara-klenk"
    },
    {
      "id": 16147,
      "events": [
        17155,
        17219,
        17235,
        17320
      ],
      "emceeEvents": [],
      "name": "Carolyn Busa",
      "twitter": "misstoiletslave",
      "website": "http://www.carolynbusa.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/carolyn.jpg",
      "photoUrl": "/api/img/performer-images/performer-carolynbusa-300x300.jpg",
      "sortOrder": 97,
      "excludeFromList": false,
      "bio": "<p>Carolyn Busa began her comedy career on the stages of poorly-lit bars all over Philadelphia. She now lives in NYC and has performed at the Bridgetown Comedy Festival, Boston Comedy Festival, &amp; on Good Day New York. She is the proud creator &amp; producer of Side Ponytail, a stand-up comedy show in Brooklyn rated a Time Out NY Critic&#039;s Pick. Carolyn is also the creator of the Instagram account OnlySeatTaken featured on Gothamist and Daily Mail. She may have even unsuccessfully auditioned for America&#039;s Next Top Model. Twice</p>\n",
      "pageUrl": "16147-carolyn-busa"
    },
    {
      "id": 16912,
      "events": [
        17150,
        17194,
        17198,
        17233
      ],
      "emceeEvents": [],
      "name": "Barbara Gray",
      "twitter": "BabsGray",
      "website": "http://myjokesareuphere.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/heartsheadshot-lo_0.jpg",
      "photoUrl": "/api/img/performer-images/performer-barbaragray-300x300.jpg",
      "sortOrder": 98,
      "excludeFromList": false,
      "bio": "<p>Big hair. Big heart. Big mouth. Barbara’s ebullient and goofy stage presence combined with vulnerable dark material have made her a quickly rising star in the Los Angeles alternative comedy scene. In 2016 she filmed sets for Viceland’s “Flophouse” and Hulu’s “Coming to the Stage” and she has written for the past three seasons of the hit show “Billy on the Street”. She recently co-starred in Comedy Central’s new series “Hampton DeVille” as well as their digital series “Would You Rather”, “Deadliest Chef”, and Nick Swardson’s show “Typical Rick”. </p>\n<p>Along with touring all over the country, Babs has made multiple visits to SF Sketchfest and the Bridgetown Comedy Festival, where her performance was deemed ‘funny as get-out’ by the Portland Mercury. Her comedy has been featured on Huffington Post and Ellen, and her underground comedy show One-Two Punch, run out of her own living room in Silverlake, had a spread in the LA Times. She is also a regular at the top shows and venues in Los Angeles, including the Improv, Comedy Store, Meltdown, Good Heroin, and literally any place somebody will put a microphone and give her some attention. </p>\n<p>Barbara is also a co-host of the hit podcast “Lady to Lady”, which recently surpassed 2 million downloads from listeners all over the world. The live talk show can be seen at the Upright Citizen’s Brigade Theater and the Hollywood Improv. The show combines the roundtable discussions of The View with the antics and characters of Pee-Wee’s Playhouse. Described as “The funniest podcast ever” by BUST magazine, the ladies talk pop culture, politics, and embarrassing personal revelations. Find it on the Maximum Fun network or wherever you listen to podcasts. </p>\n<p>Follow Barbara on twitter at @BabsGray and check out her website <a href=\"http://www.myjokesareuphere.com\">www.myjokesareuphere.com</a>.</p>\n",
      "pageUrl": "16912-barbara-gray"
    },
    {
      "id": 16801,
      "events": [
        17151,
        17218,
        17250
      ],
      "emceeEvents": [
        17260
      ],
      "name": "David Perdue",
      "twitter": "dueordie",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/img_6701.jpg",
      "photoUrl": "/api/img/performer-images/performer-davidperdue-300x300.jpg",
      "sortOrder": 99,
      "excludeFromList": false,
      "bio": "<p>David Perdue is an Atlanta based comedian who has been on Kevin Hart Presents: &quot;Hart of the City&quot; on Comedy Central, &amp;  &quot;Uproarious&quot; on Fuse TV. In 2016 he was the Laughing Skull Festival&#039;s &quot;Set List Tournament Champion,&quot; and was a 2016 Laughing Skull Festival semi-finalist. He was selected by Creative Loafing Atlanta as one of 2017&#039;s People to Watch. He co-hosts a weekly sports/comedy podcast called Forth and Ten, and is the co-producer for the award winning show and Atlanta favorite 1AM Secret Show.</p>\n",
      "pageUrl": "16801-david-perdue"
    },
    {
      "id": 16922,
      "events": [
        17158,
        17216
      ],
      "emceeEvents": [
        17168
      ],
      "name": "Whitney Streed",
      "twitter": "whitneystreed",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/whitney.jpg",
      "photoUrl": "/api/img/performer-images/performer-whitneystreed-300x300.jpg",
      "sortOrder": 100,
      "excludeFromList": false,
      "bio": "<p>Whitney Streed is a comedian because if they were not, their incessant punning would have no artistic or monetary value whatsoever. Whitney performs stand-up in and around the Pacific Northwest and has featured for Maria Bamford, Rob Delaney, Jackie Kashian, and other rad individuals. Festival appearances include Seattle Sketchfest, Bumbershoot, Salt Lake City Comedy Carnivale, and All Jane Comedy Festival in Portland. They have also been a part of Portland's Bridgetown Comedy Festival as a performer and, since 2013, a producer. Whitney can be seen hosting shows around Portland including the superfun comedy game show \"Rants Off/ Dance Off.\"</p>\n",
      "pageUrl": "16922-whitney-streed"
    },
    {
      "id": 15905,
      "events": [
        17151,
        17176,
        17210
      ],
      "emceeEvents": [
        17203
      ],
      "name": "Kenice Mobley",
      "twitter": "kfmawesomeness",
      "website": "http://www.kenicemobley.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot_kenice_mobley.jpg",
      "photoUrl": "/api/img/performer-images/performer-kenicemobley-300x300.jpg",
      "sortOrder": 101,
      "excludeFromList": false,
      "bio": "<p>Kenice performs stand up comedy around the country and recently participated in the Women in Comedy Festival, the Boston Comedy Festival, and the Outside the Box Festival. She recently appeared on WGBH discussing comedy and politics and will be featured in the upcoming season of Laughs on FOX. She has opened for W. Kamau Bell at the Wilbur Theater and was named Comic in Residence (November 2016) for the Comedy Studio in Harvard Square. She currently hosts Person About Town, an interview and relationship podcast. Her jokes usually center around dating, race and her eccentric Southern family; her mother is very proud.</p>\n",
      "pageUrl": "15905-kenice-mobley"
    },
    {
      "id": 15858,
      "events": [
        17151,
        17182,
        17215,
        17260
      ],
      "emceeEvents": [],
      "name": "Brodie Reed",
      "twitter": "ayobrobro",
      "website": "http://brodiereed.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/surewhynot.jpg",
      "photoUrl": "/api/img/performer-images/performer-brodiereed-300x300.jpg",
      "sortOrder": 102,
      "excludeFromList": false,
      "bio": "<p>Brodie is a Los Angeles native who translates a tough, unconventional childhood into an act that expresses the desire to be understood on a broader emotional spectrum while also chronicling the pursuit of comfort. Black, nerdy, politically conscious, he has been slowing rising through the ranks of the LA comedy scene, featured in dozens of sketches, and performing at venues like the Improv. He transitions from Black Lives Matter to Star Trek material with a genuine, trademark giggl</p>\n",
      "pageUrl": "15858-brodie-reed"
    },
    {
      "id": 16265,
      "events": [
        17152,
        17199,
        17217,
        17272
      ],
      "emceeEvents": [],
      "name": "Bret Raybould",
      "twitter": "BretRaybould",
      "website": "http://bretraybould.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/bridgetown_w2.jpg",
      "photoUrl": "/api/img/performer-images/performer-bretraybould-300x300.jpg",
      "sortOrder": 103,
      "excludeFromList": false,
      "bio": "<p>Bret Raybould is a stand up comedian, writer, and director.  Kansas-born, he’s now a staple of the New York stand up and sketch comedy scenes. He performs all over the city and has helped write monologues for Conan on TBS, articles/videos for CollegeHumor, and news journalism for NowThis. Currently, Bret is a member of the sketch comedy group The Raybould Brothers (the other members include his actual brother Jordan Raybould and close friend Dan D’Agnes who came up with the name).  Their work has been featured on Huffington Post, Paste Magazine, and Funny or Die.</p>\n",
      "pageUrl": "16265-bret-raybould"
    },
    {
      "id": 17143,
      "events": [
        17181,
        17206
      ],
      "emceeEvents": [
        17149
      ],
      "name": "Josh Androsky",
      "twitter": "ShutUpAndrosky",
      "website": "http://joshandroskybio.tumblr.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/13307445_10153840200297858_4169680888822451215_n.jpeg",
      "photoUrl": "/api/img/performer-images/performer-joshandrosky-300x300.jpg",
      "sortOrder": 104,
      "excludeFromList": false,
      "bio": "<p>Josh Androsky quit high school early to pursue his love of television. By 20, he was a full time writer. When he was like 22 he wrote/produced FOX’s New Year’s Eve Live. Weird, right? Scott Weiland was there and it went about the way you’d assume. At 23, Josh started doing stand-up comedy and has since performed at festivals and venues across the nation, appeared on This American Life, SyFy’s Sharkmania, and contributes to VICE among other corporately-owned counterculture outlets, including several appearances on VICELAND’s stand-up house party series “Flophouse,” oh and one time he ate shrooms and <a href=\"http://t.umblr.com/redirect?z=http%3A%2F%2Fblogs.laweekly.com%2Finformer%2F2012%2F08%2Fjosh_androsky_la_comedian_skateboard_rabbi_price_is_right.php&amp;t=Y2IwYmYzMmZmNmFjMTE1NmMyYTRkNmEzYWQ3MWE4NmI2NWFkNmRmNSxXb1lnVlFGSw%3D%3D&amp;b=t%3AP2p8OCv472R-X_t62XwZWw&amp;p=http%3A%2F%2Fjoshandroskybio.tumblr.com%2Fpost%2F114347318912%2Flong-bio&amp;m=1\" target=\"_blank\">got weird as The Skateboard Rabbi on The Price is Right</a>. Throughout it all, his love of writing for television has only intensified. He has written for truTV’s “Billy on the Street,” Nickelodeon’s “SpongeBob SquarePants,” and most recently sold a digital series to Comedy Central where he flew to Manhattan and harassed Donald Trump called “<a href=\"http://t.umblr.com/redirect?z=https%3A%2F%2Fyoutu.be%2FyOhPD0MDCs4&amp;t=ZDdlNjViOTY2Njk5NjJiZjlkYWY5OTg5MjViYzNiN2RiNjhkYmFjOSxXb1lnVlFGSw%3D%3D&amp;b=t%3AP2p8OCv472R-X_t62XwZWw&amp;p=http%3A%2F%2Fjoshandroskybio.tumblr.com%2Fpost%2F114347318912%2Flong-bio&amp;m=1\" target=\"_blank\">Trolling For Greatness</a>.” So yeah, at the end of the day, his cat could not be happier for him.</p>\n",
      "pageUrl": "17143-josh-androsky"
    },
    {
      "id": 16754,
      "events": [
        17148,
        17179,
        17216
      ],
      "emceeEvents": [
        17199
      ],
      "name": "Nasser Khan",
      "twitter": "khanfartist",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/nasser_khan.jpg",
      "photoUrl": "/api/img/performer-images/performer-nasserkhan-300x300.jpg",
      "sortOrder": 105,
      "excludeFromList": false,
      "bio": "<p>Originally from Northern California, Nasser Khan is a comedian who has made NYC his home while he continues the search for the perfect laugh and the best croissant. He has performed all around the country and was featured in the Crosstown Comedy Festival. You can find him on Twitter as @khanfartist. Hit him up with your favorite croissant recs!</p>\n",
      "pageUrl": "16754-nasser-khan"
    },
    {
      "id": 15767,
      "events": [
        17156,
        17196,
        17235,
        17361
      ],
      "emceeEvents": [],
      "name": "Casey Crawford",
      "twitter": "caseycrawford78",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/casey_headshot.jpg",
      "photoUrl": "/api/img/performer-images/performer-caseycrawford-300x300.jpg",
      "sortOrder": 106,
      "excludeFromList": false,
      "bio": "<p>Casey Crawford is a stand up comedian originally from South Dakota now living in Boston. He tells short, dumb jokes in the style of Emo Philips, Steven Wright, and Zach Galifianakis. You might like Casey if you like those guys. Casey has participated in the Green Gravel Comedy Festival, the Limestone Comedy Festival, the Boston Comedy Festival, and the 2016 New Faces un-repped category at the Just For Laughs Festival.</p>\n",
      "pageUrl": "15767-casey-crawford"
    },
    {
      "id": 16042,
      "events": [
        17217,
        17234,
        17275
      ],
      "emceeEvents": [
        17164
      ],
      "name": "Zak Toscani",
      "twitter": "zaktoscani",
      "website": "http://www.zaktoscani.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/1502.jpg",
      "photoUrl": "/api/img/performer-images/performer-zaktoscani-300x300.jpg",
      "sortOrder": 107,
      "excludeFromList": false,
      "bio": "<p>Zak Toscani is a stand-up comedian and writer who currently lives in Los Angeles. Physically born in Ohio and comically born in Portland, Zak’s comedy career has taken him across the United States and even into Canada once. He has performed multiple times at the Bumbershoot Music &amp; Arts Festival and the Bridgetown Comedy Festival.</p>\n",
      "pageUrl": "16042-zak-toscani"
    },
    {
      "id": 16508,
      "events": [
        17173,
        17176,
        17281
      ],
      "emceeEvents": [
        17152
      ],
      "name": "Andrew Orolfo",
      "twitter": "Andrew_orolfo",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/fullsizerender_0.jpg",
      "photoUrl": "/api/img/performer-images/performer-andreworolfo-300x300.jpg",
      "sortOrder": 108,
      "excludeFromList": false,
      "bio": "<p>History tells us that Andrew Orolfo was never born, but created. In some cultures, their stories suggest he emerged from the magma of an active volcano, unaffected by it&#039;s immense temperatures. His only purpose is to wander the world and document his explorations. After an expedition that lasted for decades, he became lost, with no one to share his discoveries. But then he found himself in a place called the Bay Area where he was introduced to stand-up comedy. Now he is able to reveal his tales of what he was and what he has yet to become.</p>\n",
      "pageUrl": "16508-andrew-orolfo"
    },
    {
      "id": 16503,
      "events": [
        17151,
        17169,
        17235
      ],
      "emceeEvents": [
        17249
      ],
      "name": "Stephen Agyei",
      "twitter": "Stephenagyei",
      "website": "http://StephenAgyei.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/12466123_10153822141765420_1574491555529955152_o.jpg",
      "photoUrl": "/api/img/performer-images/performer-stephenagyei-300x300.jpg",
      "sortOrder": 109,
      "excludeFromList": false,
      "bio": "<p>One of Riot LA comedy festival&#039;s comics to watch (2017), Stephen Agyei has the whitest teeth in Denver. One of the city&#039;s most sought-after comedians shines as brightly as his mischievous smile, not to mention a style described as “calculated fearlessness.” A regular at Comedy Works, Stephen has opened for some of the most prominent comedians in the country. The Limestone Comedy Festival alum (2016) has toured internationally in South Korea, and was hand picked by Duncan Trussell to open for his most recent &quot;I am God&quot; tour (2016). Stephen was introduced to a national audience thanks to his TV debut on VICELAND’s Flophouse (2016), as well as being featured on NPR&#039;s &quot;All Things Considered&quot;(2016) with Roy Wood Jr. A finalist in the 2012 Great American Comedy Festival, winner of the 2012 Comedy Works’ Clean Comedy Contest,&#039; and 3-time finalist in the venue’s New Faces contest, he quickly made a name for himself on the Denver scene.</p>\n",
      "pageUrl": "16503-stephen-agyei"
    },
    {
      "id": 16048,
      "events": [
        17157,
        17193
      ],
      "emceeEvents": [
        17280
      ],
      "name": "Scott Losse",
      "twitter": "coolbathroom",
      "website": "http://bridgetown.festivalthing.com/scottlosse%40gmail.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/scottlosseheadshot.jpg",
      "photoUrl": "/api/img/performer-images/performer-scottlosse-300x300.jpg",
      "sortOrder": 110,
      "excludeFromList": false,
      "bio": "<p>Scott Losse is a stand-up comedian from Seattle, Washington. He is married and has two chihuahuas. Scott has performed at SF Sketchfest, Bumbershoot: Seattle’s Music &amp; Arts Festival, Sketchfest Seattle, and lots of other places that aren’t festivals. Comedy Clubs. Colleges. Bars. Dive Bars. Elks Lodges. Regular Lodges. Scott recently appeared on Laughs on FOX. You have never heard of him.</p>\n",
      "pageUrl": "16048-scott-losse"
    },
    {
      "id": 16756,
      "events": [
        17157,
        17170,
        17193,
        17216
      ],
      "emceeEvents": [],
      "name": "Yedoye Travis",
      "twitter": "professordoye",
      "website": "http://yedoyetravis.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/img_9491_3.jpg",
      "photoUrl": "/api/img/performer-images/performer-yedoyetravis-300x300.jpg",
      "sortOrder": 111,
      "excludeFromList": false,
      "bio": "<p>Yedoye Travis is a comic from Atlanta, GA, currently based in Brooklyn, NY. He is host of the live show and podcast Rent Party, can be seen on the fourth season of Coming to the Stage on Comedy Dynamics, and is objectively not Donald Glover, although the two are from the same place.</p>\n",
      "pageUrl": "16756-yedoye-travis"
    },
    {
      "id": 16169,
      "events": [
        17148,
        17199,
        17217,
        17250
      ],
      "emceeEvents": [],
      "name": "Dusty Slay",
      "twitter": "dustyslay",
      "website": "http://dustyslay.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/13592652_10157210742330245_7627880667630795170_n.jpg",
      "photoUrl": "/api/img/performer-images/performer-dustyslay-300x300.jpg",
      "sortOrder": 112,
      "excludeFromList": false,
      "bio": "<p>Dusty Slay is a stand-up comedian with a baritone voice so smooth it&#039;s like champagne in your ears. </p>\n<p>Slay has appeared on several network shows including NBC’s &quot;Last Comic Standing&quot;, the popular program &quot;Laughs on FOX&quot; and he was a featured comedian on &quot;TMZ&quot;.  </p>\n<p>Dusty&#039;s comedy is regularly showcased on many nationally syndicated radio programs including Sirius XM, Pandora Radio and &quot;The Bob and Tom Radio Show&quot;. He’s also been invited to numerous comedy festivals across America including: The Laughing Skull Festival, The Charleston Comedy Festival and The Cape Fear Comedy Festival. Dusty won both the &quot;Fight Night Competition&quot; and the “Almost Famous Competition” at the Charlotte Comedy Zone in 2014.  During his years in Charleston, SC Slay won The Charleston Comedy Festival Stand Up Competition two years in a row and was voted &quot;Best Local Comic&quot; by the readers of the Charleston City Paper in 2013 and 2014.</p>\n<p>Dusty was born in Alabama, his parents divorced when he was two, then there was a custody battle, his mom lost, so he had to go live with her. He split time between his dad who lived on a farm, and his mom who lived in a trailer park. When asked about his education, Slay says, “When I was kid, my dad asked me if I wanted to go to college or if I wanted a pool. Man, I love that pool.”</p>\n<p>Dusty Slay is based in Nashville, TN where he is a local favorite at his home club at Zanies and has opened for many touring celebrities such as Rob Schneider, Jeff Ross and Roseanne.  Dusty, however, spends most of his time on the road where he continues to make audiences laugh all over the country at comedy clubs such as: The Punchline and Laughing Skull in Atlanta, Crackers Comedy Club in Indianapolis, The Charlotte Comedy Zone, Funny Bone Clubs (Syracuse, NY; Albany, NY; Virginia Beach, VA; Richmond, VA; Toledo, OH; Columbus, OH; Dayton, OH; Des Moines, IA), Comedy Club on State in Madison, WI, The Improv (Tampa, FL; Kansas City, MO) as well as many other clubs.</p>\n<p>In 2014, Dusty released his debut comedy album “Makin’ That Fudge” and in 2017, Dusty released his sophomore album &quot;Son of a Ditch&quot; which can both be found at CDBaby.com, Amazon.com and ITunes and are featured on Sirius XM.</p>\n",
      "pageUrl": "16169-dusty-slay"
    },
    {
      "id": 15967,
      "events": [
        17158,
        17176,
        17193,
        17281
      ],
      "emceeEvents": [],
      "name": "Samantha Ruddy",
      "twitter": "Samlymatters",
      "website": "http://samantharuddy.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/img_7176.jpg",
      "photoUrl": "/api/img/performer-images/performer-samantharuddy-300x300.jpg",
      "sortOrder": 113,
      "excludeFromList": false,
      "bio": "<p>Samantha Ruddy is a comedian who hails from just outside Scranton, Pennsylvania, and now lives in Brooklyn. She brings to the stage a world of goofy observations and witty one-liners. She has been named 1 of the 50 Funniest in Brooklyn by Brooklyn Magazine, called a comic &quot;you should be obsessed with&quot; by BUST, and selected to perform as part of the Caroline&#039;s Breakout Artist Series. She has performed in the New York Comedy Festival, Laugh Your Asheville Off Festival, and Limestone Comedy Festival. In addition to her standup, she is a contributing writer to Collegehumor, Someecards, and Reductress.</p>\n",
      "pageUrl": "15967-samantha-ruddy"
    },
    {
      "id": 15820,
      "events": [
        17159,
        17215,
        17219,
        17271
      ],
      "emceeEvents": [
        19056
      ],
      "name": "Alex Falcone",
      "twitter": "alex_falcone",
      "website": "http://alexfalconecomedy.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/wweek-donut-web.png",
      "photoUrl": "/api/img/performer-images/performer-alexfalcone-300x300.jpg",
      "sortOrder": 114,
      "excludeFromList": false,
      "bio": "<p>Alex Falcone is a comedian, writer, and moderately snappy dresser from Portland, OR. He&#039;s a regular on the IFC show Portlandia, has appeared at numerous comedy festivals including Bumbershoot, Sketchfest, Laugh Your Asheville Off, and the Brooklyn Comedy Festival, and he was named one of the Willamette Week&#039;s Funniest 5 and the Mercury&#039;s Undisputable Geniuses of Comedy.</p>\n<p>His writing has been quoted in Rolling Stone, VOX, Boing Boing, and been featured on the front page of Reddit. He recently released his debut novel &quot;Unwrap My Heart&quot; about a girl who falls in love with a very sexy mummy.</p>\n<p>In 2015, ice cream legends Salt &amp; Straw named a flavor after him and it was delicious.</p>\n<p>Despite these modest accomplishments, he somehow remains totally down to earth and approachable.</p>\n",
      "pageUrl": "15820-alex-falcone"
    },
    {
      "id": 15971,
      "events": [
        17151,
        17196,
        17218,
        19056
      ],
      "emceeEvents": [
        17179
      ],
      "name": "Robert Jenkins",
      "twitter": "RobJComedy",
      "website": "http://Robjcomedy.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/img_5346.jpg",
      "photoUrl": "/api/img/performer-images/performer-robertjenkins-300x300.jpg",
      "sortOrder": 115,
      "excludeFromList": false,
      "bio": "<p>Rob Jenkins uses his unique point of view, quick wit, and disarming delivery to tell you why he&#039;s right. You&#039;ll disagree, but you&#039;ll laugh anyway.</p>\n<p>A Detroit native, Rob has performed at many festivals including the Oddball Comedy &amp; Curiousity Festival, Crossroads Comedy Festival, and Laughfest where he was a 2016 participant in the Best of the Midwest Comedy Competition. Rob has appeared on the Fox Stand-Up Comedy Show “Laughs” and appeared in Dave Landau’s Detroit-based comedy “The King.” Rob has opened for Hannibal Buress, Kyle Kinane, Matt Broussard, Alonzo Bodden, Red Grant, and many others. In 2015, Rob released his first comedy CD &quot;Achievement Unlocked&quot; - it&#039;s available on iTunes, Amazon, xBox Music, and many other places.</p>\n",
      "pageUrl": "15971-robert-jenkins"
    },
    {
      "id": 16821,
      "events": [
        17154,
        17175,
        17249
      ],
      "emceeEvents": [
        17215
      ],
      "name": "George Civeris",
      "twitter": "georgeciveris",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/georgec.jpg",
      "photoUrl": "/api/img/performer-images/performer-georgeciveris-300x300.jpg",
      "sortOrder": 116,
      "excludeFromList": false,
      "bio": "<p>George Civeris is a Boston-based writer and comedian who performs all over New England and New York. Most recently, he won MoveOn.org&#039;s nationwide &quot;Laughter Trumps Hate&quot; contest, which was judged by a panel that included Judd Apatow, Adam McKay, and Baratunde Thurston (<a href=\"http://www.laughtertrumpshate.com/winners\">http://www.laughtertrumpshate.com/winners</a>). Last year, he performed at the Boston Comedy Festival, and in March 2017 he will be the comic-in-residence at Boston&#039;s famous Comedy Studio. He co-produces an award-winning weekly alternative comedy showcase called The Mendoza Line. As a gay immigrant, George is feeling pretty chill about the future.</p>\n",
      "pageUrl": "16821-george-civeris"
    },
    {
      "id": 16853,
      "events": [
        17152,
        17191,
        17196,
        17219,
        19056
      ],
      "emceeEvents": [],
      "name": "Phoebe Bottoms ",
      "twitter": "phoebebottoms",
      "website": "http://phoebebottoms.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/phoebe_.jpg",
      "photoUrl": "/api/img/performer-images/performer-phoebebottoms-300x300.jpg",
      "sortOrder": 117,
      "excludeFromList": false,
      "bio": "<p>Phoebe Bottoms is an Los Angeles based comedian, writer and Jim Henson Company trained puppeteer.  Since 2007 she has performed in clubs, basements, bars and VFW&#039;s all over the great country of ours.  Once described as, &quot;A fun thing that happened&quot; by one of the 453 citizens of Glenburn, North Dakota, her credits also include: Akumal Comedy Festival, Jewish Humor Festival and 10k Laughs Festival.  She is a two time winner  of Competitive Erotic Fan Fiction and has appeared on MTV, Adult Swim, TBS, Loot Crate and JASH.  Phoebe also produces and hosts The Comedy Palace in Los Feliz, which was recently named by Thrillist as one of the 10 Best Underground Comedy Shows in LA.</p>\n",
      "pageUrl": "16853-phoebe-bottoms-"
    },
    {
      "id": 16201,
      "events": [
        17172,
        17191,
        17196,
        17275
      ],
      "emceeEvents": [],
      "name": "Philip Schallberger",
      "twitter": "phil_schall",
      "website": "http://philschall.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/ps.jpg",
      "photoUrl": "/api/img/performer-images/performer-philipschallberger-300x300.jpg",
      "sortOrder": 118,
      "excludeFromList": false,
      "bio": "<p>Phil Schallberger is a comedian from Portland Oregon. He&#039;s recognized as one of the most unique and uncompromising comics in the Pacific Northwest and has been featured in the Seattle Sketchfest, San Francisco Sketchfest, Bridgetown Comedy Festival, TBA, and Hell Yes Fest. Mixing his years of experience with formal stand-up, sketch, and improv, Phil is able to weave in and out of multimedia, character, and sketch performance to create a distinctive solo-sketch show which has been regarded favorably by many. If you’re looking for something new that combines all your favorite elements of comic performances, Phil Schallberger is the guy for you.</p>\n",
      "pageUrl": "16201-philip-schallberger"
    },
    {
      "id": 16396,
      "events": [
        17154,
        17198,
        17233
      ],
      "emceeEvents": [
        17361
      ],
      "name": "Julia Shiplett",
      "twitter": "lertiene",
      "website": "http://juliashiplett.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/julia_shiplett.jpg",
      "photoUrl": "/api/img/performer-images/performer-juliashiplett-300x300.jpg",
      "sortOrder": 119,
      "excludeFromList": false,
      "bio": "<p>Beginning comedy in her hometown of Chicago, Julia Shiplett has been performing standup and telling stories for the past four years. Her comedy has evolved into a seamless blend of feminism, self-deprecation and personal experiences as a biracially confused Midwesterner. She often explores key topics like pop culture, women&#039;s issues and gross things happening to her body.</p>\n<p>She has been seen in the Brooklyn Comedy Festival, Hell Yes Fest, Cinder Block Comedy Fest and the Chicago Women’s Funny Fest. Other credits include winning a Moth StorySLAM and making it to the 2015 StandUp NBC semifinals. </p>\n<p>Now in New York, Julia co-produces two popular comedy shows in Brooklyn called DEVOUR HOUR &amp; Side Ponytail.</p>\n<p>She’s been told she would make an adorable villain.</p>\n",
      "pageUrl": "16396-julia-shiplett"
    },
    {
      "id": 16112,
      "events": [
        17154,
        17175,
        17189
      ],
      "emceeEvents": [
        17193
      ],
      "name": "Wilfred Padua",
      "twitter": "wilfredpadua",
      "website": "http://wilfredpadua.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot.jpeg",
      "photoUrl": "/api/img/performer-images/performer-wilfredpadua-300x300.jpg",
      "sortOrder": 120,
      "excludeFromList": false,
      "bio": "<p>Wilfred Padua is a comedian from Seattle who has an MFA in Writing from some school that doesn&#039;t matter. He has performed at Bumbershoot, Bridgetown Comedy Festival, the Boring Time Comedy Festival, the Summer Meltdown Music Festival, the Laughing Devil Festival in New York City, and his comedy can be found on SiriusXM and NBC&#039;s SeeSo. He’s usually an idiot.</p>\n",
      "pageUrl": "16112-wilfred-padua"
    },
    {
      "id": 16658,
      "events": [
        17157,
        17280
      ],
      "emceeEvents": [
        17217
      ],
      "name": "JoAnn Schinderle ",
      "twitter": "joannlizabeth",
      "website": "http://www.joannschinderle.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/btcf2016_joannschinderle-015.jpg",
      "photoUrl": "/api/img/performer-images/performer-joannschinderle-300x300.jpg",
      "sortOrder": 121,
      "excludeFromList": false,
      "bio": "<p>JOANN SCHINDERLE is a comic, actress, writer and producer living in Portland, OR.  Her MidWestern roots paired with inherited snarky charm will make you feel like she&#039;s your best friend letting you in a social awareness dirty little secret. JoAnn has been seen on LaughsTV, Rooftop Comedy, VICE, and has performed in such festivals as All Jane, Bridgetown, Bumbershoot, Chicago Comedy Expo, Hell Yes Fest, SF Sketchfest, and the Out of Bounds Comedy Festival.</p>\n<p>As an actress JoAnn is rep&#039;d by the top NW talent agency, Option Talent; wherein she has landed both national and local commercials. As a writer, Schinderle works with LaughStaff, Live Wire Radio, and has won several rounds of Competitive Erotic Fan Fiction. When not hosting at Helium Comedy Club- Portland, Schinderle produces a high profile weekly comedy showcase called, CONTROL YOURSELF. CONTROL YOURSELF (featured in Paste Magazine, Voted &#039;Top 5 Local Comedy Showcases by the Willamette Week in &#039;14/&#039;15/&#039;16) recently celebrated it&#039;s 3rd year running. CY is also produced as a podcast found on iTunes &amp; Soundcloud. If you enjoy friendly banter and/or can connect with &#039;person of singleness&#039; woe&#039;s, follow JoAnn on twitter @joannlizabeth.</p>\n",
      "pageUrl": "16658-joann-schinderle-"
    },
    {
      "id": 16786,
      "events": [
        17158,
        17168,
        17205,
        17272
      ],
      "emceeEvents": [
        17254
      ],
      "name": "Caitlin Weierhauser",
      "twitter": "UncleCait",
      "website": "http://Lezstandup.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/lede_caitlinweierhauser_funniestfive2016_christinedong_4304.jpg",
      "photoUrl": "/api/img/performer-images/performer-caitlinweierhauser-300x300.jpg",
      "sortOrder": 122,
      "excludeFromList": false,
      "bio": "<p>If Caitlin Weierhauser had a gender it would be, &quot;PE Teacher&quot; but alas, this Portland comedian refuses a reasonable label. Often political, frequently personal, and entirely too tantrum-prone, Caitlin serves arguments with equal parts glee and rage. They deliver the worst news about society with a dimpled grin and pointed outbursts. </p>\n<p>Caitlin has performed at Pickathon, Bumbershoot, Seattle Sketchfest, All Jane Comedy Fest, and was voted Top 5 in Willamette Week&#039;s 2016 poll. Comedy masterpieces include; Lez Stand Up, Dinner Date with Nick &amp; Cait, You&#039;re Welcome, Queer Story Jam, Room of Requirement 237 (A Harry Potter Podcast), and they are a regular co-host for XRAY in the Morning on XRAY.fm.</p>\n",
      "pageUrl": "16786-caitlin-weierhauser"
    },
    {
      "id": 16484,
      "events": [
        17163,
        17213,
        17219,
        17248,
        19056
      ],
      "emceeEvents": [
        17234
      ],
      "name": "Anthony Lopez",
      "twitter": "anthonylopezpt2",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot_jpeg2.jpg",
      "photoUrl": "/api/img/performer-images/performer-anthonylopez-300x300.jpg",
      "sortOrder": 123,
      "excludeFromList": false,
      "bio": "<p>Anthony Lopez is a founding member and co-host of Earthquake Hurricane, a standup showcase performed in Portland and at colleges throughout the northwest. He is also the new host of the long-running monthly show No Pun Intendo at Gound Kontrol. Anthony has written for the Gotham Awards and was the head writer for Late Night With Alex Falcone. He has performed at Bumbershoot, Hell Yes Fest in New Orleans, at UCB in New York and is a regular feature at Helium Comedy Club.</p>\n",
      "pageUrl": "16484-anthony-lopez"
    },
    {
      "id": 16447,
      "events": [
        17179,
        17191,
        17198,
        17275
      ],
      "emceeEvents": [],
      "name": "Christian Ricketts",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/christianrickettsheadshotclzeke.jpg",
      "photoUrl": "/api/img/performer-images/performer-christianricketts-300x300.jpg",
      "sortOrder": 124,
      "excludeFromList": false,
      "bio": "<p>Can you say &#039;awesome sauce&#039;? Christian Ricketts is an accomplished professional standup comedian who has been performing tons of amazing material since 2008. Asides from having written more than several hours of amazing material, they also perform as such memorable characters as Terry MacKulkan, Racist Old Man, and Carl Sagan. Lots of people have seen him and like it. He has appeared in several Bridgetown Comedy Festivals, Seattle Sketchfest, won the SF Comedy and Burrito Festival, was the #1 winner twice in Competitive Erotic Fan Fiction, he&#039;s contributing writer for Exotic Magazine, and Ricketts even got an award at the Oregon International Film Festival for straight up acting. He most often perform at venues in the Pacific Northwest, California, and the illegally annexed Kingdom of Hawaii.</p>\n",
      "pageUrl": "16447-christian-ricketts"
    },
    {
      "id": 16409,
      "events": [
        17152,
        17192
      ],
      "emceeEvents": [
        17235
      ],
      "name": "Amanda Arnold",
      "twitter": "Manduh_Arnold",
      "website": "http://Amandaarnoldcomedy.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot1_1.jpg",
      "photoUrl": "/api/img/performer-images/performer-amandaarnold-300x300.jpg",
      "sortOrder": 125,
      "excludeFromList": false,
      "bio": "<p>Amanda Arnold is a Portland based stand up comic. This self proclaimed &quot;chubby not ugly&quot; joke slinger delivers the funny from the very start. Amanda&#039;s fast paced, extremely funny comedic style landed her on Laughs on Fox and snagged her a spot in Willamette Week&#039;s &quot;Funniest 5&quot; in 2016. You may have also seen her in the the All Jane Comedy Festival or The Idaho Laugh Fest in 2016!  Amanda did stand up comedy for the first time when she was 8 years old! Yes! You read that correctly! It&#039;s no wonder you get a feeling when watching her that some people are just born funny.</p>\n",
      "pageUrl": "16409-amanda-arnold"
    },
    {
      "id": 16150,
      "events": [
        17179,
        17249
      ],
      "emceeEvents": [
        17156
      ],
      "name": "Milan Patel",
      "twitter": "Milan_Patel",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/milanpatel.jpg",
      "photoUrl": "/api/img/performer-images/performer-milanpatel-300x300.jpg",
      "sortOrder": 126,
      "excludeFromList": false,
      "bio": "<p>Milan Patel is a stand up comedian from Seattle, WA. He has regularly performed in Seattle&#039;s Bumbershoot Music &amp; Comedy festival and has produced sketch and stand-up shows in Seattle. He currently lives in Portland, OR and is quickly becoming one of Portland&#039;s favorite new comedians to watch. His comedy style ranges from dead-pan jokes to strange observational pieces to lighting fast crowd-work.</p>\n",
      "pageUrl": "16150-milan-patel"
    },
    {
      "id": 15908,
      "events": [
        17215
      ],
      "emceeEvents": [
        17157,
        17272
      ],
      "name": "Ben Harkins",
      "twitter": "TheBenHarkins",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot_4.jpg",
      "photoUrl": "/api/img/performer-images/performer-benharkins-300x300.jpg",
      "sortOrder": 127,
      "excludeFromList": false,
      "bio": "<p>Ben Harkins is a Pittsburgh native currently residing in Portland, Oregon. Harkins hosts Flyass Jokes, Portland’s longest running stand up showcase. His unsweetened insights and deadpan delivery have made him an audience favorite throughout the Pacific Northwest. His contentious material covers everything from the extinction of species to the price of groceries. Ben Harkins has performed at San Francisco Sketchfest, Mutiny X Radio Festival, Helium Comedy Club in Portland.</p>\n",
      "pageUrl": "15908-ben-harkins"
    },
    {
      "id": 16677,
      "events": [
        17163,
        17170,
        17234
      ],
      "emceeEvents": [],
      "name": "Marcus Coleman",
      "twitter": "MrMarcusColeman",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/15036270_10208481411615269_8855618650158451991_n.jpg",
      "photoUrl": "/api/img/performer-images/performer-marcuscoleman-300x300.jpg",
      "sortOrder": 128,
      "excludeFromList": false,
      "bio": "<p>Originally hailing from St. Louis (a fact he can’t stop bringing up,) Marcus Coleman was named of Portland’s “Geniuses of Comedy” by the Portland Mercury.</p>\n<p>A laid back shit-talker with a smile, he’s been called a “bright new star” and praised for “sharp, smart jabs on politics, family, and life as a black man” (Portland Mercury).</p>\n<p> Among the cool venues he’s been lucky enough to perform are: Revolution Hall, The Secret Society, Jackpot Recording Studios, Curious Comedy Theater, and Helium Comedy Club; where he was named Dirty Dozen Roast Battle champion and picked as one of their “New Faces”</p>\n<p>He hosts the raucous and unpredictable Midnight Mic every Friday night at Funhouse Lounge, and was recently chosen to replace the beloved Nariko Ott (RIP) as of the many co-hosts of the weekly showcase You’re Welcome at the gorgeous stage at Mississippi Pizza.</p>\n",
      "pageUrl": "16677-marcus-coleman"
    },
    {
      "id": 16251,
      "events": [
        17160,
        17169,
        17206
      ],
      "emceeEvents": [
        17218
      ],
      "name": "Becky Braunstein",
      "twitter": "BeckyFromAlaska",
      "website": "http://www.beckybraunstein.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/becky_braunstein_headshot_2017.jpg",
      "photoUrl": "/api/img/performer-images/performer-beckybraunstein-300x300.jpg",
      "sortOrder": 129,
      "excludeFromList": false,
      "bio": "<p>Becky Braunstein is a rising performer with fresh energy and wide-eyed enthusiasm that is impossible to ignore. She grew up on a mountain in Alaska where she had no one to talk to, and moved to Portland after being diagnosed with metastatic thyroid cancer that nearly caused her to lose her voice forever - but she didn’t lose it, and now she won’t shut up. Becky was an audience favorite at the 2016 Big Sky Comedy Festival, and has also performed at the All Jane Comedy Festival, the Idaho Laugh Fest, Pickathon, the Siren Nation Festival, NW Women’s Comedy Festival, and the Hudson Valley Comedy Festival. A finalist for ‘Best Comedian’ in the Willamette Week’s 2016 Best of Portland, and selected for Helium Comedy Club’s 2015 ‘Best of Portland,&#039; she performs regularly at Harvey’s Comedy Club and is a host/producer of Powerhouse, filmed at Curious Comedy Theater. She studied at the same acting school as Liam Neeson, and has a specific set of skills - which include illustrating #FatAnimals, being able to lip-sync the entirety of ‘Pehla Nasha’ from the 1992 hit Bollywood film Jo Jeeta Wohi Sikandar, and demolitions.</p>\n",
      "pageUrl": "16251-becky-braunstein"
    },
    {
      "id": 16549,
      "events": [
        17159,
        17234
      ],
      "emceeEvents": [
        17169
      ],
      "name": "Jason Goad",
      "twitter": "jjgoad",
      "website": "http://www.jjgoad.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/10491239_10204184552756621_6137886026090611465_n.jpg",
      "photoUrl": "/api/img/performer-images/performer-jasongoad-300x300.jpg",
      "sortOrder": 130,
      "excludeFromList": false,
      "bio": "<p>Jason Goad wanted a job working the fewest hours in the day, the fewest days of the week, and didn’t require getting up early. Jason found comedy later in life after attempts at being a novelist, short-story writer, and slam poet. He has squandered multiple thousands of dot com stock-option dollars and quit a career in the culinary arts twice.</p>\n<p>Comedy is the only thing Jason hasn’t had an overwhelming desire to quit. Described as “the Scared Straight of Seattle comedy,” or “if a Lou Reed song was funny,” Jason’s comedy comes from society’s grimy corners. Making frank jokes about terrible things, Jason has been featured at the Redwood Comedy Festival, the Bumbershoot Music and Arts Festival, the 36th Annual Seattle International Comedy Competition, and has written jokes for Brian Posehn.</p>\n<p>Jason lives in Seattle, Washington.</p>\n",
      "pageUrl": "16549-jason-goad"
    },
    {
      "id": 16718,
      "events": [
        17158,
        17180,
        17234
      ],
      "emceeEvents": [],
      "name": "Andie Main",
      "twitter": "andiemain",
      "website": "http://andiemaincomedy.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/photo4_1.jpg",
      "photoUrl": "/api/img/performer-images/performer-andiemain-300x300.jpg",
      "sortOrder": 131,
      "excludeFromList": false,
      "bio": "<p>Andie Main is a Portland based comedian who keeps busy by producing/hosting The Doug Fir Lounge&#039;s summer series The Cool Kids Patio Show, and her politically themed series called Revolution Comedy, which organizes fundraisers for progressive causes like Planned Parenthood, The ACLU, and Don&#039;t Shoot PDX. At this bizarre moment in our nation&#039;s history, her efforts have contributed over $10,000 to #theresistance and although she is a life long punkrocker, is stoked to see these shows selling out regularly.</p>\n<p>Festival credits include The Comedy Exposition, repeated appearances at SF Sketchfest and The All Jane Comedy Festival, Bumbershoot, Seattle Sketchfest, Portland Pride, Treefort Festival and Cromfest. She has recently performed for sold out crowds at UCBeast, UCB Chelsea and The Stand Nightclub in NYC, and esteemed shows in LA like The Rabbit Hole and Put Your Hands Together. When in Portland she is a fixture on the NW circuit and a regular at Helium Comedy Club.</p>\n<p>She is a regular feature for comedians like TJ Miller, Myq Kaplan and James Adomian and after the shows they&#039;ve all said &quot;hey Andie that was great!&quot; and got brunch because you can order brunch whenever you want in Portland.</p>\n<p>In her spare time she enjoys taking hikes with her not-so-smart dog, pizza, making weird art, nature documentaries and yelling about the patriarchy.</p>\n",
      "pageUrl": "16718-andie-main"
    },
    {
      "id": 16429,
      "events": [
        17169,
        17210,
        17234
      ],
      "emceeEvents": [
        17155
      ],
      "name": "Robbie Pankow",
      "twitter": "robbiepankow",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/ice_cream.jpg",
      "photoUrl": "/api/img/performer-images/performer-robbiepankow-300x300.jpg",
      "sortOrder": 132,
      "excludeFromList": false,
      "bio": "<p>Robbie Pankow is a comedian and podcaster born and raised in Portland, OR. He has been described as &quot;right in my wheelhouse&quot; by some and &quot;acceptable&quot; by others. He placed in the finals of Helium Comedy Club&#039;s &quot;Portland&#039;s Funniest Person&quot; Contest in 2015. His podcast, Eat Food, Already and monthly showcase Whatever Forever have been taking Portland by a light storm and if he somehow gets his way, it&#039;s only gettin stormier!</p>\n",
      "pageUrl": "16429-robbie-pankow"
    },
    {
      "id": 17116,
      "events": [
        17152,
        17187,
        17233
      ],
      "emceeEvents": [
        17176
      ],
      "name": "John B. Duff",
      "twitter": "johnbduff",
      "website": "http://www.oddblock.ca",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/img_1057.jpg",
      "photoUrl": "/api/img/performer-images/performer-johnbduff-300x300.jpg",
      "sortOrder": 133,
      "excludeFromList": false,
      "bio": "<p>John B. Duff is a Winnipeg stand-up comic and the 2005 winner of Winnipeg’s Funniest Person with a Day Job competition. He placed in the top 10 of CTV’s Nationwide Corner Gas Comic Genius competition and was a local finalist in the Just for Laughs National Homegrown Comic Competition in 2007.</p>\n<p>10 years after naming the Bridgetown Comedy Festival (no joke!) and near continuous hilarity John has moved on to co-found the successful Oddblock Comedy Festival in Winnipeg, Canada.</p>\n<p> </p>\n",
      "pageUrl": "17116-john-b-duff"
    },
    {
      "id": 15859,
      "events": [
        17158,
        17168,
        17198
      ],
      "emceeEvents": [
        17210
      ],
      "name": "Kirsten Kuppenbender",
      "twitter": "kupptastic",
      "website": "http://www.kirstenkuppenbender.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/dsc_1378.jpg",
      "photoUrl": "/api/img/performer-images/performer-kirstenkuppenbender-300x300.jpg",
      "sortOrder": 134,
      "excludeFromList": false,
      "bio": "<p>Kirsten Kuppenbender is a Power House with a heart made of precious metal. She&#039;s a comedian, she&#039;s an actor and she is the visionary of a comedic revolution. In addition to her brilliant stand up and hosting skills, she is The Founder and Producer of Lez Stand Up: a Portland-based, all-queer, feminist comedy collective and showcase which performs up and down the West Coast. </p>\n<p>You may have seen her in Mercury&#039;s Undisputable Geniuses of Comedy showcase - 2016, Funny Women Festival LA - 2015, All Jane Festival 2015 &amp; 2013</p>\n",
      "pageUrl": "15859-kirsten-kuppenbender"
    },
    {
      "id": 16297,
      "events": [
        17216
      ],
      "emceeEvents": [],
      "name": "Mark Saltveit",
      "twitter": "taoish",
      "website": "http://palindromist.org/mark-saltveit",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/saltveit_outside_headshot_2_0.jpg",
      "photoUrl": "/api/img/performer-images/performer-marksaltveit-300x300.jpg",
      "sortOrder": 135,
      "excludeFromList": true,
      "bio": "<p>Mark Saltveit is the World Palindrome Champion. He writes about football, Daoism and anything else you pay him for. As seen on ESPN Sportscenter, CNN (live with Anderson Cooper), NYT, LAT, Economist, Time, etc. and heard on NPR, BBC, CBC. Author of \"The Tao of Chip Kelly\" and \"A Man, A Plan, A Palindrome.\"</p>\n",
      "pageUrl": "16297-mark-saltveit"
    },
    {
      "id": 16393,
      "events": [],
      "emceeEvents": [
        17154
      ],
      "name": "Barbara Holm",
      "twitter": "barbara_holm",
      "website": "http://barbaraholm.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/15226477_10105807861570758_646096088_n.jpg",
      "photoUrl": "/api/img/performer-images/performer-barbaraholm-300x300.jpg",
      "sortOrder": 136,
      "excludeFromList": true,
      "bio": "<p>Portland comedian Barbara Holm has performed at the San Francisco Sketchfest, the Bridgetown Comedy Festival, the All Jane Comedy Festival, Bumbershoot Arts festival, Rose City Comic Con, PAX Convention, and the Women in Comedy Festival in Boston. She has written for IGN, Live Wire, The Portland Mercury, and the Huffington Post. She has been awarded Time Out New York’s Joke of the Week and was named “one of the best things about comedy in 2012” by the Comedy Bureau. Her comedy has been described as clever, unique, idiosyncratic, and exuberant. Seattle City Arts Magazine called her a “comedy wizard” and Seattle Stranger Newspaper described her as an “adorable wunderkind” and she describes herself as “running away from this question to hide under the desk right now.”</p>\n",
      "pageUrl": "16393-barbara-holm"
    },
    {
      "id": 16879,
      "events": [],
      "emceeEvents": [
        17197
      ],
      "name": "Aaron Black",
      "twitter": "AaronBlackcomic",
      "website": "https://www.facebook.com/aaron.black.739",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/aaron7123.jpg",
      "photoUrl": "/api/img/performer-images/performer-aaronblack-300x300.jpg",
      "sortOrder": 137,
      "excludeFromList": true,
      "bio": "<p>Hello my name is Aaron Black, I&#039;m a stand up comic, writer, and actor? I reside in Los Angeles, where I co-produce a show called the Brew HaHa (the comedy drinking game), which has been written up in LA Weekly and Time Out LA. I also rent out paddle boats on Echo Lake...you know...for money. In 2016 I won Best Stand Up in the 19th Los Angeles Comedy Festival (this officially ends the comedic accomplishment portion of this bio). I have performed at SF Sketchfest, Riot LA, and Green Mountain Comedy Festival, and have performed with Sarah Tiana, Jim Jeffries, Todd Glass, Kyle Kinane, and Maria Bamford (I&#039;m pretty sure they didn&#039;t stick around for my set).  When I&#039;m not on stage talking about Jill (my ex) I write sketches that have been featured on Funny or Die and The Laugh Button. I&#039;m not over my ex, which is painfully obvious on stage. People say comedy is like therapy, and every time I grab a mic it is my mission to get people to stop saying that. It doesn&#039;t work.</p>\n",
      "pageUrl": "16879-aaron-black"
    },
    {
      "id": 17236,
      "events": [
        17183
      ],
      "emceeEvents": [],
      "name": "The Doubleclicks",
      "twitter": "thedoubleclicks",
      "website": "http://thedoubleclicks.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/banana-768x503.jpg",
      "photoUrl": "/api/img/performer-images/performer-thedoubleclicks-300x300.jpg",
      "sortOrder": 138,
      "excludeFromList": false,
      "bio": "<p>The Doubleclicks (Angela Webber and Aubrey Webber) are a Portland-based musical duo who mix comedy, messages and geek culture in charming, catchy songs. Since debuting with a weekly YouTube songwriting project in 2011, the Doubleclicks have carved out a space in geek and songwriting communities with their message of empowerment and their penchant for involving their community of listeners in the creation of their music and videos. The Doubleclicks’ 2012 album Lasers and Feelings and 2015 album President Snakes both hit top 10 in the Billboard charts in comedy. They continue to release new music on Youtube and at <a href=\"http://www.thedoubleclicks.com/\" target=\"_blank\">http://www.thedoubleclicks.com/</a></p>\n<p>The Doubleclicks tour the country, playing everywhere from music venues to comedy clubs, game stores, and at events like San Diego Comic-Con, PAX, JoCoCruise and more.<br />\nSometimes called “nerd music” or “kids music,” the Doubleclicks reach beyond these labels to create meaningful music making audiences laugh and cry. Doubleclicks songs have been featured on several NPR programs, college radio stations and all around the Internet, including Nerdist, BoingBoing, Huffington Post, Kotaku, and more.</p>\n<p>The Doubleclicks produce a touring variety show called #NerdNightOut which features comedy and music for a geek audience, and has included guests like Jackie Kashian, Mike Drucker and Bill Corbett.</p>\n<p>The band’s loyal fanbase frequently participates in their music videos and has elevated the band by funding three albums via Kickstarter projects raising a total of more than $202,000.</p>\n<p>The Doubleclicks have written theme songs and created commercials for popular game brands Cards Against Humanity and Fluxx, for a Nerdist partnership with Totinos, and for many podcasts and web series. </p>\n",
      "pageUrl": "17236-the-doubleclicks"
    },
    {
      "id": 17239,
      "events": [
        17149,
        17159,
        17179,
        17203
      ],
      "emceeEvents": [],
      "name": "Special Secret Guest!",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/logo_0.png",
      "photoUrl": "/api/img/performer-images/performer-specialsecretguest-300x300.jpg",
      "sortOrder": 139,
      "excludeFromList": true,
      "bio": "<p>Special secret guest!</p>\n",
      "pageUrl": "17239-special-secret-guest"
    },
    {
      "id": 17238,
      "events": [
        17202,
        17216
      ],
      "emceeEvents": [
        17171,
        17195,
        17275
      ],
      "name": "Dax Jordan",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/_mg_5329resize.jpg",
      "photoUrl": "/api/img/performer-images/performer-daxjordan-300x300.jpg",
      "sortOrder": 140,
      "excludeFromList": false,
      "bio": "<p>This photo has 3 outdated treasures: a wedding ring, a bunch of hair and a landline telephone. What persists is the connection with NW audiences that fed Dax for the first 12 years of his glorious comedy upbringing. Over the last 9 years of Bridgetown appearances, this now-tanned LA resident has seen his hometown festival grow and give birth to a splendid new generation of performers and comedy-educated audiences. Dax does not like olives and if any of the backstage pizzas so much as TOUCH an olive he will absolutely tank that show and maybe ruin the whole festival, so cool it with them shits. </p>\n<p> </p>\n<p> </p>\n<p>Buy his album \"#1 Grandson\" on Amazon.</p>\n<p> </p>\n<p>@daxjordan on twitter and IG</p>\n<p><a href=\"http://daxjordan.com/\" target=\"_blank\">daxjordan.com</a></p>\n",
      "pageUrl": "17238-dax-jordan"
    },
    {
      "id": 16537,
      "events": [],
      "emceeEvents": [],
      "name": "Danny Maupin",
      "twitter": "dannymaupin",
      "website": "http://www.dannymaupin.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/dannymindy.jpg",
      "photoUrl": "/api/img/performer-images/performer-dannymaupin-300x300.jpg",
      "sortOrder": 141,
      "excludeFromList": true,
      "bio": "<p>Danny Maupin is a dynamic comedian known for using not just his voice, but his whole body to deliver energetic performances that blend unapologetic self-awareness with sharp-witted storytelling. His unique and spontaneous standup has been featured at Comedy Central’s New York Comedy Festival, Chicago Comedy Exposition, Hell Yes Fest, Orlando Indie Comedy Fest, Crom Comedy Festival and many more. </p>\n<p>Danny is based out of Chicago and when he isn’t traveling the country performing standup comedy, he stays busy as co-creator and co-host of Late Late Breakfast which tours extensively as well as maintains monthly shows at The Hideout in Chicago and the legendary The Creek and The Cave in NYC. Late Late Breakfast has been described as “a raucous afternoon of high-energy mischief” by the Chicago Tribune, “a standup comedy show like no other” by The Daily Dot and was recently featured as a top concept comedy show by The Interrobang. He is also a co-producer of Character Assassination at The Laugh Factory in Chicago.</p>\n",
      "pageUrl": "16537-danny-maupin"
    },
    {
      "id": 15947,
      "events": [],
      "emceeEvents": [],
      "name": "Tyler Jackson",
      "twitter": "tjaxkson",
      "website": "Http://www.latelatebreakfast.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/img_0029.jpg",
      "photoUrl": "/api/img/performer-images/performer-tylerjackson-300x300.jpg",
      "sortOrder": 142,
      "excludeFromList": true,
      "bio": "<p>Tyler Jackson is a standup from Chicago who writes short, absurd jokes and relishes wordplay, non-sequiturs, and embarrassing personal details. He is co-creator of the bizarre monthly comedy happening, the Late Late Breakfast. The Pelican Brief is his third novel.</p>\n",
      "pageUrl": "15947-tyler-jackson"
    },
    {
      "id": 17270,
      "events": [],
      "emceeEvents": [
        17182
      ],
      "name": "Lance Bangs",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/img_5261.jpg",
      "photoUrl": "/api/img/performer-images/performer-lancebangs-300x300.jpg",
      "sortOrder": 143,
      "excludeFromList": true,
      "bio": "<p>Lance Bangs is an American filmmaker and music video director.</p>\n",
      "pageUrl": "17270-lance-bangs"
    },
    {
      "id": 17321,
      "events": [],
      "emceeEvents": [
        17184
      ],
      "name": "Allegra Ringo and Renee Colvert",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/bridgetown_2017_twitter_1.jpg",
      "photoUrl": "/api/img/performer-images/performer-allegraringoandreneecolvert-300x300.jpg",
      "sortOrder": 144,
      "excludeFromList": true,
      "bio": "<p>Dog owner Allegra Ringo and dog wanter Renee Colvert talk about their dogs, discuss dogs they met this week, and brief you on dogs news. </p>\n",
      "pageUrl": "17321-allegra-ringo-and-renee-colvert"
    },
    {
      "id": 17323,
      "events": [],
      "emceeEvents": [
        17187
      ],
      "name": "Danny Maupin and Tyler Jackson",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/bridgetown_2017_twitter_1_1.jpg",
      "photoUrl": "/api/img/performer-images/performer-dannymaupinandtylerjackson-300x300.jpg",
      "sortOrder": 145,
      "excludeFromList": true,
      "bio": "<p>Danny &amp; Tyler host Late Late Breakfast.</p>\n",
      "pageUrl": "17323-danny-maupin-and-tyler-jackson"
    },
    {
      "id": 17362,
      "events": [
        17183
      ],
      "emceeEvents": [],
      "name": "Keith Baker",
      "twitter": "HellcowKeith",
      "website": "http://keith-baker.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/unnamed_1.jpg",
      "photoUrl": "/api/img/performer-images/performer-keithbaker-300x300.jpg",
      "sortOrder": 146,
      "excludeFromList": true,
      "bio": "<p>Keith Baker is best known for creating the <em>Eberron Campaign Setting </em>for <em>Dungeons &amp; Dragons </em>and the storytelling card game <em>Gloom</em>. As lead designer for Twogether Studios, he's created the card game <em>Phoenix: Dawn Command </em>and <em>Illimat, </em>a neoclassic game developed in collaboration with The Decemberists. He can be found online at Keith-Baker.com.</p>\n",
      "pageUrl": "17362-keith-baker"
    },
    {
      "id": 16419,
      "events": [],
      "emceeEvents": [
        17189
      ],
      "name": "Jeremy Eli",
      "twitter": "ImJeremyEli",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot_18.jpg",
      "photoUrl": "/api/img/performer-images/performer-jeremyeli-300x300.jpg",
      "sortOrder": 147,
      "excludeFromList": true,
      "bio": "<p>Originally from upstate New York, Jeremy Eli began performing comedy while in college. Attending open mics in New York City whenever possible. In 2013 he moved to Portland. His unique perspectives, quick wit, and sly word play made him a rising talent in the scene. He can regularly be seen hosting at Helium comedy club and heard on his irreverent podcast Eat Food, Already.<br />\nMoving to Portland has given Jeremy many opportunities and he contributes heavily to the Portland comedy community. Jeremy hosts the weekly Lights Out Open Mic. In 2014 he began producing and hosting the popular and well regraded Minority Retort, a recurring comedy event that showcases Comedians of Color in the Pacific Northwest.<br />\nHe’s a rising star in Portland with an outspoken and unique comic presence, so please, keep it going for Jeremy Eli.</p>\n",
      "pageUrl": "16419-jeremy-eli"
    },
    {
      "id": 16900,
      "events": [],
      "emceeEvents": [
        17231
      ],
      "name": "Josh Adam Meyers",
      "twitter": "JoshAdamMeyers",
      "website": "http://www.joshadammeyers.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/josh_adam_meyers.jpg",
      "photoUrl": "/api/img/performer-images/performer-joshadammeyers-300x300.jpg",
      "sortOrder": 148,
      "excludeFromList": true,
      "bio": "<p>Josh Adam Meyers is the host and creator of The Goddamn Comedy Jam, a show where ever comic gets to be a rockstar. Now a series on Comedy Central, this live edition features comedians performing standup sets followed by a cover song with the Goddamn Band.</p>\n",
      "pageUrl": "16900-josh-adam-meyers"
    },
    {
      "id": 17391,
      "events": [
        17182
      ],
      "emceeEvents": [],
      "name": "Team Dresch",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/bridgetown_2017_twitter_1_2.jpg",
      "photoUrl": "/api/img/performer-images/performer-teamdresch-300x300.jpg",
      "sortOrder": 149,
      "excludeFromList": true,
      "bio": "<p>'''Team Dresch''' are a Queercore band who performed and recorded in the 1990s and made a significant impression on that movement, as well as on the independent music scene.</p>\n",
      "pageUrl": "17391-team-dresch"
    },
    {
      "id": 19055,
      "events": [
        17183
      ],
      "emceeEvents": [],
      "name": "Jenn Ellis",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/unnamed-1.jpg",
      "photoUrl": "/api/img/performer-images/performer-jennellis-300x300.jpg",
      "sortOrder": 150,
      "excludeFromList": true,
      "bio": "<p>Jenn Ellis has a passion for making games and events that bring people together. She's the people &amp; product side of Twogether Studios, as well as the producer of the RPG <em>Phoenix: Dawn Command </em>and the upcoming card game <em>Illimat</em>. Jenn has lived in both Portlands, and prefers the Oregon one. </p>\n",
      "pageUrl": "19055-jenn-ellis"
    }
  ]
}