{
  "performers": [
    {
      "id": 16591,
      "events": [],
      "emceeEvents": [],
      "name": "Nick Vatterott",
      "twitter": "nickvatterott",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/nickvatterottheadshot_01272017125716_large.jpg",
      "photoUrl": "/api/img/performer-images/performer-nickvatterott-300x300.jpg",
      "sortOrder": 13,
      "excludeFromList": false,
      "bio": "<p>In 2010 The Hollywood Reporter named Nick Vatterott one of the “break-outs” at Montreal’s Just for Laughs Comedy Festival. Since then he has performed on <em>Conan</em>, <em>Late Night with Jimmy Fallon</em> and has a half hour special on Comedy Central. Nick was also a producer/writer/performer on Comedy Central’s stand-up sketch hybrid show <em>Mash-Up</em>, and with co-creator TJ Miller sold the project <em>Manimation</em> to Fox's ADHD. He was the recipient of the prestigious Andy Kaufman award in 2011 and before heading off to NYC, Chicago Magazine listed Nick as “The Funniest Man in Chicago.” Nick’s debut comedy record, FOR AMUSMENT ONLY was released in November 2014 by Comedy Central Records and was voted by Vulture, Laughspin, and Splitsider as one of the year’s best comedy albums. In addition to naming Vatterott’s album one of the best of 2014, Vulture.com also listed him as one of the top 50 comedians you should know in 2015. Nick has been called “one of the most dynamic performer’s today” by The Laugh Button and his LATE NIGHT WITH JIMMY FALLON set was received as “so damn brilliant” by The Chicago Reader.  Nick has also had correspondent work on THE BIG TEN NETWORK and is currently writing for GORBURGER on Comedy Central with TJ Miller.</p>\n",
      "pageUrl": "16591-nick-vatterott"
    },
    {
      "id": 16925,
      "events": [],
      "emceeEvents": [],
      "name": "Janeane Garofalo",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/janeane_garofalo_headshot.jpg",
      "photoUrl": "/api/img/performer-images/performer-janeanegarofalo-300x300.jpg",
      "sortOrder": 1,
      "excludeFromList": false,
      "bio": "<p>Janeane has had many memorable and critically acclaimed roles in film and television since bursting on the scene in 1992. She's appeared in films such as \"The Truth About Cats and Dogs,\" \"Wet Hot American Summer,\" \"Ratatouille\" and \"Reality Bites.\" She was a cast member of the Emmy award winning \"Ben Stiller Show,\" as well as the comedy classic \"The Larry Sanders Show,\" and had recurring roles on \"24\" and \"The West Wing.\" She appeared in Bravo's first scripted series \"Girlfriend's Guide to Divorce\" and can be seen in the Netflix series \"Wet Hot American Summer: First Day of Camp.\" Along with \"Little Boxes,\" Janeane will appear in several feature films in 2016, including \"Blue Angel\" and \"Speech and Debate.\"</p>\n<p>In addition to acting in film and television, Janeane is an outspoken activist and tours the country as a stand-up comedian. She was instrumental in the successful launching of the first liberal radio network, <a href=\"http://airamerica.com/\" target=\"_blank\">Air America Radio</a>, where she hosted her own talk show, \"<a href=\"http://airamerica.com/majorityreport/\" target=\"_blank\">The Majority Report</a>.\" A lightning rod for controversy, Janeane's well-informed opinions and unflinching honesty have inspired laughs as well as striking a chord with the left, right and everyone in between. She is a noted peace activist.</p>\n<p>Notable Roles: Janeane played the role of Paula, the acerbic talent booker, on \"<a href=\"http://www.sonypictures.com/homevideo/thelarrysanderscollection/\" target=\"_blank\">The Larry Sanders Show</a>,\" for which she received an Emmy nomination in 1997 and two Cable Ace nominations. During the fall of '94 she joined the cast of \"Saturday Night Live.\" Other television work includes the series finale of \"Mad About You\" and the critically-lauded final season of NBC's \"<a href=\"http://www2.warnerbros.com/web/westwingtv/index.jsp\" target=\"_blank\">The West Wing</a>,\" where she played Democratic campaign strategist Louise Thornton. In 2007, Janeane's voice was featured in the Disney/Pixar animated comedy Ratatouille. Janeane can also be seen in Stella writer/director David Wain's ensemble comedy, \"The Ten,\" the Lifetime movie \"Girl's Best Friend\" and as a recurring character on the 2009 season of \"<a href=\"http://www.fox.com/24/\" target=\"_blank\">24</a>.\"</p>\n<p> </p>\n",
      "pageUrl": "16925-janeane-garofalo"
    },
    {
      "id": 16589,
      "events": [],
      "emceeEvents": [],
      "name": "Mike Lawrence",
      "twitter": "TheMikeLawrence",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/mikelawrenceheadshotnormal_08042016091910_large.jpg",
      "photoUrl": "/api/img/performer-images/performer-mikelawrence-300x300.jpg",
      "sortOrder": 3,
      "excludeFromList": false,
      "bio": "<p>Mike Lawrence is a New York City based comedian from South Florida who has found success in both writing and stand up. He is a staff writer on Comedy Central’s <strong>Inside Amy Schumer</strong>, A&amp;E’s <strong>Black and White</strong>, and has written for TV Land’s<strong> The Jim Gaffigan Show</strong>, and Hulu’s<strong> Triumph 2016 Election Special</strong>, the 2015 <strong>MTV Movie Awards</strong>, the 2015 <strong>Webby Awards</strong>, and <strong>We Have Issues</strong> on E! Mike was recently nominated for two <strong>Emmy’s</strong> for being of the staff of <strong>Inside Amy Schumer</strong> and the <strong>Triumph 2016 Election Special</strong>, and won the inaugural Comedy Central special <strong>Roast Battle</strong> tournament, recorded live at the 2016 Just For Laughs Festival in Montreal.</p>\n<p>Mike is host of the Comedy Central Snapchat series <strong>You’re Wrong</strong> and is a recurring guest on the Comedy Central TV show <strong>@midnight.</strong> His stand-up has been featured on NBC’s <strong>Late Night with Seth Meyers</strong>, TBS’ <strong>Conan</strong>, FX’s <strong>Totally Biased</strong>, SyFy’s <strong>The Will Wheaton Project</strong>, and John Oliver’s <strong>New York Stand-Up Show</strong> on Comedy Central. In 2013 His half hour special for Comedy Central aired in conjunction with the release of his album “Sadamantium”, produced by Comedy Central Records.</p>\n<p>Additionally, Mike co-hosts the podcast <strong>Nerd of Mouth</strong> on Cave Comedy Radio and has appeared on countless others such as <strong>WTF with Marc Maron</strong>, Robert Kelly’s <strong>You Know What Dude</strong>, <strong>You Made It Weird with Pete Holmes</strong>, <strong>Who Charted</strong>, <strong>The Dana Gould Hour</strong>, <strong>The Adam Corolla Show</strong>, and <strong>The Artie Lange Show</strong>.</p>\n",
      "pageUrl": "16589-mike-lawrence"
    },
    {
      "id": 16051,
      "events": [],
      "emceeEvents": [],
      "name": "Guy Branum",
      "twitter": "guybranum",
      "website": "http://www.guybranum.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/guybranum2.jpg",
      "photoUrl": "/api/img/performer-images/performer-guybranum-300x300.jpg",
      "sortOrder": 4,
      "excludeFromList": false,
      "bio": "<p>Guy Branum is a writer and comedian best known for his recurring segment \"No More Mr. Nice Gay\" on <em>Totally Biased with W. Kamau Bell</em>, serving as \"Staff Homosexual\" on <em>Chelsea Lately</em> and his performance as Natalie Portman's sassy gay friend in <em>No Strings Attached</em>. Noticing a trend? He's a recurring panelist on Comedy Central's <em>@Midnight</em> and <em>The Nightly Show with Larry Wilmore</em>. He is also the host and the creator of the beloved <em>Talk Show The Game Show</em> where celebrity guests face off to prove who's the best talk show guest by plugging, name-dropping, and anecdoteing their way to victory. The show takes place monthly at the Nerdmelt Showroom in LA and was just ordered to series for TruTV. Other TV credits include the upcoming <em>Road to Roast</em>, also on Comedy Central, SeeSo's <em>Comedy Show Show</em> and <em>Debate Wars</em>, or maybe you have seen Guy on E!, MTV, G4, CurrentTV and lots of other channels you'd need to upgrade your cable to watch. Guy's writing credits include <em>The Mindy Project</em> on Hulu, <em>Punk'd</em> and <em>Awkward</em> on MTV, <em>Billy on the Street</em> on truTV and <em>Fashion Police</em> on E!. That means he's watched the Grammys at Joan Rivers's house. Jealous? </p>\n<p>As a standup comic Guy has appeared at San Francisco Sketchfest, Moontower Comedy Festival in Austin, TX, Riot LA and Bridgetown Comedy Festival in Portland, OR. In 2015 Guy released his debut album <em>Effable</em> on AST Records. He also writes self-important essays for various blogs, had an editorial column in The New York Times and occasionally makes web videos where he dances around without his shirt on. But mostly, Guy is very, very beautiful and good at having sex.</p>\n",
      "pageUrl": "16051-guy-branum"
    },
    {
      "id": 16917,
      "events": [],
      "emceeEvents": [],
      "name": "Dave Hill",
      "twitter": "mrdavehill",
      "website": "http://davehillonline.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/dave-hill1.jpg",
      "photoUrl": "/api/img/performer-images/performer-davehill-300x300.jpg",
      "sortOrder": 5,
      "excludeFromList": false,
      "bio": "<p>Dave Hill is a comedian, writer, musician, actor, radio host, and man-about-town originally from Cleveland, Ohio but now living in New York City in a totally sweet apartment with a party deck and everything. Hot chicks come over to hang out and eat cheese plates and stuff with him all the time and it’s awesome.</p>\n<p>Anyway, on the show business front, Dave has appeared on Comedy Central’s <em>@midnight</em> and<em> Inside Amy Schumer</em> programs, TBS' <em>Full Frontal with Samantha Bee, </em>and TruTV's <em>Comedy Knockout</em> others. He is a frequent on-air host for HBO and Cinemax and has been on channels like MTV, VH1, BBC-America, and the Sundance Channel a whole bunch too. Dave also starred in his own television program <em>The King of Miami</em> on the Mojo Network, which was cancelled even though Dave really liked it. The show also aired in the United Kingdom on Sky TV’s Film24 Channel. And you can still watch <a href=\"http://www.hulu.com/search?q=King+of+Miami\"><em>The King of Miami</em> on Hulu</a> too, which Dave is super pumped about. Oh, and Dave was a correspondent on <em>Hoppus on Music</em> starring Blink 182’s Mark Hoppus on the Fuse channel, which ruled. Dave has been on other shows and in obscure movies too but let’s keep moving for now.</p>\n<p>Dave performs live comedy over the world and has appeared at such festivals as the Melbourne International Comedy Festival, San Francisco Sketchfest, the Edinburgh Fringe Festival, the U.S. Comedy Arts Festival in Aspen, Sasquatch Festival, Bumbershoot, Bonnaroo, the Bridgetown Comedy Festival in Portland, the Crap Comedy Festival in Oslo, Outside Lands in San Francisco, and then some other ones too. He has also performed comedy at Sing Sing Correctional Facility twice and even ripped some guitar solos inside a Mexican prison once. In 2007, <em>Variety</em> magazine named Dave one of their “10 Comedians to Watch,” something he still won’t shut up about..</p>\n<p>Dave is also a musician who currently sings and plays guitar in the power pop band Valley Lodge, whose song “Go” is the theme song to HBO’s <em>Last Week Tonight with John Oliver</em>. He was also a member of Cleveland rock bands Sons of Elvis and Cobra Verde as well as Diamondsnake, a heavy metal band with Moby. Additionally, Dave has played guitar for Walter Schreifels and muscle metal band Thor and bass for Lucy Wainwright Roche and former Faith No More singer Chuck Mosley. He also contributed musical stores to films such as <em>Dirty Deeds</em>, <em>Shoot First and Pray You Live</em>, and then some other ones besides those two.</p>\n<p>Dave has made out with a lot of chicks, is sweet at guitar, and smells really great. You can ask anyone.</p>\n",
      "pageUrl": "16917-dave-hill"
    },
    {
      "id": 16916,
      "events": [],
      "emceeEvents": [],
      "name": "Nico Santos",
      "twitter": "nicosantoscomic",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/nico_santos.jpg",
      "photoUrl": "/api/img/performer-images/performer-nicosantos-300x300.jpg",
      "sortOrder": 6,
      "excludeFromList": false,
      "bio": "<p>Nico Santos stars as Mateo on NBC's comedy \"Superstore.\" Santos was born and raised in the Philippines and assimilated into American culture rather quickly by living in California by way of Portland, Oregon. He started doing stand up in San Francisco and, in just a short amount of time, conquered the Bay Area comedy scene with his acute observations and quirky characters.</p>\n<p>Charming audiences all across the country with his sharp sarcastic wit and outrageous sensibility, Santos has that rare ability to be crass and snarky while at the same time remaining completely likable. Santos has written for E! Network's \"Fashion Police\" and appeared on screen on Showtime's \"Pride Comedy Jam,\" as well as \"Ground Floor,\" \"Mulaney\" and \"2 Broke Girls.\" He was also a regular panelist on \"Chelsea Lately\" and made his film debut in \"Paul Blart: Mall Cop 2.\" </p>\n",
      "pageUrl": "16916-nico-santos"
    },
    {
      "id": 15979,
      "events": [],
      "emceeEvents": [],
      "name": "Hampton Yount",
      "twitter": "Hamptonyount",
      "website": "http://www.hamptonyount.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/hampton_yount_standup.jpg",
      "photoUrl": "/api/img/performer-images/performer-hamptonyount-300x300.jpg",
      "sortOrder": 7,
      "excludeFromList": false,
      "bio": "<p>Hampton is a comedian and is also a human being filled with blood and guts. He started comedy in DC and later moved to LA where he’s currently working as a writer and performer. Please hire him (me, it’s always been me)</p>\n<p>He’s written and produced for: Ridiculousness on MTV, The Eric Andre Show, Loiter Squad, The Meltdown, and Mystery Science Theater 3000.</p>\n<p>Hampton has performed his stand up on Conan, Comedy Central, MTV, and for multiple festivals, including: Just For Laughs, SXSW, FYF, Bridgetown Comedy Festival, Oddball Comedy Fest, New York Comedy Festival, Comedy Central South Beach Festival</p>\n<p>Currently he is the voice of Crow T. Robot on Mystery Science Theater 3000 coming soon to Netflix. He has a new album out called \"Bearable\" that is his follow up to \"Unbearable\" and Joss Whedon called it “very funny” right before quitting twitter. His new hour of material is hella tight.</p>\n",
      "pageUrl": "15979-hampton-yount"
    },
    {
      "id": 16687,
      "events": [],
      "emceeEvents": [],
      "name": "Brody Stevens",
      "twitter": "",
      "website": "http://brodystevens.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/brody.jpg",
      "photoUrl": "/api/img/performer-images/performer-brodystevens-300x300.jpg",
      "sortOrder": 8,
      "excludeFromList": false,
      "bio": "<p><strong>BRODY STEVENS</strong> was the executive producer and star of the unique Comedy Central TV series Brody Stevens: Enjoy It! Other credits include Conan, Chelsea Lately, @Midnight, Premium Blend, TMZ, The Late Late Show with Craig Kilborn, Late World with Zach, The Best Damn Sports Show Period, Tosh.0, Fox NFL Sunday, Jesus is Magic, Due Date, and The Hangover parts 1 and 2. He has positive energy.</p>\n<p>Links to Persicope profile: <a href=\"https://www.periscope.tv/BrodyismeFriend/1ZkKznvZAavKv\">https://www.periscope.tv/BrodyismeFriend/1ZkKznvZAavKv</a></p>\n<p><strong>He has 144K periscope followers, and has amassed over “21M hearts” and is the self-described “Prince of Periscope”</strong></p>\n",
      "pageUrl": "16687-brody-stevens"
    },
    {
      "id": 16039,
      "events": [],
      "emceeEvents": [],
      "name": "Allen Strickland Williams",
      "twitter": "totallyallen",
      "website": "http://www.allenstricklandwilliams.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/williams_blue_sweater_vest.jpg",
      "photoUrl": "/api/img/performer-images/performer-allenstricklandwilliams-300x300.jpg",
      "sortOrder": 9,
      "excludeFromList": false,
      "bio": "<p>Allen Strickland Williams is a stand-up comedian and writer in Los Angeles. In the fall of 2014 Allen made his television stand-up debut on <em>Conan. </em>He’s appeared on <em>Comedy Dynamics: Coming to the Stage </em>on Hulu, <em>After Darth </em>from Abominable Pictures and <em>Flophouse </em>on Viceland. Allen was recently listed as one of the 10 Best Rising Stars in LA Comedy by The Culture Trip and appeared at the 2016 New York Comedy Festival as one of Comedy Central’s <em>Comics to Watch</em>, a showcase for the hottest up-and-coming comedians in the nation. Allen was featured on the <em>Holy Fuck</em> live comedy album, and has performed at SXSW and Moontower in Austin, Texas, the Bridgetown Comedy Festival in Portland, Oregon and Funny or Die's Oddball Comedy Festival in both San Diego and Irvine, California. He has performed in Los Angeles at the Upright Citizens Brigade Theatre, The Hollywood Improv, The Laugh Factory, The Comedy Store, Holy Fuck at The Downtown Independent and Nerdmelt Showroom. He’s headlined at Acme Comedy Co. in Minneapolis and featured at Comedy Works in Denver, the Punchline in San Francisco, the American Comedy Co. in San Diego and both of the UCB Theatres in New York City. When not tinkering with jokes or going up on stage, Allen works as a freelance writer for VICE.com and produces videos with his sketch group WOMEN, which has been featured on <em>Tosh.0</em> and IFC.com's<em> Comedy Crib.</em></p>\n",
      "pageUrl": "16039-allen-strickland-williams"
    },
    {
      "id": 16904,
      "events": [],
      "emceeEvents": [],
      "name": "Anthony Atamanuik",
      "twitter": "TonyAtamanuik",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/atamanuik_headshot_2.jpg",
      "photoUrl": "/api/img/performer-images/performer-anthonyatamanuik-300x300.jpg",
      "sortOrder": 10,
      "excludeFromList": false,
      "bio": "<p>Anthony Atamanuik is a comedian and actor in New York City. He is a member of the legendary improv team Death by Roo Roo and is the co-host of AssssCat3000 at UCB New York. Anthony has appeared on 30 Rock, Broad City, Hulu&#039;s Difficult People, Dinner with Brett Gelman, specials on Adult Swim, MTV&#039;s Teacher&#039;s Lounge, and as himself, bar tending on Bravo&#039;s Watch What Happens Live. As Donald Trump, Anthony is one-half of Trump VS. Bernie, a comedy debate act that includes a memorable guest appearance on Comedy Central and two TV specials for Fusion, along with a live international tour in 2016.</p>\n<p>You can see him on a variety of platforms, including College Humor, Funny Or Die, Comedy Central Digital and even a ViewMaster photo series by Colbert Show writer Erik Drysdale </p>\n<p>Anthony will be appearing in upcoming episodes of Used People and the feature film The Outskirts.</p>\n",
      "pageUrl": "16904-anthony-atamanuik"
    },
    {
      "id": 16571,
      "events": [],
      "emceeEvents": [],
      "name": "Brent Weinbach",
      "twitter": "BrentWeinbach",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/brentweinbachheadshot_06302016050128_large.jpg",
      "photoUrl": "/api/img/performer-images/performer-brentweinbach-300x300.jpg",
      "sortOrder": 11,
      "excludeFromList": false,
      "bio": "<p>Brent Weinbach's stand-up comedy is weird and visual and post-modern and random and other stuff.  He also has a t-shirt with his name and his face on it.</p>\n<p>Brent is a winner and recipient of the Andy Kaufman Award, which is given out once a year to recognize innovation in stand-up comedy.  He is also responsible for various internet video sensations such as <em>Gangster Party Line</em> and <em>Early Facebook Commercial</em>, as well as the cult web series,<em> Pound House</em>.  Brent has appeared on <em>Conan</em>, <em>Lopez Tonight, Comedy Bang Bang, @midnight, Meltdown, The Middle, Eric Andre Show, Kroll Show</em>, and <em>Adventure Time</em>.</p>\n",
      "pageUrl": "16571-brent-weinbach"
    },
    {
      "id": 16691,
      "events": [],
      "emceeEvents": [],
      "name": "Dan Soder",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/dan_soder_-_pic_2.jpg",
      "photoUrl": "/api/img/performer-images/performer-dansoder-300x300.jpg",
      "sortOrder": 12,
      "excludeFromList": false,
      "bio": "<p>Dan Soder is a comedian whose first stand up special, Not Special premiered on Comedy Central in 2016. Other credits include: Comedy Central's The Half Hour, John Oliver's New York Stand Up show, Inside Amy Schumer, and multiple appearances on Conan and @midnight. He can be seen as Mafee on Showtime's Billions, and you can listen to The Bonfire radio show, which he co-hosts with Big Jay Oakerson, on Sirius XM every Monday and Wednesday at 6pm ET.</p>\n",
      "pageUrl": "16691-dan-soder"
    },
    {
      "id": 16927,
      "events": [],
      "emceeEvents": [],
      "name": "Karen Kilgariff",
      "twitter": "KarenKilgariff",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/karen.jpg",
      "photoUrl": "/api/img/performer-images/performer-karenkilgariff-300x300.jpg",
      "sortOrder": 2,
      "excludeFromList": false,
      "bio": "<p>Comedian Karen Kilgariff worked as an actor on HBO's legendary sketch program Mr. Show and as the head writer for Ellen DeGeneres. But she's found a niche for herself as the composer of scathingly-funny songs about smart-phone obsession, drinking on holidays and dysfunctional relationships and as the co-host of the smash hit podcast My Favorite Murder.</p>\n",
      "pageUrl": "16927-karen-kilgariff"
    },
    {
      "id": 15887,
      "events": [],
      "emceeEvents": [],
      "name": "Ian Abramson",
      "twitter": "iantherage",
      "website": "http://www.ianabramson.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/abramson_onion_avfest1_creditmattanderson-min_1.jpg",
      "photoUrl": "/api/img/performer-images/performer-ianabramson-300x300.jpg",
      "sortOrder": 14,
      "excludeFromList": false,
      "bio": "<p>Ian Abramson is from Moreno Valley, California, where he learned to walk, read, and drive, but not in that order. His stand-up is a mix of precise wordplay, longer emotionally absurd jokes, and larger conceptual pieces. In 2014 Chicago Magazine named Ian “Best Experimental Comedian” and also listed him in a separate article as one of the “16 Comedians You Should See This Fall.” In 2015 Ian was LA Weekly’s Best Up-and-Coming Comedian and a New Face for the world renowned Just For Laughs Comedy Festival in Montreal, Canada.  </p>\n<p>Ian Abramson is a regular contributor to The Onion and also the creator and host of the buzzed-about Comedy Central digital show 7 Minutes in Purgatory where comedians perform to a camera in one room while the audience watches in another room. He was also a creative consultant for Funny or Die’s digital series Our Fascinating Planet starring Demetri Martin. Ian has appeared on SeeSo’s The Comedy Show Show, Hulu’s Coming to the Stage and performed at Bonnaroo Music and Arts Festival, Pemberton Music Festival in Canada, SXSW and Moontower Comedy Festival in Austin, New York Comedy Festival, San Francisco Sketchfest, Bridgetown Comedy Festival in Portland, The Onion/A.V. Club festival in Chicago and Funny or Die’s Oddball Festival. Recent TV credits include appearances on History Channel’s Join or Die and on ABC’s The Middle.</p>\n",
      "pageUrl": "15887-ian-abramson"
    },
    {
      "id": 16578,
      "events": [],
      "emceeEvents": [],
      "name": "Fahim Anwar",
      "twitter": "fahimanwar",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/fahimanwar_03102016090331_large.jpg",
      "photoUrl": "/api/img/performer-images/performer-fahimanwar-300x300.jpg",
      "sortOrder": 15,
      "excludeFromList": false,
      "bio": "<p>Fahim Anwar is a talented comedian with multiple characters up his sleeve. He was featured on season 5 of <em><strong>Guy Code</strong></em> for MTV, and his recent FILM/TV credits include <em><strong>Neighbors, Kirstie, @midnight, </strong></em>and<em><strong> Chuck</strong></em>. You can see Fahim in Tina Fey’s war comedy film, based on Kim Barker’s memoir, titled “<em><strong>Whiskey Tango Foxtrot</strong></em>,” which was just released this March, 2016. Up next, you can catch Fahim's first one-hour special on <strong>Seeso</strong>.</p>\n",
      "pageUrl": "16578-fahim-anwar"
    },
    {
      "id": 16325,
      "events": [],
      "emceeEvents": [],
      "name": "Caleb Synan",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/caleb_synan.jpg",
      "photoUrl": "/api/img/performer-images/performer-calebsynan-300x300.jpg",
      "sortOrder": 16,
      "excludeFromList": false,
      "bio": "<p>Caleb Synan has made appearances on CONAN, NBC’s Last Comic Standing, and the Bob and Tom Show. His deceptively smart blend of Southern charm and razor sharp wit has also made him a festival favorite, with appearances at Montreal’s Just For Laughs, Laugh Your Asheville Off, The Charleston Comedy Festival, and Athfest 2015. He also won “Wittiest” in Franklin County High School’s 2009 Yearbook. And he’s a pretty nice guy.</p>\n<p>\n </p>\n<p>\n </p>\n",
      "pageUrl": "16325-caleb-synan"
    },
    {
      "id": 16581,
      "events": [],
      "emceeEvents": [],
      "name": "James Davis",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/36632_5dedfab6-22d1-42f2-9ea0-1ff1562cb983_06182015045537_large.jpg",
      "photoUrl": "/api/img/performer-images/performer-jamesdavis-300x300.jpg",
      "sortOrder": 17,
      "excludeFromList": false,
      "bio": "<p>James Davis is a rising force in comedy. Comedy Central has just given a series order to Davis' primetime TV show, <strong>The James Davis Show</strong> where Davis will explore contemporary urban topics and share his perspective on the world he grew up in through a unique, hybrid style of comedy that bridges the gap between urban and mainstream comedy. Prior to this, Davis was a recurring character on Kevin Hart’s hit show, <strong>Real Husbands of Hollywood</strong>, and a round table regular on <strong>Chelsea Lately</strong>.  James is constantly writing, directing, and producing original content for Funny Or Die and recently finished writing for James Corden’s <strong>Late Late Show</strong> on CBS. </p>\n<p>You can also catch James hosting his monthly stand-up show,<em> Urban Dictionary,</em> at the Nerdist Showroom at Meltdown Comics in Los Angeles, starring in Comedy Central’s Snapchat original series, Swag-a-Saurus, which is Comedy Centrals' most-watched Snapachat show, and performing in Comedy Central's musical number, <strong>The Jam</strong>.</p>\n",
      "pageUrl": "16581-james-davis"
    },
    {
      "id": 16212,
      "events": [],
      "emceeEvents": [],
      "name": "Nathan Brannon",
      "twitter": "nathanbrannon",
      "website": "http://www.nathanbrannon.com",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/20160728_094253_2_0.jpg",
      "photoUrl": "/api/img/performer-images/performer-nathanbrannon-300x300.jpg",
      "sortOrder": 18,
      "excludeFromList": false,
      "bio": "<p>Bio: \" Nathan is a comedian out of Portland, Oregon, who is consistently adding to his list of accomplishment year after year.  In 2016, Nathan recorded his second album, titled 'Because', with distinguished record label Kill Rock Stars. Nathan also signed with Kill Rock Stars in 2015, was the winner of the Seattle International Comedy Competition in 2014, voted into the Willamette Week's \"Portland's Funniest 5\" in 2013 while releasing his first comedy album \"I Black Out\" that same year, and was crowned “Portland’s Funniest Person” in 2012.</p>\n<p>He has been featured on national programs such as NPR's 'Weekend Edition,' and 'Laughs' on Fox. Nathan has also opened for national headliners such as Dave Chappelle, Damon Wayans, Maria Bamford, and has photoshopped himself into photos with many more. Currently, Nathan is seeking a funnier way to end this paragraph. \"</p>\n",
      "pageUrl": "16212-nathan-brannon"
    },
    {
      "id": 16037,
      "events": [],
      "emceeEvents": [],
      "name": "Lisa Best",
      "twitter": "_lisabest",
      "website": "http://www.lisabestcomedy.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/lisa_best_blue_t_smile.jpg",
      "photoUrl": "/api/img/performer-images/performer-lisabest-300x300.jpg",
      "sortOrder": 19,
      "excludeFromList": false,
      "bio": "<p>Lisa Best is a comedian, writer and performer from Los Angeles and has quickly made a name for herself in LA’s alternative scene as a brilliantly quirky comic and skilled story teller. In the spring of 2014, Lisa began headlining colleges across the country. She is a regular performer at Meltdown with Jonah and Kumail, The Laugh Factory in Hollywood, The Hollywood Improv, the Upright Citizens Brigade theatre, and was chosen to perform her hour at the Nerdmelt showroom for An Evening with Lisa Best. She has been showcased by Comedy Central and IFC, and has been seen at The Laugh Factory in Scottsdale, The Comedy Attic in Bloomington, Comedy Works in Denver, The Laughing Skull and The Improv in Atlanta and numerous other clubs around the county. She has been a featured performer at Sarah Silverman's 1st annual JASH Fesht in Palm Springs, All Jane Comedy Festival in Portland, Los Angeles' alternative comedy festival RIOT, and two years in a row at the Bridgetown Comedy Festival where The Portland Monthly wrote that Lisa \"has a flair for turning embarrassing stories into comedy gold.\" She is also a co-host for the Travel Channel pilot <em>Cheat Day, </em>performed stand up on Viceland’s <em>Flophouse </em>and appeared in digital sketches for Comedy Central, Funny or Die and IFC's Comedy Crib. But enough about her, how are you?</p>\n",
      "pageUrl": "16037-lisa-best"
    },
    {
      "id": 15888,
      "events": [],
      "emceeEvents": [],
      "name": "Joel Kim Booster",
      "twitter": "ihatejoelkim",
      "website": "http://www.ihatejoelkim.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/joel_conan.jpg",
      "photoUrl": "/api/img/performer-images/performer-joelkimbooster-300x300.jpg",
      "sortOrder": 20,
      "excludeFromList": false,
      "bio": "<p>Joel Kim Booster is a Chicago bred, Brooklyn based comedian, writer and playwright. Born in Jeju, South Korea, Joel was adopted at a young age and moved to the southwest suburbs of Chicago. Both homeschooled and evangelical, Joel has read the bible literally dozens of times, but has no idea where the state of Oregon is on a map. As a comedian he has appeared on <em>Conan</em>, Comedy Central’s <em>The Meltdown with Jonah and Kumail, </em>Logo’s <em>Comedy Cabaret </em>and truTV’s <em>Comedy Knockout</em>. His writing credits include <em>Billy on the Street </em>and the Comedy Central pilot <em>Problematic with Moshe Kasher</em>. Esquire Magazine recently listed Joel as one of their 10 Comedians to Watch in 2017.</p>\n",
      "pageUrl": "15888-joel-kim-booster"
    },
    {
      "id": 16732,
      "events": [],
      "emceeEvents": [],
      "name": "Caitlin Gill",
      "twitter": "ROBOTCAITLIN",
      "website": "http://www.caitlingillcomedy.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/c.gill_.jpg",
      "photoUrl": "/api/img/performer-images/performer-caitlingill-300x300.jpg",
      "sortOrder": 21,
      "excludeFromList": false,
      "bio": "<p>Caitlin has performed for Flophouse on Viceland, at the Oddball Comedy Tour, the Outside Lands Festival, SF Sketchfest, Bridgetown Comedy Festival and in some of the best comedy clubs in the nation. Her writing has been featured on Hidden America with Jonah Ray, the series Take My Wife and in The New York Times. She was voted Best Comedian in the East Bay Express “Best Of” Edition in 2013.  You can also hear her on podcasts like Put Your Hands Together, Competitive Erotic Fan Fiction and NPR's Snap Judgement. She co-hosts Crabapples every week at the Hollywood Improv Lab with Bobcat Goldthwait.</p>\n",
      "pageUrl": "16732-caitlin-gill"
    },
    {
      "id": 16337,
      "events": [],
      "emceeEvents": [],
      "name": "Troy Walker",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/troy_11_0.jpg",
      "photoUrl": "/api/img/performer-images/performer-troywalker-300x300.jpg",
      "sortOrder": 22,
      "excludeFromList": false,
      "bio": "<p>If you haven't heard yet, the Denver comedy scene is blowing up and comedian Troy Walker is one of the most talented local rising stars.</p>\n<p>Troy Walker has quickly become one of Denver's most sought-after comedians, a designation he'd dismiss with a modest scoff, despite its accuracy. A regular at Comedy Works, Walker has won the Comedy Works \"New Faces\" contest twice.</p>\n<p>Walker has had the pleasure of opening for some of the most  prominent comedians in the country and also serves as a fine ambassador of Denver comedy at national and local comedy festivals including The Aspen Rooftop Comedy Festival, The Great American Comedy Festival, The Laughing Skull Comedy Festival, Portland's Bridgetown Comedy Festival, The Telluride Comedy Festival, and most recently as one of Just for Laughs Montreal's New Faces of Comedy.</p>\n<p>After witnessing his storytelling abilities and commanding  presence on-stage it should come as no surprise that he's also a licensed attorney  who graduated  from The University of Denver's Sturm College of Law.</p>\n",
      "pageUrl": "16337-troy-walker"
    },
    {
      "id": 16346,
      "events": [],
      "emceeEvents": [],
      "name": "Drew Lynch",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/drewlynch002.jpg",
      "photoUrl": "/api/img/performer-images/performer-drewlynch-300x300.jpg",
      "sortOrder": 23,
      "excludeFromList": false,
      "bio": "<p>In 2015, Drew Lynch captured the hearts of America with his Golden Buzzer performance on Season 10 of America’s Got Talent. “The person I was before would probably never hangout with who I am today” is the statement that resonated most in capturing audiences across the country, as they fell in love with Drew’s charming wit and genuine vulnerability every week of the competition. “Do something every day that scares you” is a motto Drew lives by.</p>\n<p>Drew becoming a comedian was almost as unintentional as capturing America’s hearts.  Originally from Indianapolis, at the age of 19, Drew moved to Los Angeles with aspirations of becoming an actor; a dream he had since he was a kid. An unexpected softball accident just a year into his acting career left Drew with a severe stutter and crushed his hopes of ever performing again.</p>\n<p>But his continued drive to become an entertainer forced him in a different direction, often reflecting on the “softball that humbly changed his life and gave him a career”. Drew’s vulnerabilty in dealing with his stutter and making it relatable to real-life situations propelled him each week of the competition – advancing him to the finals and ultimately landing him first runner-up on season 10 of America’s Got Talent.  Drew attributes much of his success from his ability to be honest, genuinely facing the “elephant in the room” head on.  Inspired by comedians Bo Burnham, Louis C.K, he now headlines Comedy Clubs across the country.</p>\n<p>Since his success on America’s Got Talent, Drew’s career has come full circle and he has broken back into the acting scene. Drew recently garnered a recurring role on the Marc Maron Show, has appeared on “Dr. Oz,” and as a celebrity guest on the game show “Idiot Test.” He is collaborating on a book, and ultimately becoming the actor he always dreamed of, with a now different and enlightened perspective on who he thought he was, and who he is today.</p>\n<p> </p>\n",
      "pageUrl": "16346-drew-lynch"
    },
    {
      "id": 16360,
      "events": [],
      "emceeEvents": [],
      "name": "Kristin Key",
      "twitter": "thekristinkey",
      "website": "http://www.kristinkey.com/",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/kristin_key_headshot.png",
      "photoUrl": "/api/img/performer-images/performer-kristinkey-300x300.jpg",
      "sortOrder": 24,
      "excludeFromList": false,
      "bio": "<p>Kristin Key grew up a minister’s daughter in a small town in West Texas. Much like Footloose, she was raised in a no-drinking, no-dancing, no instrumental music environment, so she immediately took up drinking, dancing and playing an instrument. Proving that the almighty has a strange sense of humor, Kristin came out of the closet at 15. Needless to say, it did not go well. So, Kristin decided to “take it back”, retreat back into the closet, and try a little harder to be straight.</p>\n<p>At 19, while in college to become a paramedic, Key signed up for Open Mic Night at the local comedy club. As soon as she took the stage she felt at home. Though her observations and wit made her a local favorite, she remained in the closet, fearful of losing her local fan base. Small shows in the Texas panhandle turned into 35 states worth of comedy over the next 5 years. Audiences couldn't help but love the original comedy songs and rapid-fire style of comedy coming from the \"Preacher's Kid\", and though female comics struggled to find work she was booked not for being a woman, but for simply being funny.</p>\n<p>When Last Comic Standing held their auditions in Austin, Texas, she stood in line hoping for a chance to be seen. After 7 hours of waiting, she got her chance and her ticket to Hollywood to compete with the best in the comedy world. At the end of the season she stood among the final six and watched as her fan base exploded. With validation from millions of comedy fans, Key moved to L.A. and began preparing a new act to take on the road.</p>\n<p>While participating in an anti-bullying fundraiser, Kristin finally broke her silence and decided to share her hilarious story of coming out, taking it back, living in the closet, and meeting her wife. After 15 years in comedy, Kristin has found a way to perfectly blend together her thought provoking hilarious true stories and original songs with outrageous off-the-cuff improv moments, ensuring that no two shows are the same.</p>\n<p>She is most recognized for her appearance on Last Comic Standing, additional credits include: Comics Unleashed, VH- 1’s 100 Greatest Series, The Bob and Tom show and Sirius and XM Satellite Radio. She has released several comedy and music albums, including a new Christmas album, “It’s Beginning to Look a Lot Like Kristin” (now available on Amazon, Google, and iTunes). Much has changed from the dusty west Texas town of Amarillo to the bright lights of L.A. but the one thing that hasn't changed is that fast-paced quick witted comedy that has kept audiences rolling in the aisles from the beginning.</p>\n",
      "pageUrl": "16360-kristin-key"
    },
    {
      "id": 17008,
      "events": [],
      "emceeEvents": [],
      "name": "Andy Kindler ",
      "twitter": "",
      "website": "",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/kindler_2012_small.jpg",
      "photoUrl": "/api/img/performer-images/performer-andykindler-300x300.jpg",
      "sortOrder": 25,
      "excludeFromList": false,
      "bio": "<p>Andy Kindler currently recurs on Fox’s hit animation, <em>Bob’s Burgers </em>and Comedy Central’s <em>Tosh. O.   </em>He is also the host of Season 4 and 5 of Hulu’s standup series, <em>Coming to the Stage.  </em> Andy was a series judge on the seventh season of NBC’s <em>Last Comic Standing</em>, the star of two half-hour <em>Comedy Central Presents</em> specials and was a frequent guest and correspondent on <em>The Late Show with David Letterman </em>with over 40 appearances.  He recurred on <em>Everybody Loves Raymond</em>, Disney’s <em>Wizards of Waverly Place, </em>and IFC’s <em>Maron</em>.  Other noteworthy credits include the <em>HBO Young Comedians Special, Conan, The Daily Show, Dr. Katz Professional Therapist, Home Movies </em>and <em>The Larry Sanders Show</em>.  Every year Andy delivers his infamous <em>State of the Industry Address</em> each year at the Just for Laughs Festival in Montreal.</p>\n",
      "pageUrl": "17008-andy-kindler-"
    }
  ]
}