{
  "shows": [
    {
      "id": 11165,
      "events": [],
      "name": "Stand Up For Yourself! With Amy Miller",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/amylogobordermedium.jpg",
      "photoUrl": "/api/img/show-images/show-standupforyourselfwithamymiller-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Stand Up For Yourself! is a hybrid stand-up comedy, therapy, and morning talk show. The show began last year at Helium Comedy Club and was an instant success! It&#039;s a combination of laughs, and real talk + hilarious and revealing games, audience participation, and general humiliation. As a person obsessed with talk shows in the vein of Wendy Williams, Steve Harvey, and other shows hosted by someone with no official therapy training just doling out love and life advice to broken people, I thought...what people are more broken then comics? The show and hosting style allow a comfortable space for comics to do their regular set, and then sit down reveal some of their deepest secrets. In shows past, we&#039;ve had guests admit to a range of life events all the way from butt stuff to cancer diagnoses to suicidal thoughts to molestation to being completely clueless about love. And somehow we manage to keep it funny.\r\n\r\nAudience members love it, as they&#039;re encouraged to ask questions, ask for life advice, and try to help the comics. They&#039;re also encouraged to participate in a regular call and response of the show title with the host. \r\n&quot;STAND UP&quot;\r\n&quot;FOR YOURSELF!&quot;\r\n\r\nSome popular past segments:\r\n\r\n- &quot;Gettin&#039; Posi with Pasi&quot; - a regular segment in which Portland comic Adam Pasi compliments as many people in the room as he can in 2 minutes. Makes people feel so good!\r\n- Blind Leading the Blind - This is when a comic with a terrible relationship history gives love advice to people in the crowd\r\n- &quot;Eli-ke or E-don&#039;t like it&quot; - A segment with bi-racial Portland comedian Jeremy Eli in which I projected things that are stereotypically enjoyed by either white people or black people, and made him choose\r\n- A Walk in the Woods - Comic and Audience are led into an extended psychological test (lights down, Enya playing) many of us took at 5th grade slumber parties\r\n\r\nI&#039;d love to try this format with comics I only know a little bit about, as I think the unfamiliarity would lend itself to even more ridiculous findings.\r\n\r\nOh, and there is a plant. And a producer on a god mic à la Gelman or Letterman Liz. It&#039;s so fun!",
      "copy": "After seeing a stand-up comedy show, did you ever leave asking yourself &quot;What is wrong with these people?&quot; Equal parts &quot;Iyanla: Fix My Life&quot; and &quot;Between Two Ferns,&quot; Stand-Up For Yourself is the first hybrid stand-up comedy and therapy morning talk show that happens at night. Your favorite comics do their material and then sit down for some tough love interviews, games, and audience interactions.\r\n\r\nBring your own questions! Make them as personal as you want, I don&#039;t care! Audience participation encouraged. Prizes! Surprise guests! Games! Maybe some tears! People will laugh. \r\n\r\nLives will be changed. Comics will get fixed.\r\n\r\nHosted by the modern day Dr. Shirley, Amy Miller!\r\n",
      "pageUrl": "11165-stand-up-for-yourself-with-amy-miller",
      "iTunesUrl": ""
    },
    {
      "id": 11212,
      "events": [],
      "name": "Arguments and Grievances",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/aandg.jpg",
      "photoUrl": "/api/img/show-images/show-argumentsandgrievances-300x300.jpg",
      "sortOrder": 9999,
      "bio": " Arguments and Grievances Comedy Debates pits comedians against each other on such topics as “McRib vs. MacBeth” and “Hugs vs. Drugs”—with audiences deciding the victor.  Each show is recorded and then released as a podcast. It combines joke writing, responding to and roasting your opponent and good old fashioned pandering to create a show where almost anything can happen. The show has been happening in both Denver and Chicago for years and has consistently been one of the most popular comedy shows in both the cities. The format is really simple. Each debate consist of two comedians who get two five minute rounds to make their case on why their topic is better then their opponents and then the crowd decides the victor. ",
      "copy": "Touring regularly and hosted monthly at Chicago favorite Schuba’s Tavern, Arguments &amp; Grievances is a live comedy series and podcast featuring comedians debating outlandish topics with audiences choosing the victor. An outrageous enterprise exploring the heated issues of the day, including: &quot;Hugs vs. Drugs&quot;, &quot;Dr. Dre vs. Dr. Seuss&quot;, and &quot;Batman vs. Spiderman&quot;, Arguments and Grievances is an impressive showing of live comedy, absurdity, and engaging fun.The series and podcast is produced entirely by Chicago comedians Kevin White, Zach Peterson, Goodrich Gevaart, and Kevin Brody. Half comedy show, half rhetorical fight to the death, Arguments and Grievances is an impressive showing of live comedy, absurdity, and engaging fun.\r\n\r\n &quot;2014 BEST OF CHICAGO - VARIETY SHOW&quot; - Chicago Magazine\r\n\r\n&quot;It&#039;s smart, high-stakes tomfoolery disguised in a brilliant, faux-brainy conceit....This show is a riot.&quot;\r\n- Jason Heidemann, Chicago Tribune \r\n\r\n&quot;...it&#039;s funny, really funny.” \r\n- Allison Kelley, The Chicagoist\r\n\r\n&quot;This excellent debate series enlists some of the city&#039;s funniest underground comedians.” \r\n- Keith Griffith, Chicago Reader",
      "pageUrl": "11212-arguments-and-grievances",
      "iTunesUrl": ""
    },
    {
      "id": 11246,
      "events": [],
      "name": "Sisters From Other Misters",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/second_city_sfom_cake_batter_4x6-2.jpg",
      "photoUrl": "/api/img/show-images/show-sistersfromothermisters-300x300.jpg",
      "sortOrder": 9999,
      "bio": "A Sketch Comedy Show with real Magic and a Puppet!  \r\n\r\nSISTERS FROM OTHER MISTERS (Nicole Nasca &amp; Amanda Talbot) is a two-woman show that uniquely blends sketch comedy, classically trained magic, and not-so-classically trained ventriloquism.  Think Absolutely Fabulous meets David Copperfield meets Jeff Dunham’s worst nightmare.\r\n\r\nThe Balls Sisters, two senior sisters in their twilight years, retell their life&#039;s story in an interview backstage during America’s Got Talent.  Pearl Balls (Amanda Talbot - Second City, Magic Castle Hollywood) is a British magician who never knew her father and is her mum Molly Balls’s favorite daughter.  Kitty Kitty Balls (Nicole Nasca - Second City, UCB) is an American ventriloquist who never knew her different father and is Molly Balls’s least favorite daughter.  The Balls sisters grew up with just each other after being both abandoned by Molly Balls, only to have their bond shattered over a mistaken love triangle between Pearl Balls and Phil (Kitty Kitty’s saucy puppet).  We see the sister’s journey and struggle to reconcile with each other and make it big in show business through a series of sketches from their Vaudevillian roots to today’s TV reality shows.\r\n\r\nSISTERS FROM OTHER MISTERS is written and performed by Nicole Nasca &amp; Amanda Talbot and premiered on the Second City Hollywood main stage and is an official selection of Cake Batter’s Funny Women Festival Los Angeles.\r\n",
      "copy": "Pearl and Kitty Kitty grew up under the Vaudevillian stage...\r\n\r\nTheir mother left them for a clown,\r\nNot knowing their fathers never got them down.\r\nRaised by a drunken sailor named Bill,\r\nAll they have is magic and a puppet named Phil.\r\nAlways the very best of friends,\r\nFollow these start from start to end.",
      "pageUrl": "11246-sisters-from-other-misters",
      "iTunesUrl": ""
    },
    {
      "id": 11252,
      "events": [],
      "name": "Comedy Llama",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/12139929_1007147636014295_6518943341654027305_o.jpg",
      "photoUrl": "/api/img/show-images/show-comedyllama-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Comedy Llama is a chat show featuring a round robin of NYC&#039;s best comedians chatting with hosts Sam Haft &amp; Tommy Kang about two topics picked for each episode.\r\n\r\nWhile the premise is basic, it leaves room for some major hilarity as the free associations create deep and totally unexpected conversation tangents. For example, &quot;kids &amp; gentrification&quot; leads to a debate about whether or not you&#039;d masturbate your cat - and &quot;pizza &amp; booty&quot; leads to a story about pretending to be an Indian tarot psychic. We&#039;re beloved by our small and dedicated listener-base, and received a rave review from the Queens Chronicle, which said, &quot;while you will laugh harder than you have at most podcasts, you’ll also experience something endlessly creative and honest[...] When watching Comedy Llama, you’re witnessing craftsmanship at its most fundamental. For hardcore fans to casual observers, there’s nothing better.&quot;\r\n\r\nAs of our fourth season we now broadcast live Sunday nights at 10pm on Radio Free Brooklyn, a podcast network with an average of 2300 listeners.",
      "copy": "WHAT IS COMEDY LLAMA?\r\n\r\nBased out of NYC, Comedy Llama is what happens when a storytelling podcast meets a live-audience comedy show. A comedic confessional booth for the NYC comedy scene&#039;s best and brightest, Comedy Llama has elicited laughs, tears, and family secrets. If we had a dollar every time someone on the podcast said, &quot;I&#039;ve never told anyone that before,&quot; then we could afford most of a bag of movie theater Raisinettes.\r\n\r\nHosted by Sam Haft &amp; Tommy Kang\r\nPast guests include Pete Lee, Taylor Negron, Carole Montgomery, Monroe Martin, Mike Cannon, Derek Gaines, Danny Tamberelli, Michael Kosta, &amp; more.\r\nEdited by the patient and talented Andy Myers.",
      "pageUrl": "11252-comedy-llama",
      "iTunesUrl": ""
    },
    {
      "id": 11315,
      "events": [],
      "name": "Television:A Reunion (20 Years Later)",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/tr20flyer2.jpg",
      "photoUrl": "/api/img/show-images/show-televisionareunion20yearslater-300x300.jpg",
      "sortOrder": 9999,
      "bio": "It&#039;s a fake reunion of a real TV show improvised by comedians.\r\n\r\nListen to the ones we did at Nerdmelt here...\r\nDukes of Hazzard\r\nhttp://www.thekingoftv.com/podcast/2015/09/20/television-a-reunion-20-years-later/\r\nBuffy\r\nhttp://directory.libsyn.com/episode/index/show/dontwatchthat/id/3923544\r\nLost\r\nhttp://directory.libsyn.com/episode/index/show/dontwatchthat/id/3714077\r\nFriends\r\nhttp://dontwatchthat.libsyn.com/television-a-reunion-20-years-later\r\n\r\nhttp://www.laweekly.com/event/television-a-reunion-20-years-later-5576812",
      "copy": "\r\nImagine all the stars of your favorite TV show reuniting to share stories and reminisce.\r\nNow imagine that none of them could show up.\r\nNow you have Television: A Retrospective (20 Years Later)",
      "pageUrl": "11315-televisiona-reunion-20-years-later",
      "iTunesUrl": ""
    },
    {
      "id": 11326,
      "events": [],
      "name": "I Am Vertical ",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/i_am_vertical_promo_shot.jpg",
      "photoUrl": "/api/img/show-images/show-iamvertical-300x300.jpg",
      "sortOrder": 9999,
      "bio": "&quot;I Am Vertical&quot; is my solo show best described as a dark comedy about wanting to die, and is comprised of sketches, monologues, puppetry, storytelling, and improv. This show carries the theme of dealing with depression and anxiety, and is based on my own personal experience with clinical depression and suicidal fantasies. This is a very personal show, one that I worked hard on for almost a full year with a fabulous director, Megan Grano, and was so proud to premiere it at the Comedy Central Stage to a packed room of industry and my friends.  In the show, I bring forth all of my skill sets - there is a piece that is completely improvised, and I also have a scene with a puppet, showcasing the skills I learned at the Henson Diversity program this summer. I created this show to share my experience in a truthful yet comedic light, and have been overwhelmed with the positive feedback and support it has received. I&#039;d be honored to bring this show to Bridgetown! ",
      "copy": "&quot;I Am Vertical&quot; is a dark comedy about wanting to die, and is comprised of sketches, monologues, puppetry, storytelling, and improv. The show takes it&#039;s title from a Sylvia Plath poem of the same name, and is inspired by the creator&#039;s personal experience with depression and suicidal fantasies. ",
      "pageUrl": "11326-i-am-vertical-",
      "iTunesUrl": ""
    },
    {
      "id": 11328,
      "events": [],
      "name": "Spilt Milk Comedy Show",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/spilt_milk_logo.jpg",
      "photoUrl": "/api/img/show-images/show-spiltmilkcomedyshow-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Our strong theme is we are a clean comedy show featuring local comics and authors!  We have been selling out shows regularly in SW Portland for 3 years, as the draw for clean comedy is alive and well in Portland!  Our show could offer festival goers something different, as well as provide an opportunity for our regular followers to take in the festival.  We can pack a house!\r\nWe have a host, and 5-6 performers, each doing between 5-10 min, with a headliner doing about 15-20 minutes.  The show moves quickly, is well produced and organized, and we&#039;d love to be a part of Bridgetown!",
      "copy": "Betsy Kauffman and Joanie Quinn couldn&#039;t stay up late enough to watch, much less perform in, many of the comedy shows around Portland. So they started one of their own. &quot;Spilt Milk -- you&#039;ll laugh &#039;til you cry!&quot; was their solution. It&#039;s the &quot;Spilt MIlk: you&#039;ll laugh &#039;til you cry!&quot; comedy show at O&#039;Connors in Multnomah Village. It starts promptly at 7 p.m., and it&#039;s clean. &quot;We used to say it had to be £ber-clean; now we say it&#039;s PG-13,&quot; says Quinn.\r\n\r\n&quot;We know our audience, these are our people,&quot; says Kauffman. &quot;We all need time afterwards to go home and fold laundry.&quot;  It&#039;s a winning formula. The showcase started out as a one-night monthly event almost three years ago. Now the show draws a full house each month.  Kauffman and Quinn perform in many of the shows and give other comics and authors, most of them women, a place to perform.\r\n\r\nQuinn had always aspired to be a comedian. She took a stand-up class in Los Angeles, decades ago, when she was 25. After that she got married, moved to Portland and became enmeshed in raising four kids. &quot;An 8 year old through a junior in college; the comedy never ends,&quot; she says.\r\n\r\nKauffman took a stand up comedy class in 2006. &quot;You can take a class in anything&quot;, says Kauffman.  &quot;I was the only student who did all the homework.&quot;  By the time the class finished, she had a five-minute set.  &quot;I thought I was going to throw up,&quot; she says. &quot;I was thinking really fast. It was exhilarating and terrifying.&quot;\r\n\r\nIn 2012, they decided to start their own showcase. They run it as a business. Quinn does the promotions; Kauffman does the books. They pay comics who appear and, says Kauffman, &quot;we&#039;re organized. We start, and end, on time.&quot;  And both founders still get a huge thrill from performing.\r\n\r\n&quot;Betsy and Joanie take comedy very seriously,&quot; says Nikki Schulak, an author who has performed at Spilt Milk several times. &quot;They&#039;ve created a niche for people who need to get home in time to put their kids to bed. It works for a different crowd - and they pay us. That&#039;s awesome. It&#039;s respectful and professional. They believe in the comics they bring in.&quot;  \r\n\r\n&quot;Such a great evening!  All the performers are so different from each other, it makes for a unique, fun show!&quot; praised Cheryl Backlund, recent audience member.\r\n\r\nSpilt Milk Comedy takes place at O&#039;Connors Cafe and Bar, in SW Portland.  Our 2016 dates are Fri Jan 22, Fri Feb 12, Thur Mar 10, Fri April 8, Fri May 13, and Thur June 16.  Tickets are sold in advance at www.brownpapertickets.com/event/304474.  Website: www.spiltmilkpdx.com",
      "pageUrl": "11328-spilt-milk-comedy-show",
      "iTunesUrl": ""
    },
    {
      "id": 11332,
      "events": [],
      "name": "CATHARSIS",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/superss_ever.jpg",
      "photoUrl": "/api/img/show-images/show-catharsis-300x300.jpg",
      "sortOrder": 9999,
      "bio": "CATHARSIS:Comics Ever Mainard, Aaron Weaver and Lindsay Adams Host CATHARSIS. Catharsis is a show that challenges comedians to reveal something they hide and release their inhibitions to the room. Audience members are encouraged to drop an anonymous confession into the &quot;purge bucket&quot; and free themselves of their judgements. It&#039;s a fun &amp; humorous &quot;safe space&quot; with a unique experience every show.",
      "copy": "CATHARSIS:Comics Ever Mainard, Aaron Weaver and Lindsay Adams Host CATHARSIS. Catharsis is a show that challenges comedians to reveal something they hide and release their inhibitions to the room. Audience members are encouraged to drop an anonymous confession into the &quot;purge bucket&quot; and free themselves of their judgements. It&#039;s a fun &amp; humorous &quot;safe space&quot; with a unique experience every show.",
      "pageUrl": "11332-catharsis",
      "iTunesUrl": ""
    },
    {
      "id": 11333,
      "events": [],
      "name": "WILL POWER",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/superss_ever_0.jpg",
      "photoUrl": "/api/img/show-images/show-willpower-300x300.jpg",
      "sortOrder": 9999,
      "bio": "WILL POWER: Comics Lindsay Adams and Ever Mainard Host WILLPOWER. Will power gives life advice to audience members and give &quot;spiritual&quot; ted-like talks.   Comics are urged to tell true stories of where they don&#039;t feel good enough and Lindsay and Ever yell positive affirmations to them.  Lindsay and Ever act as spiritual life guides and interpret the comics set and give them satirical new-age advice.",
      "copy": "WILL POWER: Comics Lindsay Adams and Ever Mainard Host WILLPOWER. Will power gives life advice to audience members and give &quot;spiritual&quot; ted-like talks.   Comics are urged to tell true stories of where they don&#039;t feel good enough and Lindsay and Ever yell positive affirmations to them.  Lindsay and Ever act as spiritual life guides and interpret the comics set and give them satirical new-age advice.",
      "pageUrl": "11333-will-power",
      "iTunesUrl": ""
    },
    {
      "id": 11364,
      "events": [],
      "name": "Late Late Breakfast",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/llb.png",
      "photoUrl": "/api/img/show-images/show-latelatebreakfast-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Late Late Breakfast is a wildly fun show created and co-hosted by comedians Danny Maupin and Tyler Jackson that blends regular standup performances with huge elements of chance, absurdism, and surprise. It’s fast-paced, we put up a ton of comedians, and even we don’t always know what’s going to happen from one set to another, based on the randomization of games.\r\n\r\nFor every show, we come up with a unique set of 15 “games”. Our games are different rules or challenges that a comedian must contend with while simultaneously performing their standup set. They’re often centered around a particular topic or theme for each show and we love tailoring game sets to individual shows and venues. Comedians pop balloons at the top of their set, which reveals their game. We read the name of the game, explain the rules, set it up, and then let the fun happen while the comedian performs.\r\n\r\nSome favorite past games have included:\r\n-Loading the entire audience onto a tour bus and having the comedian give an improvised guided tour of the neighborhood\r\n-Blindfolding a comedian and having them tell jokes while also identifying different flavors of baby food\r\n-Having the entire audience come outside to watch a comedian deliver their set while flying a kite\r\n-The comedian leaves the venue and records their set as an audio file. They return to the venue at a later point in the show and lip sync to their own performance\r\n\r\nWe run two regular monthly Late Late Breakfast shows: one at The Hideout in Chicago and one at The Creek and The Cave in NYC. We’ve also brought it to several festivals over the past two years, including the New York Comedy Festival, Hell Yes Fest, and the Chicago Comedy Expo, and have been touring extensively. This has helped us develop a streamlined version of our normal show that works incredibly well at festivals and we&#039;d love to bring Late Late Breakfast to Bridgetown!",
      "copy": "Late Late Breakfast is the perfect comedy show for a drunken, weird Saturday afternoon. Hosted and co-created by lovable scamps Tyler Jackson and Danny Maupin, Late Late Breakfast is a fast-paced mixed-format standup show that the Chicago Reader simply called &quot;Chaos.&quot; \r\n\r\nEvery show is a wildly different experience and features a dizzying array of comedians telling jokes while facing a series of randomized absurdist challenges that could be anything from having an impromptu puppet show or pie fight to giving a guided tour in a trolley car, filming a short film, eating baby food, smashing fruit like Gallagher, or pitching in a baseball game involving the entire audience. \r\n\r\nExpect anything and everything out of the ordinary, all of it held together by solid, hilarious standup comedy.",
      "pageUrl": "11364-late-late-breakfast",
      "iTunesUrl": ""
    },
    {
      "id": 11405,
      "events": [],
      "name": "My Diary",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/jonathan_screen_shot.png",
      "photoUrl": "/api/img/show-images/show-mydiary-300x300.jpg",
      "sortOrder": 9999,
      "bio": "\r\nMy Diary is a show I&#039;ve been doing for a year at UCB, The Improv and Comedy Central Stages. It&#039;s just got an extended run at UCB and will be featured on Bravo&#039;s &quot;Vanderpump Rules&quot;.\r\nIt&#039;s a very special and unique show where comedians, writers and actors share diary entries from their past. But it&#039;s so much more... The performers are given free reign to recount from their entries as they see fit. We have had power point presentations, songs, dances, re-enactments, Face Times, raps, conference calls and traditional reading. It&#039;s a very special and unique show because audiences are given a chance to see a completely different side of comedians they know and love. While it&#039;s always very funny, it also has a very real and very vulnerable aspect to it which is completely compelling for audiences.  This show is full of surprises and a lot of fun. \r\nPast guests include:  Matt Braunger, Alice wetterlund, Eric Andre, Jonathan Ames (creator of bored to death/Blunt talk/ the moth) Brent Weinbach, Nick Thune, Beth Stelling, Kate Berlant, Greg Barris, Jonah Ray, Erin McGathy, Kate Freund, Curt Neil, Eric Dadourian, Timm Sharp, Mary Holland,  Milana Vayntraub, Courtney Paruso, Whitmer Thomas, Nicole Byer, John Ennis, Anna Seregina, Eliza Skinner, \r\n\r\n\r\n\r\n\r\nShould you want to see extra footage from other shows apart from the video URL below; I&#039;m attaching links from  a couple other shows since they vary \r\n\r\nComedy Central stages ft: Nicole Byer, Brent Weinbach, Whitmer Thomas, Jade Catta Pretta, and Alana Johnston - https://vimeo.com/148427621\r\n\r\nUCB Sunset ft: Jonathan Ames (Bored to death/Blunttalk) Timm Sharp, Mary Holland, Jeannie Darst, Eric Dadourian, Kate Freund, Rebecca Drysdale - https://vimeo.com/148518275\r\n\r\n",
      "copy": "Have you ever wanted to know what&#039;s in the deep dark pages of your favorite comedians diaries? \r\n\r\nWell now you will. And you&#039;ll regret it.\r\n\r\nIf you want to hear salacious, emotionally fraught, hilariously horrible moments from our diaries, this show is for you. \r\n\r\nMy Diary is the show where comedians reveal their most private moments publicly. Heaven help us all\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n* I make posters for each show, so I will have posters made up for the festival should we get in. The photo I&#039;m attaching is a sample from a past show",
      "pageUrl": "11405-my-diary",
      "iTunesUrl": ""
    },
    {
      "id": 11420,
      "events": [],
      "name": "Old New Borrowed &amp; Blue",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/oldnewbb.jpg",
      "photoUrl": "/api/img/show-images/show-oldnewborrowedampblue-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Based on the ol&#039; wedding adage the show forces comics to begin with their oldest material, then switch to brand new jokes, add a borrowed bit from a favorite comedian, then close as dirty.\r\n\r\nproduced in New York by Jake Head, Shane Torres, &amp; Ariel Elias",
      "copy": "Held monthly at the Creek &amp; The Cave in New York Old New Borrowed &amp; Blue plays off the ol&#039; wedding adage forcing comics to begin with their oldest material, then switch to brand new jokes, add a borrowed bit from a favorite comedian, then close with their dirtiest stuff.\r\n\r\nproduced by Jake Head, Shane Torres, &amp; Ariel Elias",
      "pageUrl": "11420-old-new-borrowed--blue",
      "iTunesUrl": ""
    },
    {
      "id": 11431,
      "events": [],
      "name": "The Imaginary Radio with Drennon Davis",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/irp_bridgetown_icon.jpg",
      "photoUrl": "/api/img/show-images/show-theimaginaryradiowithdrennondavis-300x300.jpg",
      "sortOrder": 9999,
      "bio": "The Imaginary Radio Program in some form has come to Bridgetown before, so you should have some idea of what to expect.  The current version of the show is now a monthly show that runs the first Sunday of every month at The Satellite in Los Angeles.  The full show includes Drennon Davis, and a slate of guest comedians and musicians, putting on an 90-120 minutes of sketch/music/improv as Drennon guides the audience through a series of &quot;stations&quot; each landing on a new song, spoken word parody or commercial parody. \r\n\r\nDrennon works with each booked guest to come up with a specific item for the show. Whether that&#039;s a pre-existing bit that they can plug into, and improvised song off a particular theme, a series of call in jokes (utilizing the other show guests as callers), or something wholly original that the guest would like to do themselves. \r\n\r\nIt&#039;s an opportunity for comedians and musicians alike to do something funny outside of stand up.  Past examples of these include: James Adomian reading &quot;Twas The Night Before Christmas&quot; in character as Jesse Ventura; Seane Keane doing a This American Life parody as Ira Glass talking about the plot of American Pie; Rachel Bloom performing her songs with backing from Drennon; Eliza Skinner on a call in show improvising songs based on caller suggestions; music mashups of two disparate artists such as Genuweinfeld (Genuwine and Seinfeld) or Jim Morrissey (Jim Morrison and Morrissey).\r\n\r\nThere are regular acts in most shows (Nick Stargu, Karen Kilgariff, Sean Keane) that Drennon often uses as well as numerous artists who have done it before either in Los Angeles or its many tour locations. There&#039;s no show like it anywhere.",
      "copy": "Songs and sketches loop together in this live show created and hosted by Drennon Davis (Conan, Last Comic Standing, Adam Devine&#039;s House Party). Featuring live songs, sketch comedy, and lots of special appearances by some of the funniest character and musical comics in the business. \r\n\r\nThe Los Angeles Comedy Bureau says the Imaginary Radio Program &quot;not only lives up to its name, but exceeds expectation in what you could possibly think it is.&quot; \r\n\r\nDrennon Davis was recently named one of LA Weekly&#039;s Top 10 Comedy Acts to Watch (2014) and Best Comedy Duo (2015, with Karen Kilgariff), as well as one of Splitsider&#039;s Top 10 Up &amp; Coming Acts in LA (2015). Davis has brought The Imaginary Radio Program to comedy festivals all over the world, including the Edinburgh Fringe Festival, SXSW, Riot LA Alternative Comedy Festival, Bridgetown Comedy Festival, Vancouver Comedy Festival, the Oddball Comedy Festival, and many more.\r\n",
      "pageUrl": "11431-the-imaginary-radio-with-drennon-davis",
      "iTunesUrl": ""
    },
    {
      "id": 11431,
      "events": [],
      "name": "The Imaginary Radio with Drennon Davis",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/irp_bridgetown_icon.jpg",
      "photoUrl": "/api/img/show-images/show-theimaginaryradiowithdrennondavis-300x300.jpg",
      "sortOrder": 9999,
      "bio": "The Imaginary Radio Program in some form has come to Bridgetown before, so you should have some idea of what to expect.  The current version of the show is now a monthly show that runs the first Sunday of every month at The Satellite in Los Angeles.  The full show includes Drennon Davis, and a slate of guest comedians and musicians, putting on an 90-120 minutes of sketch/music/improv as Drennon guides the audience through a series of &quot;stations&quot; each landing on a new song, spoken word parody or commercial parody. \r\n\r\nDrennon works with each booked guest to come up with a specific item for the show. Whether that&#039;s a pre-existing bit that they can plug into, and improvised song off a particular theme, a series of call in jokes (utilizing the other show guests as callers), or something wholly original that the guest would like to do themselves. \r\n\r\nIt&#039;s an opportunity for comedians and musicians alike to do something funny outside of stand up.  Past examples of these include: James Adomian reading &quot;Twas The Night Before Christmas&quot; in character as Jesse Ventura; Seane Keane doing a This American Life parody as Ira Glass talking about the plot of American Pie; Rachel Bloom performing her songs with backing from Drennon; Eliza Skinner on a call in show improvising songs based on caller suggestions; music mashups of two disparate artists such as Genuweinfeld (Genuwine and Seinfeld) or Jim Morrissey (Jim Morrison and Morrissey).\r\n\r\nThere are regular acts in most shows (Nick Stargu, Karen Kilgariff, Sean Keane) that Drennon often uses as well as numerous artists who have done it before either in Los Angeles or its many tour locations. There&#039;s no show like it anywhere.",
      "copy": "Songs and sketches loop together in this live show created and hosted by Drennon Davis (Conan, Last Comic Standing, Adam Devine&#039;s House Party). Featuring live songs, sketch comedy, and lots of special appearances by some of the funniest character and musical comics in the business. \r\n\r\nThe Los Angeles Comedy Bureau says the Imaginary Radio Program &quot;not only lives up to its name, but exceeds expectation in what you could possibly think it is.&quot; \r\n\r\nDrennon Davis was recently named one of LA Weekly&#039;s Top 10 Comedy Acts to Watch (2014) and Best Comedy Duo (2015, with Karen Kilgariff), as well as one of Splitsider&#039;s Top 10 Up &amp; Coming Acts in LA (2015). Davis has brought The Imaginary Radio Program to comedy festivals all over the world, including the Edinburgh Fringe Festival, SXSW, Riot LA Alternative Comedy Festival, Bridgetown Comedy Festival, Vancouver Comedy Festival, the Oddball Comedy Festival, and many more.\r\n",
      "pageUrl": "11431-the-imaginary-radio-with-drennon-davis",
      "iTunesUrl": ""
    },
    {
      "id": 11432,
      "events": [],
      "name": "Bring The Rock with Greg Behrendt and the Reigning Monarchs",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/greg_guitar_fist_for_btr.jpg",
      "photoUrl": "/api/img/show-images/show-bringtherockwithgregbehrendtandthereigningmonarchs-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Bring The Rock is a storytelling and music show in which the guest/comedian tells a story about a moment in their life that surrounds a song that is important to them, and then with the help of host/comedian Greg Behrendt and his band the Reigning Monarchs they sing that song.  It&#039;s part storytellng show, part live karaoke show.  It&#039;s a mainstay at SF Sketchfest, and a regular show at the Largo in Los Angeles. \r\n\r\nThe joy of the show is getting to hear comedians, actors, musicians and storytellers say stories that you&#039;ve never heard them talk about before as it surrounds their love or hate for a song, and then get to see them perform that song in front of a crowd often not used to hearing them perform music (unless obviously they are musicians, in which case you get to hear them tell stories you rarely get to hear).\r\n\r\nThis show has been around for quite some time, but has taken periodic hiatuses over the years.  It has had amazing guests ranging from Colin Hay, Grant Lee Phillips and Josh Homme to Marc Maron, Chris Hardwick and Moon Zappa.",
      "copy": "Greg Behrendt brings his wildly popular Bring The Rock show to Bridgetown! The Los Angeles Largo staple gives comedians the chance to tell a story about a song from their past- sometimes embarrassing, sometimes sentimental, always funny- and then Greg’s fantastic band The Reigning Monarchs covers the song, often led by the comedian in question. It’s what karaoke should be. ",
      "pageUrl": "11432-bring-the-rock-with-greg-behrendt-and-the-reigning-monarchs",
      "iTunesUrl": ""
    },
    {
      "id": 11432,
      "events": [],
      "name": "Bring The Rock with Greg Behrendt and the Reigning Monarchs",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/greg_guitar_fist_for_btr.jpg",
      "photoUrl": "/api/img/show-images/show-bringtherockwithgregbehrendtandthereigningmonarchs-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Bring The Rock is a storytelling and music show in which the guest/comedian tells a story about a moment in their life that surrounds a song that is important to them, and then with the help of host/comedian Greg Behrendt and his band the Reigning Monarchs they sing that song.  It&#039;s part storytellng show, part live karaoke show.  It&#039;s a mainstay at SF Sketchfest, and a regular show at the Largo in Los Angeles. \r\n\r\nThe joy of the show is getting to hear comedians, actors, musicians and storytellers say stories that you&#039;ve never heard them talk about before as it surrounds their love or hate for a song, and then get to see them perform that song in front of a crowd often not used to hearing them perform music (unless obviously they are musicians, in which case you get to hear them tell stories you rarely get to hear).\r\n\r\nThis show has been around for quite some time, but has taken periodic hiatuses over the years.  It has had amazing guests ranging from Colin Hay, Grant Lee Phillips and Josh Homme to Marc Maron, Chris Hardwick and Moon Zappa.",
      "copy": "Greg Behrendt brings his wildly popular Bring The Rock show to Bridgetown! The Los Angeles Largo staple gives comedians the chance to tell a story about a song from their past- sometimes embarrassing, sometimes sentimental, always funny- and then Greg’s fantastic band The Reigning Monarchs covers the song, often led by the comedian in question. It’s what karaoke should be. ",
      "pageUrl": "11432-bring-the-rock-with-greg-behrendt-and-the-reigning-monarchs",
      "iTunesUrl": ""
    },
    {
      "id": 11437,
      "events": [],
      "name": "Kill Tony Podcast",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/kill_tony_logo.png",
      "photoUrl": "/api/img/show-images/show-killtonypodcast-300x300.jpg",
      "sortOrder": 9999,
      "bio": "The Kill Tony podcast is a live showcase of comedians talking about comedy while critiquing the performances of randomly selected comics who each perform 1 minute of comedy.  Host/creator Tony Hinchcliffe, along with producer Brian Redban, two guest comedians and band leader / sidekick Pat Regan talk about what went well, what needs work, tips for improving performances, stories of their own times starting out in comedy and jkoes amongst themselves in a unique experience that allows anyone who submits to potentially do comedy in front of and be mentored by some of the best comedians working.  Guests have included the likes of Marc Maron, Bill Burr, Sarah Silverman, Joe Rogan, and many others.  It&#039;s already gone for 133 episodes over the past 3 years and continues to rack up on average 100,000 listeners an episode, and around 250,000 at its peak. Tony, and often the other comedians on the show, are also on Periscope and getting feedback from their fans as the show goes on.",
      "copy": "Host Tony Hinchcliffe holds his wildly popular podcast with his co host Brian Redban. Rising young up and coming comics or failing older comics get their name pulled out of a bucket, do one minute of material each, and then Tony and his two weekly friends/guests (different each week, pasts guests include Doug Benson, Marc Maron, Russell Peters, Bobby Lee, etc.) give feedback, extra material, and ask questions to the young performers always leading to a hilarious debacle. Kill Tony episodes can be found at deathsquad.tv and on iTunes.",
      "pageUrl": "11437-kill-tony-podcast",
      "iTunesUrl": ""
    },
    {
      "id": 11437,
      "events": [],
      "name": "Kill Tony Podcast",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/kill_tony_logo.png",
      "photoUrl": "/api/img/show-images/show-killtonypodcast-300x300.jpg",
      "sortOrder": 9999,
      "bio": "The Kill Tony podcast is a live showcase of comedians talking about comedy while critiquing the performances of randomly selected comics who each perform 1 minute of comedy.  Host/creator Tony Hinchcliffe, along with producer Brian Redban, two guest comedians and band leader / sidekick Pat Regan talk about what went well, what needs work, tips for improving performances, stories of their own times starting out in comedy and jkoes amongst themselves in a unique experience that allows anyone who submits to potentially do comedy in front of and be mentored by some of the best comedians working.  Guests have included the likes of Marc Maron, Bill Burr, Sarah Silverman, Joe Rogan, and many others.  It&#039;s already gone for 133 episodes over the past 3 years and continues to rack up on average 100,000 listeners an episode, and around 250,000 at its peak. Tony, and often the other comedians on the show, are also on Periscope and getting feedback from their fans as the show goes on.",
      "copy": "Host Tony Hinchcliffe holds his wildly popular podcast with his co host Brian Redban. Rising young up and coming comics or failing older comics get their name pulled out of a bucket, do one minute of material each, and then Tony and his two weekly friends/guests (different each week, pasts guests include Doug Benson, Marc Maron, Russell Peters, Bobby Lee, etc.) give feedback, extra material, and ask questions to the young performers always leading to a hilarious debacle. Kill Tony episodes can be found at deathsquad.tv and on iTunes.",
      "pageUrl": "11437-kill-tony-podcast",
      "iTunesUrl": ""
    },
    {
      "id": 11474,
      "events": [],
      "name": "Part 2: The Sequel Show",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/p2.jpg",
      "photoUrl": "/api/img/show-images/show-part2thesequelshow-300x300.jpg",
      "sortOrder": 9999,
      "bio": "The Best Movie Sequels Are The Ones Pitched By Comics\r\n\r\nWhat’s better than your favorite movies? The SEQUELS to those movies performed by your favorite comedians!!! Join Tony Sam and Julia Prescott as they co-host Part 2: The Sequel Show, aka the “69th Annual Sequel Show,” aka the “Pitchies.” \r\n\r\nThis hilarious show honors the best in unwritten movies, because the greatest sequels are the ones that haven’t been made yet. The best comedians from across the country present their idea for a side-splitting sequel to their favorite movie and at the end of the show, the studio audience will vote on who receives the coveted title of, “Best Pitch.” So don your Awards Show best, get camera-ready, and come on out for the best night in Movie Sequels’ history!\r\n\r\nShow rundown: Your hosts Julia Prescott and Tony Sam present the show and performers will be festival participants/comedians with bits about movie sequels.",
      "copy": "The Best Movie Sequels Are The Ones Pitched By Comics\r\n\r\nWhat’s better than your favorite movies? The SEQUELS to those movies performed by your favorite comedians!!! Join Tony Sam and Julia Prescott as they co-host Part 2: The Sequel Show, aka the “69th Annual Sequel Show,” aka the “Pitchies.” \r\n\r\nThis hilarious show honors the best in unwritten movies, because the greatest sequels are the ones that haven’t been made yet. The best comedians from across the country present their idea for a side-splitting sequel to their favorite movie and at the end of the show, the studio audience will vote on who receives the coveted title of, “Best Pitch.” So don your Awards Show best, get camera-ready, and come on out for the best night in Movie Sequels’ history!\r\n\r\nSee the show LA WEEKLY says “… there&#039;s no way you&#039;ll want to miss this ...” SO DON’T! Toss in a musical act, dancing and surprises, and you&#039;ve got an action-packed awards show!! ",
      "pageUrl": "11474-part-2-the-sequel-show",
      "iTunesUrl": ""
    },
    {
      "id": 11474,
      "events": [],
      "name": "Part 2: The Sequel Show",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/p2.jpg",
      "photoUrl": "/api/img/show-images/show-part2thesequelshow-300x300.jpg",
      "sortOrder": 9999,
      "bio": "The Best Movie Sequels Are The Ones Pitched By Comics\r\n\r\nWhat’s better than your favorite movies? The SEQUELS to those movies performed by your favorite comedians!!! Join Tony Sam and Julia Prescott as they co-host Part 2: The Sequel Show, aka the “69th Annual Sequel Show,” aka the “Pitchies.” \r\n\r\nThis hilarious show honors the best in unwritten movies, because the greatest sequels are the ones that haven’t been made yet. The best comedians from across the country present their idea for a side-splitting sequel to their favorite movie and at the end of the show, the studio audience will vote on who receives the coveted title of, “Best Pitch.” So don your Awards Show best, get camera-ready, and come on out for the best night in Movie Sequels’ history!\r\n\r\nShow rundown: Your hosts Julia Prescott and Tony Sam present the show and performers will be festival participants/comedians with bits about movie sequels.",
      "copy": "The Best Movie Sequels Are The Ones Pitched By Comics\r\n\r\nWhat’s better than your favorite movies? The SEQUELS to those movies performed by your favorite comedians!!! Join Tony Sam and Julia Prescott as they co-host Part 2: The Sequel Show, aka the “69th Annual Sequel Show,” aka the “Pitchies.” \r\n\r\nThis hilarious show honors the best in unwritten movies, because the greatest sequels are the ones that haven’t been made yet. The best comedians from across the country present their idea for a side-splitting sequel to their favorite movie and at the end of the show, the studio audience will vote on who receives the coveted title of, “Best Pitch.” So don your Awards Show best, get camera-ready, and come on out for the best night in Movie Sequels’ history!\r\n\r\nSee the show LA WEEKLY says “… there&#039;s no way you&#039;ll want to miss this ...” SO DON’T! Toss in a musical act, dancing and surprises, and you&#039;ve got an action-packed awards show!! ",
      "pageUrl": "11474-part-2-the-sequel-show",
      "iTunesUrl": ""
    },
    {
      "id": 11489,
      "events": [],
      "name": "Garbage People!",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/title.jpg",
      "photoUrl": "/api/img/show-images/show-garbagepeople-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Chanukah 2014 I was still whining about the death of a bar show I had run for 3 months with Eden Nault. Holiday party at my friend Rebecca’s house by Hawthorne yielded a possible new venue (The Waypost) and a guy who would rather be a comedian than the musical guest (Hutch Harris) it was a great stroll around Peacock Lane, and the following month Kickstand Comedy Space and The Waypost said yes at the same time!\r\n\r\nArt followed me around until I could do something with it. The comic book artist who became a podcaster turned into the conductor of a beautifully ugly emotional orchestra.\r\n  Garbage People asks my favorite comedians to tell a story of fucking up, getting numb, blacking out, losing teeth, getting arrested, or dumping someone like a jerk. At the outset of each show I ask the audience to clap if you’ve ever fallen down, failed, or made an ass of yourself--and then I tell them congratulations! if you sat in silent judgment while other people clapped, you’re a Garbage Person, too!\r\n\r\nGarbage People will have a birthday show with Bri Pruett and Crystal Kordowski on January 16, we will be in Denver on February 12, back in Portland for post-Valentine’s heartbreak on February 20 with Nathan Brannon and Adam Pasi, in Los Angeles in my friend Miranda King’s backyard in March, and then Garbage Island will pull up to NYC in April with Mike Daisey. Mike had the most-downloaded episode of This American Life ever, where he traveled to Hong Kong to study how our phones and gadgets are made by slaves who suffer terribly. Ira Glass became enraged when he found out that Daisey had told some of the stories from his own perspective -- that of a rich, rotund, white, American businessman -- to give them more currency. He lied. He’s one of my heroes and I have seen his amazing spoken word shows and taken classes from him at the TBA festival.",
      "copy": "Garbage People! is the comedy storytelling show where your favorite funny people tell fucked-up true stories about how horrible they&#039;ve been. \r\n  &quot;Garbage people takes the villain of the story, which is usually some terrible boss or neighbor or ex, and puts them onstage\r\nlike Richard III confessing his mistakes and motivations to the audience,&quot; says creator Brodie Kelly. &quot;Tell us the story where YOU\r\nare the bad ex, where YOU fuck up.&quot;\r\n  The show has been going for a year in Portland &amp; will be touring the country starting in 2016.",
      "pageUrl": "11489-garbage-people",
      "iTunesUrl": ""
    },
    {
      "id": 11492,
      "events": [],
      "name": "Lounge Act!",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/32254_1409517552344_2859497_n_1.jpg",
      "photoUrl": "/api/img/show-images/show-loungeact-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Everybody in the PNW dresses like they went to take out the trash and just kept walking. Let&#039;s get these funny people in snazzy shirts and suits, in fancy dresses and THEN they can tell their hacky dick jokes! As with my other shows, I focus on booking everybody BUT your standard-issue able-bodied straight white cismale in a hoodie. But he&#039;s welcome to work the door.",
      "copy": "A stand-up comedy cocktail party with fancy clothes and sleazy jokes! Join &quot;Brodie the Lounge Singer&quot; (Beloved local entertainer Brodie Kelly) and 6 suave sex-sapients as they get dressed up all fancy and start talkin&#039; real funny. The amazing, the irascible, the indomitable Ira Novos plays piano between sets, because if time itself can&#039;t stop him nobody can!",
      "pageUrl": "11492-lounge-act",
      "iTunesUrl": ""
    },
    {
      "id": 11518,
      "events": [],
      "name": "comics on surfari",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/comics_on_surfari.jpg",
      "photoUrl": "/api/img/show-images/show-comicsonsurfari-300x300.jpg",
      "sortOrder": 9999,
      "bio": "A group of professional comedians who tour California performing and surfing...  sponsored by Quiksilver, Maui and Sons and Body Glove\r\n\r\nComics include: Andy Wood, Lachlan Patterson, Graham Elwood, Monty Franklin, Joe Sib, Mike Siegel and Murray Valeriano ",
      "copy": "",
      "pageUrl": "11518-comics-on-surfari",
      "iTunesUrl": ""
    },
    {
      "id": 11519,
      "events": [],
      "name": "road stories podcast",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/logo_copy.jpg",
      "photoUrl": "/api/img/show-images/show-roadstoriespodcast-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Today&#039;s top comedians telling stories of life on and off the road. ",
      "copy": "",
      "pageUrl": "11519-road-stories-podcast",
      "iTunesUrl": ""
    },
    {
      "id": 11546,
      "events": [],
      "name": "So You Think You Can Rant",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/rant-show-banner.jpg",
      "photoUrl": "/api/img/show-images/show-soyouthinkyoucanrant-300x300.jpg",
      "sortOrder": 9999,
      "bio": "An high energy and ridiculous ensemble show for stand ups and improvisers based in Toronto\r\n\r\nhttp://empirecomedylive.com/so-you-think-you-can-jfl42/\r\n\r\nIn 2015, So You Think You Can Rant was a breakout hit at Comedy Bar&#039;s annual festival of New Formats, and went on to be included in Toronto&#039;s Big City Improv Festival, and peripherally as part of Toronto&#039;s JFL42\r\n\r\nBasic format\r\n\r\nEach participant pulls two topics out of the bucket 5 minutes before their set, and they can choose whichever one they prefer. They then get 5-6 minutes to rant/talk off the cuff about that topic (or wherever they may tangentially roam with it).\r\n\r\nFor example, the performer might pull &quot;The Gym&quot;, and from there they might go on a rant about: going to the gym, people they hate at the gym, fitness culture in general, the worship of unrealistic body images, or just a story about that time they farted really loudly in yoga class. Topics are kept general to allow performers to choose their own trajectory. Politics instead of President Obama, Pop Culture instead of Taylor Swift.\r\n\r\nIt can be deep, juvenile, and everything in between. They can also do 2-3 minutes on each topic if they prefer. Most seem to prefer doing both.\r\n\r\nSo You Think You Can Rant works well as a late night party show since the sets are fairly short, and the performances are as much fun to watch for the performers as they are for the audience.\r\n\r\nSeveral Toronto comics who have already submitted for this year&#039;s festival in Bridgetown have participated before and can host the show if you choose to include it &amp; them as part of your programming.\r\n(DeAnne Smith, Andrew Ivimey, Amanda Brooke Perrin, and Mark Little (if he&#039;s submitted)). If you don&#039;t accept them for the fest, I can come out and run it myself.\r\n\r\n\r\n\r\n**Quick note about Empire Comedy Live, we&#039;ve presented Matt Braunger twice before (2013 &amp; 2014) , and working on dates for 2016. I know this doesn&#039;t tell you anything about the show, but Matt can at least tell you that we&#039;re not total maniacs.  More on our other events at: http://empirecomedylive.com/artists/\r\n\r\n\r\n",
      "copy": "A hit show from Toronto&#039;s Festival of New Formats at Comedy Bar!\r\n\r\nSo You Think You Can Rant features a fun ensemble of intelligent, opinionated, &amp; quick witted comedians who are surprised with their topic 5 minutes before taking the stage\r\n\r\nThen they hit the stage, their topic and the audience with everything they’ve got!\r\n\r\nRidiculousness ensues",
      "pageUrl": "11546-so-you-think-you-can-rant",
      "iTunesUrl": ""
    },
    {
      "id": 11550,
      "events": [],
      "name": "Joke Thieves",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/jt_newlogo_web.png",
      "photoUrl": "/api/img/show-images/show-jokethieves-300x300.jpg",
      "sortOrder": 9999,
      "bio": "It&#039;s Comedy Set Swapping LIVE!   The show where comedians perform their own jokes, then each others&#039;.   Will it be a car crash or an improv masterclass?   The fun is in the finding out.\r\n\r\nThe show has enjoyed three sell-out runs at the Edinburgh Fringe (2013 - 2015), regular packed houses at it&#039;s U.K. comedy club residencies (Downstairs @ The King&#039;s Head, London &amp; The Stand, Edinburgh) and huge successes overseas in Singapore, Hong Kong, Australia, Norway, Iceland, Austria and the U.S.   The format is currently being adapted for television by the team at the Comedy Unit (part of Zodiac Media) and has been made into a BBC2 television pilot in the U.K.   Outside of the U.K. the show is being developed in conjunction with ICM Partners.\r\n\r\nHere&#039;s some of our press/accolades over the last couple of years:\r\n\r\nWINNER: Chortle Award for Best Club Show 2015 - London\r\nSHORTLISTED: TOP 5 Comedy Shows of 2014 (The List)\r\nCritics Choice &amp; TOP 10 late nights out at the fringe (Time Out London)\r\nCritics Choice (Time Out New York)\r\nCritics Pick (New York Times)\r\n\r\n&#039;One of the most eye-opening hours I&#039;ve spent at the fringe ... a brilliant format&#039; (Brian Logan, The Guardian, UK)\r\n&#039;It&#039;s a comedians&#039; in-joke that everyone in the room can enjoy&#039; (Alice Jones, The Independent, UK)\r\n&#039;Spontaneous and anarchic, Joke Thieves is a unique, thoroughly enjoyable hour of mischief&#039; (Jay Richardson, Fest Magazine, UK)\r\n&#039;See comics deconstructing each other&#039;s acts ... and you have a truly electric night&#039; (Brian Donaldson, The Scotsman, UK)\r\n&#039;An undoubted hit ... the birth of a new cult comedy night&#039; (Steve Bennett, Editor of chortle.co.uk, UK)\r\n&#039;One of the best live shows we&#039;ve seen ... it&#039;s ace!&#039; (Mark Boosey, Editor of British Comedy Guide, UK)\r\n\r\nNOTES:  This show would be hosted by MATT KIRSHEN who is already down to perform as part of the festival.  The 4 guests on each show can all come from the festival line-up although a small element of consultation will need to take place with me to ensure we get the best variety of performers for the format.\r\n",
      "copy": "It&#039;s comedy set swapping live! The show where comedians perform their own jokes, then each other&#039;s. Best comedy club show – London 2015 (Chortle Awards). Top five comedy shows of 2014 (List, UK). Top 10 late nights out at the Fringe (Time Out). &#039;A brilliant format&#039; (Guardian, UK). &#039;Birth of a new cult comedy night ... an undoubted hit&#039; (Chortle.co.uk). &#039;Spontaneous and anarchic&#039; **** (Fest, UK). &#039;A truly electric night&#039; **** (Scotsman, UK). &#039;Action-packed and chaotic&#039; **** (BroadwayBaby.co.uk). &#039;Deserves more than one visit&#039; **** (One4Review.co.uk). As heard on BBC Radio 4 Extra&#039;s Comedy Club and recently made into a BBC2 television pilot in the U.K.",
      "pageUrl": "11550-joke-thieves",
      "iTunesUrl": ""
    },
    {
      "id": 11553,
      "events": [],
      "name": "Picture This!",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/picturethis_logo3s_copy.jpg",
      "photoUrl": "/api/img/show-images/show-picturethis-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Picture This!, as listed in your list of shows with strong themes, is a successfully touring show in LA/SF/NY and festivals around the country. Each show is a unique one night experience in the mashup of comedians and animators. Ideally we could come back every year like Competitive Erotic Fan Fiction because each show is unique, but we&#039;d at least love to come back since it&#039;s been 3 years since our first show where we nearly sold out the Hollywood Theatre the first year the festival used that venue. Also our monthly franchise in Portland has been over for months so we&#039;d love to come back to Portland. We will source our own animators and can work with the festival to book the comedian spots with other festival performers though Sam Varela needs to be able to influence who is an option for the show since not all performers are a good fit for the show (both newbies and headliners alike.) The following is a description of the show:\r\n\r\nPICTURE THIS! is a new show from Brandie Posey &amp; Sam Varela: two girls who want to push the boundaries of what a comedy show can be. Picture This! is a live comedy show with stand-ups, voice actors and more performing while they are drawn live by some of the best animators, cartoonists, and other artists in the biz! The comedians don’t know what the animators are drawing and the animators don’t know how the comedians will react.\r\n\r\nIt may be weird.\r\nIt may different.\r\nBut it will be FUNNY!\r\n\r\nPicture This! has been going on monthly for over 3 years in LA with both the regular monthly show and special sponsored shows with sponsors like Bento Box Entertainment, Comedy Central’s Brickleberry, Adult Swim’s Mr. Pickles, Netflix’s BoJack Horseman, Cartoon Network and more! The show also has franchised monthly shows in NY, San Francisco and Portland. The show has also debuted in Toronto and the following festivals:\r\n\r\n2013 Adelaide Fringe Festival\r\n2013 Melbourne International Comedy Festival\r\n2013 Bridgetown Comedy Festival\r\n2014 San Francisco Sketchfest\r\n2014 All Jane No Dick Comedy Festival\r\n2015 Green Gravel Comedy Festial\r\n2015 CROM Comedy Festival Denver\r\n2015 Animation Block Party Festival \r\n2015 Hell Yeah Fest\r\n2015 New York Comedy Festival",
      "copy": "PICTURE THIS! is a new show from Brandie Posey &amp; Sam Varela: two girls who want to push the boundaries of what a comedy show can be. Picture This! is a live comedy show with stand-ups, voice actors and more performing while they are drawn live by some of the best animators, cartoonists, and other artists in the biz! The comedians don’t know what the animators are drawing and the animators don’t know how the comedians will react.\r\n\r\nIt may be weird.\r\nIt may different.\r\nBut it will be FUNNY!\r\n\r\nPicture This! has been going on monthly for over 3 years in LA with both the regular monthly show and special sponsored shows with sponsors like Bento Box Entertainment, Comedy Central’s Brickleberry, Adult Swim’s Mr. Pickles, Netflix’s BoJack Horseman, Cartoon Network and more! The show also has franchised monthly shows in NY, San Francisco and Portland. The show has also debuted in Toronto and the following festivals:\r\n\r\n2013 Adelaide Fringe Festival\r\n2013 Melbourne International Comedy Festival\r\n2013 Bridgetown Comedy Festival\r\n2014 San Francisco Sketchfest\r\n2014 All Jane No Dick Comedy Festival\r\n2015 Green Gravel Comedy Festial\r\n2015 CROM Comedy Festival Denver\r\n2015 Animation Block Party Festival \r\n2015 Hell Yeah Fest\r\n2015 New York Comedy Festival",
      "pageUrl": "11553-picture-this",
      "iTunesUrl": ""
    },
    {
      "id": 11574,
      "events": [],
      "name": "Dungeon",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/remi_bridgetown.jpg",
      "photoUrl": "/api/img/show-images/show-dungeon-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Dungeon is comedy, Dungeons &amp; Dragons style. Players face off against devious Dungeon Master Remi Treuer in adventures sure to make you laugh, gasp, and cheer.\r\n\r\nMost role-playing game themed shows are similarly formatted. People sit around a table and play Dungeons &amp; Dragons, riffing on what&#039;s happening. The mechanics of the game are opaque, and the show is firmly aimed at people already expert in the language of role-playing games. In Dungeon, the adventure IS the comedy. The rules are simple and clear, even to people entirely unfamiliar with Dungeons &amp; Dragons or other role-playing games. A single player-comedian is led through a short adventure prompted by Remi the Dungeon Master, who crafts each set to the comedian, their character, and the moment-to-moment events of their adventure.\r\n\r\nProduction value such as costumes, projected die rolling, and custom fantasy portraits of the comedians on stage adds to an atmosphere of fun and adventure. Dungeon’s level of crowd engagement is very high, as well. The adventures draw the audience in, and they hang on every die roll, slowly ratcheting up the tension and humor until everyone is on the player’s side, pulling for their victory, or their hilarious doom.\r\n\r\nIn addition to the three adventure sections, the are also three 6-10 minute stand-up sets. These are used as a breather and palette-cleanser between adventures. The comedians in these slots DO NOT have to be geek-oriented. The format of the show is as follows: Introduction - Stand-up - Adventure - Stand-up - Adventure - Stand-up - Adventure - Close.\r\n\r\nIn October 2014 Dungeon established itself in Atlanta at the Hangar performance space, where it was a monthly show.  Dungeon continues to perform month at its current home at the Highland Inn Ballroom. Dungeon has toured and been featured at Crom Comedy Festival in Omaha, NE, Epic Comedy Hour’s 4-year Anniversary Show in Huntsville, AL and the Harry Potter-focused CONjuration in Atlanta, GA. It was praised in 2014 end of year lists on both laughbutton.com and brightestyoungthings.com.",
      "copy": "Dungeon is comedy, Dungeons &amp; Dragons style! Players face off against devious Dungeon Master Remi Treuer in adventures sure to make you laugh, gasp, and cheer! Featuring a variety of incredible stand-up comedians!\r\n\r\nAfter establishing itself in Atlanta at the Hangar performance space and its current home at the Highland Inn Ballroom, Dungeon has toured and been featured at Crom Comedy Festival in Omaha, NE, Epic Comedy Hour’s 4-year Anniversary Show in Huntsville, AL and the Harry Potter-focused CONjuration in Atlanta, GA. It was praised on 2014 end of year lists on both laughbutton.com and brightestyoungthings.com",
      "pageUrl": "11574-dungeon",
      "iTunesUrl": ""
    },
    {
      "id": 11612,
      "events": [],
      "name": "Minority Retort ",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/mr_logo_8.jpg",
      "photoUrl": "/api/img/show-images/show-minorityretort-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Minority Retort is the NW’s only stand-up showcase focusing on comedians of color. Hosted by comedian Jeremy Eli and co-produced by writer/podcaster Jason Lamb, Minority Retort has quickly become one of Portland’s most popular and critically acclaimed comedy shows. Our goal is to provide comedians of color with a platform to speak their minds and share their unique perspectives, as well as reach the diverse comedy audience that exists within the so-called &quot;whitest city in America&quot;.  \r\n\r\nNational headliners Baron Vaughn (Netflix’s Grace &amp; Frankie) and Maggie Maye (Conan) have performed on the show, as well as many comics frequently featured in Portland&#039;s Bridgetown Comedy Festival: Curtis Cook, Bri Pruett, Elicia Sanchez, Anthony Lopez, Jeff Oliver, Adam Pasi, David Mascorro, Katie Nguyen and Nathan Brannon (winner of Seattle&#039;s Funniest Person - 2014). For more info, visit Minority Retort on Facebook or on Twitter at @iMinorityRetort.\r\n",
      "copy": "Minority Retort is the NW’s premier stand-up showcase featuring comedians of color. Host Jeremy Eli and co-producer Jason Lamb bring together the funniest African-American, Latino, Asian-American, Middle Eastern, Pacific Islander and Native American voices in comedy to share their unique and hilarious perspectives with smartest, most diverse and best-looking audiences around!\r\n",
      "pageUrl": "11612-minority-retort-",
      "iTunesUrl": ""
    },
    {
      "id": 11628,
      "events": [],
      "name": "Festival the Show",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/festivaltheshowphoto_small.jpg",
      "photoUrl": "/api/img/show-images/show-festivaltheshow-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Festival the Show is an hour to an hour and a half long show that aims to shed light on the hilarities and hypocrisies of festival culture. The show was written in sketch format but has strong story arch and character development. With &quot;tweeners&quot; between every act, the show is captivating from beginning to end. Although it is aimed at addressing festival culture, there are many jokes that are analogous to everyday life. With live music, original song and dance numbers, circus acts, elaborate costuming and larger than life props, there is truly something for everyone. ",
      "copy": "Festival the Show is a  pertinent sketch comedy show that satirizes, entertains, &amp; educates the festival inclined. With catchy original show tunes, elaborate costumes, larger than life props, and high flying circus, acts this show is non-stop entertainment. The creators have recruited a multitalented performance ensemble to take you on a cleverly constructed ride that will take festival goers through the depths of spiritual awakenings, awkward interactions in the sauna, the grief of setting up camp and so much more.  ",
      "pageUrl": "11628-festival-the-show",
      "iTunesUrl": ""
    },
    {
      "id": 11657,
      "events": [],
      "name": "Roast Yourself",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/logo.jpg",
      "photoUrl": "/api/img/show-images/show-roastyourself-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Roast Yourself is a monthly show that began in Omaha, NE. It combines a stand up showcase with a roast. Three roasters/writers sit on the stage for the entire show. A comedian will perform a set (approximately 8 minutes, but can be adjusted due to show length or number of performers), and while they perform, the roasters write jokes about the performing comedian and their set. At the end of the set, the comedian takes the notecards the jokes are on and read them to the audience. At the end of the show, the roasters read jokes the performers wrote about them. \r\nThis is a great show for festivals due to the number of comedians that can participate. Mike Perry hosts and writes, and two other comedians join him on the roast panel. Each performer will take a total of 9-10 minutes including their reading of the roast jokes, so in a 90 minute show, you can have 10 comics involved plus Mike as the host. \r\nThe submitted set is from the Crom Comedy Festival and the panel includes Bryan Cook (Competitive Erotic Fan Fiction) and James Adomian (Comedy Bang Bang). ",
      "copy": "Roast Yourself is a show from Omaha, NE hosted by Mike Perry. It&#039;s a stand-up showcase, but while your favorite comedians are performing, Mike and his guest roast panel are writing jokes about the performer and their set. When the comedian finishes their set, they are handed the roast jokes written by the panel and forced to read them to the audience. Since turnabout is fair play, at then end of the show the roast panel will read jokes written for them by the comedians that performed. ",
      "pageUrl": "11657-roast-yourself",
      "iTunesUrl": ""
    },
    {
      "id": 11660,
      "events": [],
      "name": "Meme: The Future of Comedy Online?",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/princess.jpg",
      "photoUrl": "/api/img/show-images/show-memethefutureofcomedyonline-300x300.jpg",
      "sortOrder": 9999,
      "bio": "A round table discussion about &quot;weird Facebook&quot; &quot;weird Twitter&quot; and how they into the landscape of comedy.",
      "copy": "Like you have anything better to do!",
      "pageUrl": "11660-meme-the-future-of-comedy-online",
      "iTunesUrl": ""
    },
    {
      "id": 11674,
      "events": [],
      "name": "Bad Comedy Theatre",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/bad_comedy_theater.jpg",
      "photoUrl": "/api/img/show-images/show-badcomedytheatre-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Bad Comedy Theatre is a show where comics show clips of their earliest attempts at stand-up on a video screen and do a running director&#039;s commentary making fun of how bad they are. It&#039;s fun. Audiences have a great time because they get to laugh at the awkwardness and bad jokes in the videos, plus the comics&#039; commentary. I&#039;ve done the show in Milwaukee and Chicago.\r\n\r\nFor unknown comics, I ask them to do 3-4 minutes of strong material at the top before we show their videos just to establish the contrast between where they are today vs. where they once were. Obviously not needed for a bigger name comic but they are welcome to do a little time at the top as well. I like to have 5 comics doing about 10-12 minutes each, including video commentary.\r\n\r\nI would book this show entirely with Bridgetown comics. I would defer to you on that regarding who you&#039;d like in the show. The one thing to consider is making sure comics have clips of their earliest attempts, but I haven&#039;t found it to be a problem. Most comics who&#039;ve started in the last 10 years or so seem to have videos.\r\n\r\n",
      "copy": "Remember your first time?\r\n \r\nCome see some of the best up-and-coming comics make fun of videos of their earliest attempts at stand-up.\r\n\r\nThis is Bad Comedy Theatre.",
      "pageUrl": "11674-bad-comedy-theatre",
      "iTunesUrl": ""
    },
    {
      "id": 11676,
      "events": [],
      "name": "Reading The Bible With Dan Live",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/stained_glass_window-01-small.jpg",
      "photoUrl": "/api/img/show-images/show-readingthebiblewithdanlive-300x300.jpg",
      "sortOrder": 9999,
      "bio": "In Reading the Bible With Dan Live, Dan Weber and his comedy writing partner “The Bible” and his co-host Nariko Ott dissect the most popular stories found in the wacky insanity that is America&#039;s Most Revered Book. We read stories such as Adam and Eve getting thrown out of the garden of Eden; Noah&#039;s Ark and the flood; Cain and Abel; Jacob tricking Issac to become the father of the nation of Israel, and the destruction of Sodom and Gomorrah.  Joining them is a rotating panel of comics who comment on each and every crazy thing read. \r\n\r\nPanelists have included Amy Miller, Christian Ricketts, Whitney Streed and Kristine Levine.\r\n\r\nMusical accompaniment provided by Ira Novos.\r\n\r\nIt&#039;s slightly informative and super hilarious.\r\n\r\nAdditionally, the live show has a drinking game named &quot;Behold!&quot; Every time that word is used in the Bible, the audience takes a drink. This happens way more than it really should.\r\n\r\nThere really isn&#039;t anything else like it.\r\n\r\nFor the Bridgetown show we would read about the destruction of Sodom and Gomorrah because that story is absolutely insane.",
      "copy": "Reading the Bible with Dan Live, a show where a collection of very funny people read, then mock, America&#039;s Most Revered Book.",
      "pageUrl": "11676-reading-the-bible-with-dan-live",
      "iTunesUrl": ""
    },
    {
      "id": 11686,
      "events": [],
      "name": "Funny Over Everything",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/ub3eytz.png",
      "photoUrl": "/api/img/show-images/show-funnyovereverything-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Funny Over Everything is a comedy show that was the highest attended of the 2015 festival according to Sean Jordan so maybe that&#039;s true who knows. It was packed though. It features Portland home champs Ian Karmel, Sean Jordan, Shane Torres, and Phil Schallberger and away champs to be determined by the folks running the show. The show is largely geared toward promoting comics who have the material but not necessarily the name recognition that would make them a known quantity. ",
      "copy": "The Pacific Northwest is becoming a comedy hot bed, and thanks to the Bridgetown Comedy Festival and the nurturing environment of the city, Portland is a scene on the verge. The goal of Funny Over Everything is to put together an entertaining show, but one with a curatorial eye towards the comedians involved. This isn’t an open-mic, and nobody is getting booked because they’re nice.\r\n\r\nThe Funny Over Everything comedy showcase is a monthly series showcasing some of the best, most innovative up-and-coming stand-up comedians that the nation has to offer. Past performers include Moshe Kasher, Ron Funches, Hannibal Buress, Jerrod Carmichael, Doug Benson, Emily Heller, Ian Karmel, Timmy Williams, Sean Jordan and Shane Torres. - See more at: http://hollywoodtheatre.org/funny-over-everything/#sthash.QFotaq4x.dpuf",
      "pageUrl": "11686-funny-over-everything",
      "iTunesUrl": ""
    },
    {
      "id": 11700,
      "events": [],
      "name": "We Still Like You",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/wslypodcast.jpg",
      "photoUrl": "/api/img/show-images/show-westilllikeyou-300x300.jpg",
      "sortOrder": 9999,
      "bio": "We Still Like You is a show about shame. Since February of 2014, We Still Like You has been a live comedy show in Chicago based around the confession of shameful things that comedians have done in the past. We do our best to establish our show as a space where performers can joke about the things that make them feel shameful and thus move forward and conquer that shame. \r\n\r\nEach show features 7 performers and is hosted by various combinations of our 5 producers. After each story, the crowd is directed to raise a toast and chant &quot;We still like you!&quot; so that the performer can feel the crowd&#039;s acceptance of whatever they&#039;ve done in the past. We also have a brief Q&amp;A after each story so that we can tie up any loose ends before presenting our live art (drawn by producer J. Michael Osborne) that has been inspired by the performer&#039;s set. We&#039;ve had confessions about everything from sexuality to pranks gone wrong to involvement with cults. We Still Like You is equal parts hilarious and cathartic as our performers find humor in some of the most unexpected places.  We believe that we&#039;ve spent the last two years creating a unique and special environment and we would love to be able to share that environment with you.",
      "copy": "Do you have a story from your past that makes you feel weird? We Still Like You is a show centered around sharing those stories and conquering the shame those stories hold, whilst surrounded by friends and strangers. Featuring a lineup of some of Chicago’s best comedians and improvisers, We Still Like You is all about sharing. Because if we’re all assholes, then none of us are. We Still Like You is a safe place for storytellers to laugh at their most humiliating moments and take power away from their shame, so after every story the audience gives a hearty cheer of “WE STILL LIKE YOU!” \r\n\r\nWe Still Like You has travelled all over the country, having performed in The Orlando Indie Comedy Festival, The Green Gravel Comedy Festival, and Hell Yes Fest in New Orleans. The show now has a Los Angeles chapter produced by comedian Andy Sell.\r\n\r\nThe show is also a podcast, releasing new episodes twice a month on iTunes.\r\n\r\nThe show is produced by Tyler Snodgrass, J. Michael Osborne, Danii Gallegos, Dan Sheehan, and Shannon Noll.\r\n",
      "pageUrl": "11700-we-still-like-you",
      "iTunesUrl": ""
    },
    {
      "id": 11714,
      "events": [],
      "name": "7 Minutes in Purgatory",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/7mip_banner.jpg",
      "photoUrl": "/api/img/show-images/show-7minutesinpurgatory-300x300.jpg",
      "sortOrder": 9999,
      "bio": "7 Minutes in Purgatory challenges comedians to perform directly to a camera alone in a soundproof room, while audience members watch a live feed in another room. This social experiment/comedy show offers a chance to watch performers hilariously and awkwardly attempt to do their act without the benefit of audience feedback. The show, which was described by the Laugh Button as “one of the coolest and most creative additions to the comedy world,” has appeared at festivals like SXSW, Bridgetown, The Onion &amp; AV Club’s 2nd Annual 26th Annual Comedy Fest, High Plains, and the New York Comedy Festival.",
      "copy": "7 Minutes in Purgatory challenges comedians to perform directly to a camera alone in a soundproof room, while audience members watch a live feed in another room. This social experiment/comedy show offers a chance to watch performers hilariously and awkwardly attempt to do their act without the benefit of audience feedback. The show, which was described by the Laugh Button as “one of the coolest and most creative additions to the comedy world,” has appeared at festivals like SXSW, Bridgetown, The Onion &amp; AV Club’s 2nd Annual 26th Annual Comedy Fest, High Plains, and the New York Comedy Festival.",
      "pageUrl": "11714-7-minutes-in-purgatory",
      "iTunesUrl": ""
    },
    {
      "id": 11714,
      "events": [],
      "name": "7 Minutes in Purgatory",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/7mip_banner.jpg",
      "photoUrl": "/api/img/show-images/show-7minutesinpurgatory-300x300.jpg",
      "sortOrder": 9999,
      "bio": "7 Minutes in Purgatory challenges comedians to perform directly to a camera alone in a soundproof room, while audience members watch a live feed in another room. This social experiment/comedy show offers a chance to watch performers hilariously and awkwardly attempt to do their act without the benefit of audience feedback. The show, which was described by the Laugh Button as “one of the coolest and most creative additions to the comedy world,” has appeared at festivals like SXSW, Bridgetown, The Onion &amp; AV Club’s 2nd Annual 26th Annual Comedy Fest, High Plains, and the New York Comedy Festival.",
      "copy": "7 Minutes in Purgatory challenges comedians to perform directly to a camera alone in a soundproof room, while audience members watch a live feed in another room. This social experiment/comedy show offers a chance to watch performers hilariously and awkwardly attempt to do their act without the benefit of audience feedback. The show, which was described by the Laugh Button as “one of the coolest and most creative additions to the comedy world,” has appeared at festivals like SXSW, Bridgetown, The Onion &amp; AV Club’s 2nd Annual 26th Annual Comedy Fest, High Plains, and the New York Comedy Festival.",
      "pageUrl": "11714-7-minutes-in-purgatory",
      "iTunesUrl": ""
    },
    {
      "id": 11720,
      "events": [],
      "name": "Andy Kindler&#039;s Particular Show",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/theparticularshow-cropped_blank.jpg",
      "photoUrl": "/api/img/show-images/show-andykindler039sparticularshow-300x300.jpg",
      "sortOrder": 9999,
      "bio": "One of LA WEEKLY&#039;S BEST NEW STAND-UP SHOWS IN LA\r\nEach month Andy chooses from his rolodex (Rolex?) of comedy superstars from LA and around the world (New York) to present a hilarious (his words) and very Particular show. Andy’s the host. It’s his party and he will do time in between each comic if he wants to. Andy Kindler is a frequent guest on The Late Show with David Letterman.  He currently recurs on IFC’s Maron, Comedy Central’s Tosh.O and is Mort the Mortician on Fox’s hit animation show Bob’s Burgers.\r\n ",
      "copy": "",
      "pageUrl": "11720-andy-kindlers-particular-show",
      "iTunesUrl": ""
    },
    {
      "id": 11720,
      "events": [],
      "name": "Andy Kindler&#039;s Particular Show",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/theparticularshow-cropped_blank.jpg",
      "photoUrl": "/api/img/show-images/show-andykindler039sparticularshow-300x300.jpg",
      "sortOrder": 9999,
      "bio": "One of LA WEEKLY&#039;S BEST NEW STAND-UP SHOWS IN LA\r\nEach month Andy chooses from his rolodex (Rolex?) of comedy superstars from LA and around the world (New York) to present a hilarious (his words) and very Particular show. Andy’s the host. It’s his party and he will do time in between each comic if he wants to. Andy Kindler is a frequent guest on The Late Show with David Letterman.  He currently recurs on IFC’s Maron, Comedy Central’s Tosh.O and is Mort the Mortician on Fox’s hit animation show Bob’s Burgers.\r\n ",
      "copy": "",
      "pageUrl": "11720-andy-kindlers-particular-show",
      "iTunesUrl": ""
    },
    {
      "id": 11724,
      "events": [],
      "name": "TALK SHOW: THE GAME SHOW",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/guybranum1.jpg",
      "photoUrl": "/api/img/show-images/show-talkshowthegameshow-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Guy Branum&#039;s beloved hybrid of America&#039;s two least respected forms of television returns!\r\n\r\nThree guests face off to prove who’s the best talk show guest by plugging, name-dropping, and anecdoteing their way to victory.",
      "copy": "",
      "pageUrl": "11724-talk-show-the-game-show",
      "iTunesUrl": ""
    },
    {
      "id": 11724,
      "events": [],
      "name": "TALK SHOW: THE GAME SHOW",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/guybranum1.jpg",
      "photoUrl": "/api/img/show-images/show-talkshowthegameshow-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Guy Branum&#039;s beloved hybrid of America&#039;s two least respected forms of television returns!\r\n\r\nThree guests face off to prove who’s the best talk show guest by plugging, name-dropping, and anecdoteing their way to victory.",
      "copy": "",
      "pageUrl": "11724-talk-show-the-game-show",
      "iTunesUrl": ""
    },
    {
      "id": 11725,
      "events": [],
      "name": "Guy Branum&#039;s Gay Bash",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/gay-bash-2.jpg",
      "photoUrl": "/api/img/show-images/show-guybranum039sgaybash-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Guy gathers all his favorite LGBT comedians performing at this year’s festival for one big gay bash! ",
      "copy": "",
      "pageUrl": "11725-guy-branums-gay-bash",
      "iTunesUrl": ""
    },
    {
      "id": 11725,
      "events": [],
      "name": "Guy Branum&#039;s Gay Bash",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/gay-bash-2.jpg",
      "photoUrl": "/api/img/show-images/show-guybranum039sgaybash-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Guy gathers all his favorite LGBT comedians performing at this year’s festival for one big gay bash! ",
      "copy": "",
      "pageUrl": "11725-guy-branums-gay-bash",
      "iTunesUrl": ""
    },
    {
      "id": 11735,
      "events": [],
      "name": "MY DUMB FRIENDS ",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/my_dumb_friends.jpeg",
      "photoUrl": "/api/img/show-images/show-mydumbfriends-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Dan St. Germain and Sean Donnelly host a podcast where they bring in their comedy friends to talk about the dumbest shit they’ve ever done. Topics range from selling candy to pay for a girlfriend’s abortion to hooking up with a transsexual in Mexico City. It’s a raw and hilarious show that is complimented by Dan’s neuroses and Sean’s easygoing charm. Past guests include Nikki Glazer, Chris Gethard, Kurt Metzger, and Abbi Jacobson &amp; Ilana Glazer.",
      "copy": "Dan St. Germain and Sean Donnelly host a podcast where they bring in their comedy friends to talk about the dumbest shit they’ve ever done. Topics range from selling candy to pay for a girlfriend’s abortion to hooking up with a transsexual in Mexico City. It’s a raw and hilarious show that is complimented by Dan’s neuroses and Sean’s easygoing charm. Past guests include Nikki Glazer, Chris Gethard, Kurt Metzger, and Abbi Jacobson &amp; Ilana Glazer.",
      "pageUrl": "11735-my-dumb-friends-",
      "iTunesUrl": ""
    },
    {
      "id": 11735,
      "events": [],
      "name": "MY DUMB FRIENDS ",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/my_dumb_friends.jpeg",
      "photoUrl": "/api/img/show-images/show-mydumbfriends-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Dan St. Germain and Sean Donnelly host a podcast where they bring in their comedy friends to talk about the dumbest shit they’ve ever done. Topics range from selling candy to pay for a girlfriend’s abortion to hooking up with a transsexual in Mexico City. It’s a raw and hilarious show that is complimented by Dan’s neuroses and Sean’s easygoing charm. Past guests include Nikki Glazer, Chris Gethard, Kurt Metzger, and Abbi Jacobson &amp; Ilana Glazer.",
      "copy": "Dan St. Germain and Sean Donnelly host a podcast where they bring in their comedy friends to talk about the dumbest shit they’ve ever done. Topics range from selling candy to pay for a girlfriend’s abortion to hooking up with a transsexual in Mexico City. It’s a raw and hilarious show that is complimented by Dan’s neuroses and Sean’s easygoing charm. Past guests include Nikki Glazer, Chris Gethard, Kurt Metzger, and Abbi Jacobson &amp; Ilana Glazer.",
      "pageUrl": "11735-my-dumb-friends-",
      "iTunesUrl": ""
    },
    {
      "id": 11742,
      "events": [],
      "name": "Church Night",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/160115_churchnight_small.jpg",
      "photoUrl": "/api/img/show-images/show-churchnight-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Church Night is a comedy act based in Washington, DC. They have featured at The Bentzen Ball Comedy Festival (curated by Tig Notaro), Edinburgh Festival Fringe, and released their first web series, Church Night TV, in November 2015. \r\n\r\nChurch Night parodies a Middle-America church service, but the content is better suited for a late night in a cheap motel. In its monthly incarnation, Church Night takes the form of a variety show featuring rotating stand-up comedy, burlesque, and/or musical acts. Between the guest performances, Church Night characters titillate the congregation with spiritual sketches, praise music, and crowd participation (the good kind, not the shitty kind that no one likes). The service ends with the infamous Shots n’ Tots Communion. While the promise of a free shot of whiskey and a single tater tot may get people in the door, the church staff is what keeps them coming back.\r\n\r\nThe Reverend Dr. Stevedore Maybelline Bidet Esq. delivers the word with a zealous passion he usually only reserves for cats. Don’t worry, he’s licensed in theology, veterinary science, cat optometry, and cat law, so it’s totally legit. Kathy Piechota, the sensual, Midwestern youth minister keeps the services running smoothly. She keeps the kids in line because she knows how to talk shit and is not afraid to lie. The scantily clad and mute altered boy, Randy St. Oates Jr., lights the candles, does whatever Bidet and Kathy tell him to, and then blows the candles out in the end. They’re good, faithful Americans who sometimes act like idiots, but that&#039;s only because they&#039;re dumb. They call upon the Lord for His guidance, but he&#039;s usually not there.\r\n\r\nChurch Night is created by Linsay Deming, Landon Letzkus, and Jeremy Frank. They started as a variety show in April 2013 at iconic, neighborhood dive bar and alt-comedy hub, The Wonderland Ballroom. Having built a fervent following with consistently sold-out monthly shows, they relocated to historic rock venue, Black Cat, in December 2014. In addition to the monthly services, the Church Night characters host comedy and rock shows, perform sketches, and create weird, interactive experiences for unexpecting audiences.",
      "copy": "Church Night is a variety show of biblical proportions featuring stand-up comedy, sketches, music, and everyone’s favorite: shots and tots communion. This sell-out show from Washington, DC parodies a Sunday church service, but the content is better suited for a late night in a cheap motel. Reminiscent of “A Prairie Home Companion” on acid, Church Night’s eccentric, religious satire will delightfully destroy your memories of church. It’s about coming together, at the same time, in the name of the Lord. Prepare your shit, people, because you’re going to leave this service feeling #blessed. AMEN!\r\n\r\nChurch Night featured at The Bentzen Ball Comedy Festival (curated by Tig Notaro) in 2014 and 2015, performed a run at Edinburgh Festival Fringe 2015, and released their first web series, Church Night TV, in 2015. They’ve opened for Tim Heidecker, Brett Gelman, Eugene Mirman, Kate Berlant, Dave Hill, and more. Church Night is created by Linsay Deming, Landon Letzkus, and Jeremy Frank. ",
      "pageUrl": "11742-church-night",
      "iTunesUrl": ""
    },
    {
      "id": 11755,
      "events": [],
      "name": "Secrets, Lies &amp; Alibis",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/image.jpeg",
      "photoUrl": "/api/img/show-images/show-secretsliesampalibis-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Secrets, Lies &amp; Alibis is a one-of-a-kind variety showcase inspired by anonymous audience secrets. Every month our fans spill their guts and we create new sketches and games based on their confessions. Additionally, we have Chicago&#039;s best stand-up, characters and comedy music throughout the show. We typically run about 70-90 minutes.\r\n\r\nFor a festival show, we would make some adjustments to be accommodating. All the variety spots could be for stand-ups and we could fit anywhere from 4-7 stand ups (depending on timing) into the show. We would also ideally get secrets from that nights audience to use in the games and perform a couple of our &quot;best of&quot; sketches. \r\n\r\nThis show is so much fun because it&#039;s audience interactive. People love to see their secrets come to life and participate in the games. It&#039;s a high-energy, unique concept that has gotten rave reviews. We&#039;ve been a recommended pick by the Chicago Reader and featured in the Red Eye multiple times. As one of the fastest growing monthly shows in Chicago, we have an ever-expanding, loyal audience. \r\n\r\nSecrets, Lies &amp; Alibis is produced, written and performed by Sarah Albritton, Amanda Lynn Deal, Elliot Lerner and Alex Seligsohn. Mostly women-produced, 1/2 Jewish, 100% weird and fun! The producers have performed in festivals and clubs throughout the country including Arch City Comedy Festival, Cleveland Comedy Festival, Funny Women&#039;s Fest LA, Chicago Nerd Comedy Festival, Zanies Comedy Clubs, The Improv and Kill Tony Podcast. \r\n\r\nWe&#039;ve had some fantastic guest performers including Sean White, Chris Redd, Emily Galati, Martin Morrow, Marty DeRosa, Jacob Williams, Sonia Denis, Felonius Munk, Dave Helem and Jay Washington, among others. \r\n\r\nFor more information, please visit our website and social media;\r\nwww.slacomedyshow.com\r\nwww.twitter.com/slacomedyshow\r\nwww.facebook.com/slacomedyshow",
      "copy": "Everyone has a dirty secret! Our interactive, one-of-a-kind show takes those secrets from you, our audience, to inspire original sketches and games with special guest stand-ups, characters and comedy music.  One of fastest growing shows in Chicago, sketches have been inspired by such secrets as: &quot;I hate cops and I&#039;m a cop&quot;, &quot;I accidentally drank my mom&#039;s breast milk at 13 and liked it&quot; and &quot;My butthole is on fire&quot;. Secrets, Lies &amp; Alibis is produced, written and performed by Sarah Albritton, Amanda Lynn Deal, Elliot Lerner and Alex Seligsohn. For more info visit www.slacomedyshow.com and @slacomedyshow on Twitter.",
      "pageUrl": "11755-secrets-lies--alibis",
      "iTunesUrl": ""
    },
    {
      "id": 11825,
      "events": [],
      "name": "WHATEVER ",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/whatever.png",
      "photoUrl": "/api/img/show-images/show-whatever-300x300.jpg",
      "sortOrder": 9999,
      "bio": "WHATEVER is a monthly stand up comedy showcase where anything can happen. Hosts and IRL BFFs Allen Strickland Williams and Eric Dadourian first realized that they were meant to be together under a blanket of stars and the influence of psychedelic mushrooms. They have poured all of this passionate, platonic love into creating a show that is all about good vibes, great comics and never-ending friendship. WHATEVER has received endorsements from LA Weekly, Comedy Cake, Rory Scovel, Sara Schaefer, Maria Bamford, Maria Bamford’s dad, and many more.\r\n\r\nAllen puts out digital sketches with his stand-up comedy supergroup WOMEN, which have been featured on Tosh.0 and IFC.com. He also recently appeared as a guest on Conan and has performed comedy on numerous festivals, including Funny or Die’s Oddball Comedy &amp; Curiosity Festival, SXSW and LA’s RIOT Fest. \r\n\r\nEric hosts SAUCE, another popular LA show, and he is a favorite at Hot Tub with Kurt Braunohler and Kristen Schaal. They love him so much that he frequently guest hosts when Kurt and Kristen are unavailable. He can also be seen on Meltdown w/ Jonah and Kumail, Hell Yes Fest and Terrified with Dave Ross. \r\n",
      "copy": "WHATEVER is a monthly stand up comedy showcase where anything can happen. Hosts and IRL BFFs Allen Strickland Williams and Eric Dadourian first realized that they were meant to be together under a blanket of stars and the influence of psychedelic mushrooms. They have poured all of this passionate, platonic love into creating a show that is all about good vibes, great comics and never-ending friendship. WHATEVER has received endorsements from LA Weekly, Comedy Cake, Rory Scovel, Sara Schaefer, Maria Bamford, Maria Bamford’s dad, and many more.\r\n\r\nAllen puts out digital sketches with his stand-up comedy supergroup WOMEN, which have been featured on Tosh.0 and IFC.com. He also recently appeared as a guest on Conan and has performed comedy on numerous festivals, including Funny or Die’s Oddball Comedy &amp; Curiosity Festival, SXSW and LA’s RIOT Fest. \r\n\r\nEric hosts SAUCE, another popular LA show, and he is a favorite at Hot Tub with Kurt Braunohler and Kristen Schaal. They love him so much that he frequently guest hosts when Kurt and Kristen are unavailable. He can also be seen on Meltdown w/ Jonah and Kumail, Hell Yes Fest and Terrified with Dave Ross. ",
      "pageUrl": "11825-whatever-",
      "iTunesUrl": ""
    },
    {
      "id": 11825,
      "events": [],
      "name": "WHATEVER ",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/whatever.png",
      "photoUrl": "/api/img/show-images/show-whatever-300x300.jpg",
      "sortOrder": 9999,
      "bio": "WHATEVER is a monthly stand up comedy showcase where anything can happen. Hosts and IRL BFFs Allen Strickland Williams and Eric Dadourian first realized that they were meant to be together under a blanket of stars and the influence of psychedelic mushrooms. They have poured all of this passionate, platonic love into creating a show that is all about good vibes, great comics and never-ending friendship. WHATEVER has received endorsements from LA Weekly, Comedy Cake, Rory Scovel, Sara Schaefer, Maria Bamford, Maria Bamford’s dad, and many more.\r\n\r\nAllen puts out digital sketches with his stand-up comedy supergroup WOMEN, which have been featured on Tosh.0 and IFC.com. He also recently appeared as a guest on Conan and has performed comedy on numerous festivals, including Funny or Die’s Oddball Comedy &amp; Curiosity Festival, SXSW and LA’s RIOT Fest. \r\n\r\nEric hosts SAUCE, another popular LA show, and he is a favorite at Hot Tub with Kurt Braunohler and Kristen Schaal. They love him so much that he frequently guest hosts when Kurt and Kristen are unavailable. He can also be seen on Meltdown w/ Jonah and Kumail, Hell Yes Fest and Terrified with Dave Ross. \r\n",
      "copy": "WHATEVER is a monthly stand up comedy showcase where anything can happen. Hosts and IRL BFFs Allen Strickland Williams and Eric Dadourian first realized that they were meant to be together under a blanket of stars and the influence of psychedelic mushrooms. They have poured all of this passionate, platonic love into creating a show that is all about good vibes, great comics and never-ending friendship. WHATEVER has received endorsements from LA Weekly, Comedy Cake, Rory Scovel, Sara Schaefer, Maria Bamford, Maria Bamford’s dad, and many more.\r\n\r\nAllen puts out digital sketches with his stand-up comedy supergroup WOMEN, which have been featured on Tosh.0 and IFC.com. He also recently appeared as a guest on Conan and has performed comedy on numerous festivals, including Funny or Die’s Oddball Comedy &amp; Curiosity Festival, SXSW and LA’s RIOT Fest. \r\n\r\nEric hosts SAUCE, another popular LA show, and he is a favorite at Hot Tub with Kurt Braunohler and Kristen Schaal. They love him so much that he frequently guest hosts when Kurt and Kristen are unavailable. He can also be seen on Meltdown w/ Jonah and Kumail, Hell Yes Fest and Terrified with Dave Ross. ",
      "pageUrl": "11825-whatever-",
      "iTunesUrl": ""
    },
    {
      "id": 11826,
      "events": [],
      "name": "Virgin Sacrifice",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/smaller_vs_poster.jpg",
      "photoUrl": "/api/img/show-images/show-virginsacrifice-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Virgin Sacrifice\r\nA night of Stand-Up Comedy\r\nComedians sacrifice one Stand-Up Virgin!\r\nYou never forget your first set!\r\n\r\nLights up. Nicole Blaine, host and creator, explains to the audience what they are about to see. First up, top comedians from late night TV and Comedy Central will perform. Then, after 70 minutes of watching the pros make it look easy, one person, who has never done stand-up before and was never planning on doing it in their lifetime, will perform for the first (and most likely last) time in their life. On stage. Alone. While you watch. Virgin Sacrifice! You never forget your first set!\r\n\r\nNicole gives the audience background information on our Virgin. This is a person who has a “normal” career. Previous Virgins have been doctors, lawyers, bankers, bartenders, and grandfathers. They are booked months ahead of time, and Nicole helps them prepare for their big night. They invite everyone they know. Every show has sold out for over two years. No one wants to miss Anne from accounting’s once in-a-lifetime attempt to be funny. \r\n\r\nThe Virgin sits in the audience during the show. After the professional comics perform, Nicole interviews them about their first time doing stand up. They tell the audience their first joke or other memorable “firsts.” They offer the Virgin advice before their big moment. \r\n\r\nThe Virgin headliner finally takes the stage. The entire room is on the edge of their seats. The Virgin is visibly shaking. The first joke lands. Laughter. Success. Adrenaline for all. It’s a night to remember. Forever.\r\n\r\nFormer Virgin Ted Nicholson sums it up best: “That was the best night of my adult life. After being a Virgin, I decided to go back to work on the music career I abandoned ten years ago. Virgin Sacrifice changed my life.”\r\n\r\n*On an important side note, Bridgetown has a special place in my heart. Portland has been the hometown of my little brother for the last 10 years. He is what every little brother encompasses; your best friend and biggest enemy. He’s the only person who understands how crazy our parents are and has always been my rock when getting through tough family times. He is a psychotherapist who has never performed on a stage in his lifetime. He was a nerdy, introverted smelly kid with only 3 friends growing up. He blossomed into a successful, strong yuccie. Who happens to think he is funnier than me. There is nothing I want more than to take my brother’s virginity. On stage. In front of all his friends. Well, you know what I mean…. \r\n\r\nI think the Brother Bridgetown Virgin Sacrifice would be my best sacrifice yet. It would be an honor to be a part of the festival and sacrifice a few local Portlanders. It’s a huge dream for me to be included in something so great and respected in the comedy community. I truly appreciate your consideration. \r\n\r\nThank you.\r\n\r\nNicole Blaine\r\n",
      "copy": "Created and produced by husband and wife team Mickey and Nicole Blaine, Virgin Sacrifice is a live stand-up comedy show that features headlining comics and one ordinary person, the “Virgin.” Past comics on the Virgin Sacrifice stage include Howie Mandel, Damon Wayans, Jeff Garlin, David Koechner, Kevin Pollak, Pete Holmes, Andy Kindler and Bryan Callen, as well as fan favorites from television and movies. After a night of comedy from the pros, the Virgin takes the stage. Despite varying backgrounds: from medicine, real estate and bartending, to law, graphic design and more, each Virgin shares a quick wit and the courage to face their fears. The Virgins rehearse and prepare for months before confronting this once-in-a-lifetime opportunity. \r\n\r\nDifferent than traditional comedy club shows, Virgin Sacrifice provides a nurturing environment for people out of their comfort zones. After the professional comics perform, they each talk to the Virgin, offering them advice and sharing stories of their own first performances. The audience consistently supports and encourages the Virgin, resulting in a successful performance and unforgettable adrenaline rush.\r\n\r\nProducer and host, Nicole Blaine, gives you a glimpse into the ordinary lives of ordinary people as they do something extraordinary: perform stand up comedy alongside the best comics in the business. Blaine is “a remarkable performer with brains, beauty and rich comic delivery,” reported LA Weekly.  She has been a featured stand-up comic on NBC’s Today Show and E’s That Morning Show.  She has been part of Boston’s Women in Comedy Festival, performing alongside Jane Lynch and Lily Tomlin, and the International FringeNYC Festival. Her honest (and crass) observations showcase her (according to Backstage West) “humor, passion, dazzling charm and a naturalness that many performers, or even civilians, would kill for.” \r\n\r\n“Arguably, the best stand-up show in L.A. It’s sad, really, that Nicole’s able to take someone who’s never done stand-up before and make them look this good. We schlep and we grind, and she somehow fairy godmothers a Virgin into a headliner. And then there’s also a famous headliner. This show has too much.” (Sean Casey, Westside Comedy Theater)\r\n\r\n“Nicole says it’s a chance for someone to do stand-up for the first and last time. But the crowd and show are so supportive… She may not know she’s creating a monster. Or another great stand-up comic. Same thing.” (Jackie Kashian - @Midnight, Conan)\r\n\r\n“I enjoyed myself considerably more than I thought I would, or should have.” (Kevin Pollak - The Usual Suspects, Mom)\r\n\r\nTickets have sold out for every Virgin Sacrifice since its inception in July, 2013. For more information visit www.VirginSacrificeShow.com. ",
      "pageUrl": "11826-virgin-sacrifice",
      "iTunesUrl": ""
    },
    {
      "id": 11831,
      "events": [],
      "name": "The Workout Room",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/workoutroom.jpg",
      "photoUrl": "/api/img/show-images/show-theworkoutroom-300x300.jpg",
      "sortOrder": 9999,
      "bio": "&quot;The Workout Room&quot; is the brain child of Greg Edwards (star of the YouTube series &quot;Thug Notes&quot;), but is produced by several LA comedians.  The theme is &quot;new material only,&quot; which sounds super risky, but because we book great comedians (as does your festival), we find it has led to some amazing nights where sometimes the comics would all randomly stick to one theme based on something the host mentioned, sometimes the comics would do a slew of new jokes or stories they wrote for that one show, and sometimes comics would work on something that wasn&#039;t even technically comedy and get super real.  The theme presents a challenge, but also a relief to the comedian - while yes, they&#039;re not doing their &quot;A-list&quot; sets, they&#039;re also free from the pressure of all that comes with it, and this ultimately creates an engaging and beautiful atmosphere for both the comedians and the audience, as everyone gets to be on the &quot;ground floor&quot; of a joke writing process.  \r\n\r\nThe show has always been great, but has potential to be amazing drawing from a stellar Bridgetown lineup.  A favorite show in the LA scene, It used to run from the backyard of Leah Kayajanian (one of the producers).  Since it was forced to move (aka Leah&#039;s eviction), the show has popped up randomly around LA because friends of the show offer up their spaces.  No matter where and when we pop up, the show always brings a devout following of comedians and friends.\r\n",
      "copy": "Want to see your favorite comedians get those big laughs, even without their A-list material?   The Workout Room challenges our comics with just one theme: NEW MATERIAL ONLY.  Untested.  Unfiltered.  Fresh.  Real.  Comedy fans get a chance to see some of the best comedians in the business on the ground floor of their joke writing process.",
      "pageUrl": "11831-the-workout-room",
      "iTunesUrl": ""
    },
    {
      "id": 11839,
      "events": [],
      "name": "Obsessed Podcast",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/obsessedpodcastlogoupdated.jpg",
      "photoUrl": "/api/img/show-images/show-obsessedpodcast-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Obsessed is a comedy podcast about liking things a lot, maybe even a little too much. The show balances the intimacy and soul baring intensity of an interview style podcast with weird quizzes and games that make for big comedy.\r\n\r\nIt’s a unique mix of super honest and super absurd. On one recent episode, a guest demonstrated what it would sound like if he swore at a nun over a Soccer game. During the same episode, he broke down in tears talking about his father. \r\n\r\nTopics for the podcast have included big, obvious, fun pop culture things like Star Wars, James Bond, and Batman, but also odd, deeply personal topics like being obsessed with self-loathing, tiny things, and the apocalypse.  \r\n\r\nAs a result, the show ends up being an exploration of both the topic and the guests. A lot of times, as the host, I’ll ask a guest a ridiculous question. They start to answer with what they think is their “comedy answer” and end up saying something deep and honest.\r\n\r\nI’ve done the show live many times in my former hometown of Minneapolis, at many conventions and festivals, and I’m starting to do them live in LA. For a show at Bridgetown, I’d love to get a collection of awesome comedians together and get to the heart of their obsessions. \r\n",
      "copy": "A live edition of the Feral Audio comedy podcast, OBSESSED. Hosted by comedian/writer Joseph Scrimshaw (RiffTrax, SF SketchFest), guests share their deepest loves from Star Wars to Pro-Wrestling to Cats to Self-Loathing and everything in between. It’s a fast, funny look at things we like a little too much.\r\n\r\nThe show features probing interviews, absurd quizzes, and ratings to determine exactly how obsessed the guests are with their topic: Would they get a tattoo? Would they talk to Hitler about it? Would they swear at a nun if she insulted the thing they loved?\r\n\r\nThe show has been listed on iTunes as a “Staff Favorite” multiple times since it kicked off in 2012. Past guests include Jackie Kashian, James Urbaniak, Wil Wheaton, The Doubleclicks, David Huntsberger, Solomon Georgio, Matt Gourley, Bill Corbett, Brock Wilbur, Matt Belknap, and many more.\r\n",
      "pageUrl": "11839-obsessed-podcast",
      "iTunesUrl": ""
    },
    {
      "id": 11841,
      "events": [],
      "name": "Earthquake Hurricane",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/web-header.png",
      "photoUrl": "/api/img/show-images/show-earthquakehurricane-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Four of Portland&#039;s best comics put on one of Portland&#039;s best shows every week. It&#039;s a standup show with a strong emphasis on group hosting, starting with a group riff at the top and bottom of the show, and audience participation during those sessions. Oh yeah, and we&#039;re in a bike shop / bar which is the most Portland thing ever.\r\n\r\nIn the year since we started we&#039;ve become a staple of the Portland scene including Willamette Week&#039;s pick for best comedy show, Portland Mercury picks, and a feature in The Portland Monthly.",
      "copy": "Earthquake Hurricane is a powerhouse comedy show hosted by four of Portland&#039;s comics: Bri Pruett (WW Funniest 5), Curtis Cook (Vice TV), Alex Falcone (Portlandia) and Anthony Lopez (Bridgetown vet). Run out of a bike shop / bar (because Portland), EQH has quickly established itself as the place to see top-tier comedy in Portland. Willamette Week&#039;s pick for best comedy show 2015, plus featured in great write-ups from the Portland Mercury, Paste Magazine, and The Portland Monthly.",
      "pageUrl": "11841-earthquake-hurricane",
      "iTunesUrl": ""
    },
    {
      "id": 11860,
      "events": [],
      "name": "Death of Glitter : Genderf#ck Cabaret",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/deathofglitter.jpg",
      "photoUrl": "/api/img/show-images/show-deathofglittergenderfckcabaret-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Death of Glitter: Genderf#ck Cabaret was created in 2015 by Jayson &quot;Alanna&quot; Giardinelli and Lisa &quot;Delta Flyer&quot; Quiriconi as a way to raise funds for Portland-based non-profits that support non-gender conforming folks. Combining drag, comedy, acrobatics, and music, Death of Glitter is a down and dirty, hilarious cabaret for a cause. We have raised money for the following groups: TransActive (support for transgender youth), Bradley Angle (serving victims of domestic violence), AIDS Walk Portland, SAGE (resources for LGBTQ seniors), and more. \r\n\r\nHosted by Delta Flyer, the show is an outlet for performers of various experience levels and gender expressions. The show has packed the show room at Crush Bar consistently, and is now the club&#039;s featured event every second Saturday of the month. Our Facebook group (https://www.facebook.com/groups/1522233011371007/) is over 200 members strong, and are an engaged and loyal audience. We get a lot of &quot;repeat customers&quot; at each show, and each performer has fans who get super excited to see their favorite perform. Usually we encourage the audience to throw tips for the performers, but if we get into Bridgetown Comedy Festival, we won&#039;t do that if it seems like it would be out of place. Bridgetown would be an amazing opportunity to add some glitter to the festival, and to increase exposure for the show to get even more audience members to help donate to good local causes. The drag and cabaret we do is funny, not strictly glamorous, and Delta keeps the flow with comedy, improv, and crowd work.\r\n\r\nWe have a resident DJ to do music cues, but we are open to using house crew if needed. The beauty of our show is that we can customize and change the length as needed. We&#039;re usually an hour show, with a 15 minute intermission for costume changes, but we can cram a lot into a half an hour if we are placed in a showcase with other shows/performers. We&#039;re flexible!\r\n\r\n**please note, Sunday 6/5 is the only day the entire cast is available. We cannot perform any other day :(",
      "copy": "Death of Glitter: Genderf#ck Cabaret was created in 2015 by Jayson &quot;Alanna&quot; Giardinelli and Lisa &quot;Delta Flyer&quot; Quiriconi to raise funds for gender non-conforming non-profits in Portland, and surrounding areas.  Combining drag, comedy, acrobatics, and music, Death of Glitter is a down and dirty cabaret for a cause.\r\n\r\nOur MC, Delta Flyer, is a sassy stewardess who will get your tray tables up, because you&#039;re headed for some glittery turbulence!  From the deep, deep, sea comes our lovely pirate wench, Darcy Blows. Drink up, me hearties, for she has surfaced for her weekly mating frenzy.  Narcissistic space babe Mars is an intergalactic scientist sent here to study human anal pollination. Originally from the 9th circle of Hell, the vile demon, Anastasia Euthanasia, was summoned here via an Ouija board at a middle school slumber party. Judy Precious is a canasta-playing senior citizen by day, but by night she becomes an exotic, erotic, private dancer. And, finally, be amazed by the strength and skill of Death of Glitter’s Acro-Yogis, who are twisted in the most beautiful way. We are full of surprises, so there may even be some special guests!\r\n\r\nEvery second Saturday of the month at Crush Bar, the cast of Death of Glitter will fulfill your dreams with screams and queens!",
      "pageUrl": "11860-death-of-glitter--genderfck-cabaret",
      "iTunesUrl": ""
    },
    {
      "id": 11876,
      "events": [],
      "name": "Lady/Freak",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/ladyfreak.jpg",
      "photoUrl": "/api/img/show-images/show-ladyfreak-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Performing to sold-out crowds at UCB, LADY/FREAK is the brainchild of best friends &amp; comedians Grace Parra (The Nightly Show w/Larry Wilmore, FUSE) and Jen Bartels (Friends of the People, TruTV), who come together to explore the age-old adage of being both “a LADY in the streets and a FREAK in the sheets.” This all-female sex-positive comedy talk show is an hour-long PANEL format that combines a real sex expert, celebrity guests, stand-up comedians, and the hilarity &amp; honesty of putting it all out on the table. NOTHING is off limits. Produced by Liz Bohnsack (Conan, 2016 Summer Olympics), LADY/FREAK chooses one specific topic every show to delve into (past topics include SEX &amp; TECHNOLOGY, PORNOGRAPHY &amp; WOMEN, BAD SEX, INTERRACIAL DATING, etc), and Grace &amp; Jen use personal anecdotes, songs, rapid round Q&amp;A’s and interactive media to engage their panel and titillate their audiences. Past guests include Maria Bamford (Netflix), Mary Lynn Rajskub (24), Amanda Crew (Silicon Valley), Stefanie Beatriz (Brooklyn 99), Aya Cash &amp; Kether Donahue (You’re The Worst) and many, many more.\r\n \r\nOur vision for doing LADY/FREAK specifically at Bridgetown is this: We would like to choose a panel of 3-4 female comedians from the line-up of ladies who are performing at Bridgetown, to give them another opportunity to perform and for audiences to see them in a new light. We’ll also bring in a female sexpert who is local to Portland to provide the expert POV. We think this is a really cool way to showcase the female comedians of Bridgetown through another prism, and we are fans of the festival and would absolutely love the chance to perform with you guys. Thanks for considering us!\r\n\r\nOUR THEME: FEMALE-DRIVEN SEX-POSITIVE TALK SHOW\r\n",
      "copy": "LADY/FREAK – Performing to sold-out crowds at UCB, LADY/FREAK is the brainchild of best friends &amp; comedians Grace Parra (The Nightly Show w/Larry Wilmore, FUSE) and Jen Bartels (Friends of the People, TruTV), who come together to explore the age-old adage of being both “a LADY in the streets and a FREAK in the sheets.” This all-female sex-positive comedy talk show is an hour-long PANEL format that combines a real sex expert, celebrity guests, stand-up comedians, and the hilarity &amp; honesty of putting it all out on the table. NOTHING is off limits. Produced by Liz Bohnsack (Conan, 2016 Summer Olympics), LADY/FREAK chooses one specific topic every show to delve into (past topics include SEX &amp; TECHNOLOGY, PORNOGRAPHY &amp; WOMEN, BAD SEX, INTERRACIAL DATING, etc), and Grace &amp; Jen use personal anecdotes, songs, rapid round Q&amp;A’s and interactive media to engage their panel and titillate their audiences. Past guests include Maria Bamford (Netflix), Mary Lynn Rajskub (24), Amanda Crew (Silicon Valley), Stefanie Beatriz (Brooklyn 99), Aya Cash &amp; Kether Donahue (You’re The Worst) and many, many more. We’re a female-driven show, but gentlemen, we don’t bite – in fact, our audience numbers have grown to be almost 60% men. So if you’re a lady? You want to see this. And if you’re a gent? You want to see this even more. It’s part slumber party, part sex-ed, part accidentally overhearing ",
      "pageUrl": "11876-ladyfreak",
      "iTunesUrl": ""
    },
    {
      "id": 11883,
      "events": [],
      "name": "Bad News LIVE",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/bnpromo.jpeg",
      "photoUrl": "/api/img/show-images/show-badnewslive-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Hey Bridgetown! Bad News LIVE, here...your #1 show in indie political comedy.  Chuck Ludwig, professional devil&#039;s advocate and host of Bad News, presents an irreverent comedy show featuring a rotating panel of guest comedians from across the political spectrum. (We&#039;d be happy to feature comedians on the panel who will be performing at the festival.) Panelists riff on trending topics in news, politics, current events, and pop culture. Whether it’s the latest gaffe from a presidential candidate or real talk about gun violence, every episode proves that “we’ve got issues.”  And comics. And comics WITH issues!\r\n\r\nChuck and the panel don’t try to solve our most pressing problems, but they&#039;ll make fun of them until someone more qualified does. Combining elements of The Daily Show, Tough Crowd, Politically Incorrect, and Chelsea Lately,  Bad News has something for every news geek and pop culture freak: comedic monologues, panel discussions, satirical sketches, interactive games, correspondent segments, and our signature Good News/Bad News that closes each show. \r\n\r\nA typical run of show looks like this:\r\n- Opener/audience warm up comic (12-15 min)\r\n- Host introduces show to audience; monologue (Chuck Ludwig: 3-5 min)\r\n- Panel. Chuck introduces panel to audience; will ask the comics 5-7 questions on the provided topics (politics, news, current events, pop culture). We encourage comics to prepare some jokes in advance (or use jokes from your act) but have found the real gold comes from riffing off each other and the host in the moment. (Panelists: 40-45 min)\r\n- Roll pre-recorded sketch for the audience (3-5 min)\r\n- Chuck leads the panel in an interactive game (Chuck and Panelists: 5-7 min)\r\n- Bad News/Good News Outro (Chuck: 2-3 min)\r\n\r\nBad News is filmed live each month in front of sold-out studio audiences at the famous ACME Comedy Theater in Hollywood, California. Comic panelists have included: \r\n- Adam Yenser (Emmy Award-winning writer for Ellen) \r\n- Thomas Dale (E&#039;s Chelsea Lately, Comedy Central’s Adam Devine’s House Party) \r\n- Aida Rodriguez and Zainab Johnson (NBC’s Last Comic Standing)\r\n- Dave Merheje (Just For Laughs)\r\n- Joe Dosch and Olivia Grace (The World Famous Comedy Store’s Roast Battle)\r\n- Marcella Arguello (Carson Daly) \r\n- Neel Nanda (Oxygen&#039;s Funny Girls) \r\n- Laura Crawford (Boston Comedy Festival)\r\n- Alex Hooper (Nerdist&#039;s The Meltdown with Jonah &amp; Kumail, NBC&#039;s New Girl) \r\n- Teddy Tutson, Ed Greer, and more hilarious comedians without TV credits! (Humblebrag: We are super excited to have Ian Edwards on the show in March.)\r\n\r\nNamed one of 38 Awesome Things to Do in Los Angeles by “We Like LA” (October 2015), the broad appeal of Bad News attracts educated, urbane, tech-savvy viewers from 18-36 who are in tune with the latest trends in comedy, current events, and the endless search for truth.\r\n\r\nBad News LIVE is brought to you by Executive Producers and Co-Creators Chuck Ludwig and Julianne Simitz.\r\nWritten by Chuck Ludwig, Shaan Joshi, and Julianne Simitz.\r\nDirected by Ward Swan. \r\nProduced by Daniel Judd.",
      "copy": "Bad News LIVE...join us for a live taping of the #1 show in indie political comedy.  \r\n\r\nCome hang as Chuck Ludwig--professional devil&#039;s advocate and host of Bad News--presents an irreverent comedy show featuring a rotating panel of guest comedians from across the political spectrum. Panelists riff on trending topics in news, politics, current events, pop culture, and more. Whether it’s the latest gaffe from a presidential candidate or real talk about gun violence, every episode proves that “we’ve got issues.”  And comics. And comics WITH issues!\r\n\r\nChuck and the panel don’t try to solve the most pressing problems of the day; they&#039;ll just make fun of them until someone more qualified does. Combining elements of The Daily Show, Tough Crowd, Politically Incorrect, and Chelsea Lately,  Bad News has something for every comedy fan, news geek, or pop culture freak: comedic monologues, panel discussions, satirical sketches, interactive games, correspondents’ segments, and our signature Good News/Bad News tag that closes each show. \r\n\r\nNamed one of 38 Awesome Things to Do in Los Angeles by “We Like LA” (2015), join us in our live studio audience as Bad News brings the grit and glam of Hollywood to Hawthorne.\r\n",
      "pageUrl": "11883-bad-news-live",
      "iTunesUrl": ""
    },
    {
      "id": 11890,
      "events": [],
      "name": "AN SHO(w) - Stand-Up Comedy (House) Party",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/anshow2.png",
      "photoUrl": "/api/img/show-images/show-anshowstandupcomedyhouseparty-300x300.jpg",
      "sortOrder": 9999,
      "bio": "AN SHO(w) is hard to describe but a joy to create and incredible onstage. We&#039;re four roommates in our mid-20s who started this in our house, crafting incredible lineups and then daring each other to do our sets with absurd obstacles (examples include having to repeat sentences whenever a bell rang, performing outside on a 100ft mic cable while the audience and PA stayed in, selfie-sticking entire sets, performing in trees, telling jokes with a Nerf gun sniper in the attic and a second shooter hidden in the kitchen, headlining sets with pianos we can&#039;t play and having to perform onstage while your ashamed self from ten years later visits via satellite to dismissively heckle your current batch of jokes) with the aim of forcing each other to step up their game and keep their cool while surrounded by their favorite comedians. \r\n\r\nSince our move to UCB Sunset, first monthly, and now on 1st and 3rd Mondays, we&#039;ve had free rein to make something immensely goofy. We&#039;ve had Bigfoot sightings after making the entire audience turn off their phones, elaborate, saxophone-driven, Starbucks-inspired striptease numbers, improv games where comics had to create backstories for shelter cats minute-by-minute, live dating games and full dinner dates taking place during the show, we&#039;ve done the show as a talk show, a game show, a sporting event, a live audience audition and table read for a gritty new take on Archie&#039;s Pal Jughead,  a TED Talk, and are currently working on our first live bottle episode, where we get locked in the elevator, reminisce about the time we were locked in the freezer, and flashback to favorite moments, feature some favorite performers from the past and dreams of ones we could never have, and even get a set from Heaven after one of us freezes to death. It&#039;s cooperative, collaborative, optimistic, messy and fun always. We&#039;re having the time of our lives here, and try to keep up with our motto of Every Single Thing is the Most Important Thing Ever Especially This Right Now.\r\n\r\nOur antics are silly, over-the-top crowd-pleasers and we&#039;re great hosts and have had some outstanding guests. We&#039;d love to make our first trip to Portland as a quartet and take our SHO(w) to its first festival. We&#039;ve had some unforgettable SHO(w)s in Los Angeles - we&#039;ve had Patton Oswalt open and Reggie Watts close, and Maria Bamford open and Reggie Watts close, and honestly, we&#039;ve had Reggie on the SHO(w) so many times that everybody knows he&#039;s always our &quot;secret special guest.&quot; He&#039;d speak highly of what we&#039;re doing (and did to Billboard Magazine in May), if that counts for anything.",
      "copy": "AN SHO(w) is Justin Cousson, Luke Wienecke, Tom Slovinski and Brook Banks - three twenty-something comedians and their roommate. It&#039;s stand-up, it&#039;s special guests, it&#039;s obstacles, it&#039;s audience games, it&#039;s interviews, it&#039;s music, it&#039;s Powerpoint lectures and cat videos and table reads and singalongs - it&#039;s whatever they could find in their house. The SHO(w) grew out of their fire-code defying house parties and is currently in residency at UCB Sunset in Hollywood.\r\n\r\nIn Billboard Magazine, Reggie Watts declared AN SHO(w) comedy that excites him, calling the group &quot;a crew of cool cats that do strange, shoddy and abstract comedy. I love it.&quot;\r\n\r\nPrevious Guests include Patton Oswalt, Reggie Watts, Aziz Ansari, Maria Bamford, Iliza Shlesinger, Demetri Martin, Todd Glass, Ron Funches, Rory Scovel, Baron Vaughn and Andy Kindler.\r\n",
      "pageUrl": "11890-an-show---stand-up-comedy-house-party",
      "iTunesUrl": ""
    },
    {
      "id": 11903,
      "events": [],
      "name": "Not All Cops Are Bad!",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/photocredit-ryankellycoilrecoilphotography.com_2.jpg",
      "photoUrl": "/api/img/show-images/show-notallcopsarebad-300x300.jpg",
      "sortOrder": 9999,
      "bio": "This show satirizes law enforcement and there is no time like now for a show like this! Every time you turn on NPR or the news, a new story is surfacing of cops abusing their authority and if you&#039;re like me, it pisses you off.  Not All Cops Are Bad addresses all of these issues through perspective of Officer Scott Baker, as he tries to justify these viral videos while at the same time revealing sad details about his personal life. The show was voted &quot;Best Scripted Show&quot; at iO West in 2015 and I have performed this character at San Francisco Sketchfest and in St. Louis on the year anniversary of Ferguson. It really connects with the audience and without fail, sparks conversations after every show with people opening up about negative confrontations with law enforcement. I just want to bring this show to new people!\r\n\r\n\r\n\r\n",
      "copy": "Winner of iO West 2015 “Best Scripted Show,” this darkly satirical show satirizes law enforcement blunders that continue to be captured in cell phone videos. Follow Officer Scott Baker as he hosts a public relations meeting at the YMCA, plays these videos of police abusing their authority and struggles to save face. From a singing a racist song parody song at a holiday party to beating a horse thief in San Bernardino, Scott attempts to explain details that the video omits and convince the audience that Not All Cops Are Bad! Written and performed by George McAuliffe.",
      "pageUrl": "11903-not-all-cops-are-bad",
      "iTunesUrl": ""
    },
    {
      "id": 11905,
      "events": [],
      "name": "F*ck That Movie Hosted by Joel Kim Booster and Anna Drezen",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/eff-that-movie-banner_1.png",
      "photoUrl": "/api/img/show-images/show-fckthatmoviehostedbyjoelkimboosterandannadrezen-300x300.jpg",
      "sortOrder": 9999,
      "bio": "We have to get something off our chest: We f*cking hate that movie. Join comedians/haters Joel Kim Booster (MTV), Anna Drezen (Reductress) and a panel of esteemed guests as they present their case and discuss the movies they hate most. From Oscar bait prestige schlock to overhyped indie bullshit— they’ll be covering it all, and letting the audience choose the “winner.” ",
      "copy": "We have to get something off our chest: We f*cking hate that movie. Join comedians/haters Joel Kim Booster (MTV), Anna Drezen (Reductress) and a panel of esteemed guests as they present their case and discuss the movies they hate most. From Oscar bait prestige schlock to overhyped indie bullshit— they’ll be covering it all, and letting the audience choose the “winner.” ",
      "pageUrl": "11905-fck-that-movie-hosted-by-joel-kim-booster-and-anna-drezen",
      "iTunesUrl": ""
    },
    {
      "id": 11905,
      "events": [],
      "name": "F*ck That Movie Hosted by Joel Kim Booster and Anna Drezen",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/eff-that-movie-banner_1.png",
      "photoUrl": "/api/img/show-images/show-fckthatmoviehostedbyjoelkimboosterandannadrezen-300x300.jpg",
      "sortOrder": 9999,
      "bio": "We have to get something off our chest: We f*cking hate that movie. Join comedians/haters Joel Kim Booster (MTV), Anna Drezen (Reductress) and a panel of esteemed guests as they present their case and discuss the movies they hate most. From Oscar bait prestige schlock to overhyped indie bullshit— they’ll be covering it all, and letting the audience choose the “winner.” ",
      "copy": "We have to get something off our chest: We f*cking hate that movie. Join comedians/haters Joel Kim Booster (MTV), Anna Drezen (Reductress) and a panel of esteemed guests as they present their case and discuss the movies they hate most. From Oscar bait prestige schlock to overhyped indie bullshit— they’ll be covering it all, and letting the audience choose the “winner.” ",
      "pageUrl": "11905-fck-that-movie-hosted-by-joel-kim-booster-and-anna-drezen",
      "iTunesUrl": ""
    },
    {
      "id": 11930,
      "events": [],
      "name": "See You In Hell",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/2015-02-10-dougsmithmattwayneb46a6668hp.jpg",
      "photoUrl": "/api/img/show-images/show-seeyouinhell-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Hosted by Doug Smith and Matt Wayne, SEE YOU IN HELL challenges comics to perform their best sets while going through hell (i.e. &quot;OVER THE TOP HELL&quot; arm-wrestling an audience member, &quot;WHISKEY DRINKING BEAR HELL drinking whiskey while wearing a bear suit, CHIPPENDALE HELL, dancing as a Chippendale stripper, GUATANAMO BAY HELL, doing a set while blind-folded, hands tied and at gun point, etc).\r\n \r\nMatt and Doug do about 10 minutes up top with (usually) a prepared bit and explanation of the show. They then invite the first comic up and have them pick the hell out of a hat/bowl. Each comic follows and goes through the same lottery. The show is a lot of fun and has gotten great feedback from comics and audiences. Response is always about how wild and different it is than any other show they&#039;ve seen. Doug and Matt did the show for Comedy Central in LA last year, and it was included in Comedy Bureau’s list of “The 100 Best Things in Comedy We Were Witness To” in 2014.",
      "copy": "SEE YOU IN HELL\r\n \r\nWant to see your favorite stand-up comics get slapped by Satan himself? He only hosts bringer shows, but join Matt Wayne and Doug Smith as they step into the Big Man’s shoes and put NYC’s finest through comedy purgatory. Hula-hoops, celebrity impressions, whiskey drinking bears and unwanted audience participation, all incorporated into each performance! Will they triumph or will the nether world eat their souls? Come see for yourself in this monthly showcase, or…SEE YOU IN HELL!\r\n \r\nSIZZLE REEL\r\nhttps://vimeo.com/105828333\r\npassword: engulfed\r\n",
      "pageUrl": "11930-see-you-in-hell",
      "iTunesUrl": ""
    },
    {
      "id": 11930,
      "events": [],
      "name": "See You In Hell",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/2015-02-10-dougsmithmattwayneb46a6668hp.jpg",
      "photoUrl": "/api/img/show-images/show-seeyouinhell-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Hosted by Doug Smith and Matt Wayne, SEE YOU IN HELL challenges comics to perform their best sets while going through hell (i.e. &quot;OVER THE TOP HELL&quot; arm-wrestling an audience member, &quot;WHISKEY DRINKING BEAR HELL drinking whiskey while wearing a bear suit, CHIPPENDALE HELL, dancing as a Chippendale stripper, GUATANAMO BAY HELL, doing a set while blind-folded, hands tied and at gun point, etc).\r\n \r\nMatt and Doug do about 10 minutes up top with (usually) a prepared bit and explanation of the show. They then invite the first comic up and have them pick the hell out of a hat/bowl. Each comic follows and goes through the same lottery. The show is a lot of fun and has gotten great feedback from comics and audiences. Response is always about how wild and different it is than any other show they&#039;ve seen. Doug and Matt did the show for Comedy Central in LA last year, and it was included in Comedy Bureau’s list of “The 100 Best Things in Comedy We Were Witness To” in 2014.",
      "copy": "SEE YOU IN HELL\r\n \r\nWant to see your favorite stand-up comics get slapped by Satan himself? He only hosts bringer shows, but join Matt Wayne and Doug Smith as they step into the Big Man’s shoes and put NYC’s finest through comedy purgatory. Hula-hoops, celebrity impressions, whiskey drinking bears and unwanted audience participation, all incorporated into each performance! Will they triumph or will the nether world eat their souls? Come see for yourself in this monthly showcase, or…SEE YOU IN HELL!\r\n \r\nSIZZLE REEL\r\nhttps://vimeo.com/105828333\r\npassword: engulfed\r\n",
      "pageUrl": "11930-see-you-in-hell",
      "iTunesUrl": ""
    },
    {
      "id": 11932,
      "events": [],
      "name": "Queen Dweebs",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/pw.jpg",
      "photoUrl": "/api/img/show-images/show-queendweebs-300x300.jpg",
      "sortOrder": 9999,
      "bio": "We wrote this show to throw a party for our fellow nerds and queens. Knowing that everyone’s got a little queen and geek in them, we touch on a range of topics from Russian lit, Batman vs. Superman, proper bloody Mary recipes, podcast voices, Greek mythology and much much more.  It’s interactive. There’s music and dancing. It’s the best type of comedy freak show out there! ",
      "copy": "“Queen Dweebs” is a royally nerdy sketch show featuring the Chicago duo Pure &amp; Weary (Katherine Biskupic &amp; Leah Frires). This show celebrates the unique and helps you find the dignity you lost in middle school. Pure &amp; Weary have previously geeked out with the Chicago Sketch Comedy Festival, the Dallas Comedy Festival, the Chicago Improv Festival, the iO Really Good Film Festival, Chicago Women&#039;s Funny Festival, The New Movement Theater-New Orleans and the Crossroads Comedy Festival. Come let your freak flag fly and join us for this crowning moment! ",
      "pageUrl": "11932-queen-dweebs",
      "iTunesUrl": ""
    },
    {
      "id": 11933,
      "events": [],
      "name": "THE GREAT-ish SHOW ON EARTH?",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/namelessnumber.jpg",
      "photoUrl": "/api/img/show-images/show-thegreatishshowonearth-300x300.jpg",
      "sortOrder": 9999,
      "bio": "NAMELESS NUMBERHEAD is a sketch comedy duo made up by Maari Suorsa (original Off-Broadway cast of 5 Lesbians Eating a Quiche) and Henry Riggs (Jeff Award winning co-writer of That Sordid Little Story). The two are not only comedic partners but also a couple in real life. They met while studying improv in Chicago, Suorsa at The Annoyance Theatre and Riggs at iO. With backgrounds in theatre and music they create a more dynamic tapestry for their comedy shows. Their newest show is called “THE GREAT-ish SHOW ON EARTH?”, and follows a through line of today’s logged in, consumer focused, and media driven lifestyle. The two have performed as Nameless Numberhead at iO Chicago, The PIT NYC, Piccolo Fringe Festival, and The Charleston Comedy Festival. ",
      "copy": "Feeling Sad? Lonely? Depressed? 4 out of 5 “Doctors” recommend seeing Nameless Numberhead’s new sketch comedy show “THE GREAT-ish SHOW ON EARTH?” It might make you laugh, it might make you learn, it might raise your credit score. Guaranteed! Feel free to tweet or ‘gram from the audience so all of your friends know you’re out of the house and having a great time! Walk, don’t run to see Nameless Numberhead in what critics are calling “...a show written and performed by two people in 2016”. Every audience member will leave the theater with a free Honda CR-V. Come celebrate America’s great-ish achievement, Capitalism baby, yeah!",
      "pageUrl": "11933-the-great-ish-show-on-earth",
      "iTunesUrl": ""
    },
    {
      "id": 11934,
      "events": [],
      "name": "We Watch Wrestling Podcast",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/www_-_copy.jpg",
      "photoUrl": "/api/img/show-images/show-wewatchwrestlingpodcast-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Every pro wrestling podcast is either a review &amp; recap show, a news &amp; rumor show or a retro &amp; nostalgia show. They have snarky hosts and bad attitudes. We Watch Wrestling is none of that. We keep it positive and we keep it fun. At it&#039;s heart this is a comedy show. Three friends, all comedians who have performed at Bridgetown individually, discuss what it&#039;s like to be a wrestling fan today. One host is a brand new fan, so an aspect of the show is explaining wrestling to him. We hear from a lot of listeners that don&#039;t watch wrestling, they just love our dynamic, quite a few have even become wrestling fans because of us.\r\nSome listeners are lapsed fans with a reignited interest in the product. And a lot of our subscribers say they&#039;re not embarrassed to tell people they watch pro wrestling anymore because of us. The show is totally spontaneous, we tell stories, do voices, and have a lot of fun. It&#039;s just a very conversational, very funny and very honest, heartfelt show. We have achieved half a million downloads to date, have thousands of followers on Twitter and Facebook and a significant following in the pacific northwest. Please find links included to Issue #69 featuring some of the funniest moments from 2013-2014\r\n(WeWatchWrestling_Issue_69_Best_Of_WWW.mp3) and Issue #104 featuring popular recurring segment &quot;Asking Drive-Thru Clerks Who&#039;s Their Favorite Wrestler&quot; (WeWatchWrestling_Issue_104.mp3)(48min 35sec in), a segment we would very much love to do in Portland, a city with a rich history of pro wrestling and pro wrestling fans. Past guests have included Ron Funches (#116), Dan Soder (#33), and former WWE world champ Dolph Ziggler (#51).\r\n",
      "copy": "We Watch Wrestling is Matt McCarthy (Conan, Pete Holmes Show), Tom Sibley (BBC America), and Vince Averill (Comedy Central). Three standup comedians who watch wrestling. Vince is a lifelong fan and an encyclopedia of wrestling knowledge, Tom just started watching wrestling at age 30, and Matt is a former WWE writer who still thinks wrestling is real. You don’t even have to watch wrestling to like We Watch Wrestling, it’s a celebration, an education, and an honest account of how it feels to be a professional wrestling fan, for better or worse.",
      "pageUrl": "11934-we-watch-wrestling-podcast",
      "iTunesUrl": ""
    },
    {
      "id": 11934,
      "events": [],
      "name": "We Watch Wrestling Podcast",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/www_-_copy.jpg",
      "photoUrl": "/api/img/show-images/show-wewatchwrestlingpodcast-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Every pro wrestling podcast is either a review &amp; recap show, a news &amp; rumor show or a retro &amp; nostalgia show. They have snarky hosts and bad attitudes. We Watch Wrestling is none of that. We keep it positive and we keep it fun. At it&#039;s heart this is a comedy show. Three friends, all comedians who have performed at Bridgetown individually, discuss what it&#039;s like to be a wrestling fan today. One host is a brand new fan, so an aspect of the show is explaining wrestling to him. We hear from a lot of listeners that don&#039;t watch wrestling, they just love our dynamic, quite a few have even become wrestling fans because of us.\r\nSome listeners are lapsed fans with a reignited interest in the product. And a lot of our subscribers say they&#039;re not embarrassed to tell people they watch pro wrestling anymore because of us. The show is totally spontaneous, we tell stories, do voices, and have a lot of fun. It&#039;s just a very conversational, very funny and very honest, heartfelt show. We have achieved half a million downloads to date, have thousands of followers on Twitter and Facebook and a significant following in the pacific northwest. Please find links included to Issue #69 featuring some of the funniest moments from 2013-2014\r\n(WeWatchWrestling_Issue_69_Best_Of_WWW.mp3) and Issue #104 featuring popular recurring segment &quot;Asking Drive-Thru Clerks Who&#039;s Their Favorite Wrestler&quot; (WeWatchWrestling_Issue_104.mp3)(48min 35sec in), a segment we would very much love to do in Portland, a city with a rich history of pro wrestling and pro wrestling fans. Past guests have included Ron Funches (#116), Dan Soder (#33), and former WWE world champ Dolph Ziggler (#51).\r\n",
      "copy": "We Watch Wrestling is Matt McCarthy (Conan, Pete Holmes Show), Tom Sibley (BBC America), and Vince Averill (Comedy Central). Three standup comedians who watch wrestling. Vince is a lifelong fan and an encyclopedia of wrestling knowledge, Tom just started watching wrestling at age 30, and Matt is a former WWE writer who still thinks wrestling is real. You don’t even have to watch wrestling to like We Watch Wrestling, it’s a celebration, an education, and an honest account of how it feels to be a professional wrestling fan, for better or worse.",
      "pageUrl": "11934-we-watch-wrestling-podcast",
      "iTunesUrl": ""
    },
    {
      "id": 11960,
      "events": [],
      "name": "Infauxmation!",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/infauxmation_sexpot.jpg",
      "photoUrl": "/api/img/show-images/show-infauxmation-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Infauxmation! is an improv show with three comedian panelists riffing on the lighter side of the news. Bizarre stories from legitimate sources like Vice, the BBC, CNN and the Huffington Post have ranged from Christian body building swingers to extraordinary drug mishaps to whatever the hell happened in Florida this week. So whether you’re a news junky who’s tired of the doom and gloom of the front page or just a lover of comedy, Infauxmation! is guaranteed to bring you laughs.\r\n\r\nEvery show features brand new stories and one-time-only material from the panel of comedians. In addition to commentary on news stories, over the course of the 90-minute show each of the three comedian panelists does a seven-minute set, producer and host Brent Gill highlights three especially strange stories, and the audience has a chance to actually meet one of the news makers themselves…or at least a comedian’s impersonation of one. \r\n\r\nIn its home state of Colorado, each showing of Infauxmation! draws an audience of about 150 young to middle-aged professionals looking to escape the weight of the day’s news. Infauxmation! is a mainstay at the Denver Comedy Works, and travels to it’s other home in New York at The Creek and the Cave every fifth Friday. The show features the best industry comedians which have included The Grawlix (Adam Cayton-Holland, Ben Roy, and Andrew Orvedahl), Nick Vatterott, Ben Kronberg, Andy Sandford, and Sam Tallent. \r\n\r\nLook no further for a show with the feel of Chelsea Lately, the integrity of The Daily Show, and the crass hilarity of @Midnight.",
      "copy": "Infauxmation! is the Denver based improvised comedy show featuring a panel of comedians riffing on the lighter side of the news. Join host Brent Gill, a panel of comedians, and an occasional topical guest as they analyze the week’s headlines, jab at their favorite stories, and pretend to know more than they do.\r\n\r\nIf Chelsea Lately got knocked up in a threesome with @Midnight and The Daily Show, Infauxmation! is their lovable bastard child.\r\n\r\nLike the news but hate the negativity? Tired of being bombarded by stories about death, destruction, and disease? Ever read a headline and think, is that a real news story? Then this show is right up your alley. From Christian body building swingers to extraordinary drug mishaps to whatever the hell happened in Florida this week. So whether you’re a news junky who’s tired of the doom and gloom of the front page or just a lover of comedy, Infauxmation! is your go-to source for the second-page news. Come laugh with four funny friends joking their way through some of humanities more ridiculous moments.",
      "pageUrl": "11960-infauxmation",
      "iTunesUrl": ""
    },
    {
      "id": 11968,
      "events": [],
      "name": "Ha Fidelity",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/new_poster2.png",
      "photoUrl": "/api/img/show-images/show-hafidelity-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Ha Fidelity is a stand up show based off your music collection from a particular time in your life (high school, college, that time your girlfriend broke up with you because she couldn&#039;t &quot;commit&quot;). Those songs that saved your life/you couldn&#039;t live without, and now they&#039;re (almost) too embarrassing to admit to. Stand Ups will share a sample track or two during their set to really set the mood. Let&#039;s air it out while we listen to the jams of a time gone by. Phew! \r\n\r\n\r\n",
      "copy": "Ha Fidelity is a stand up show based off your music collection from a particular time in your life (high school, college, that time your girlfriend broke up with you because she couldn&#039;t &quot;commit&quot;). Those songs that saved your life/you couldn&#039;t live without, and now they&#039;re (almost) too embarrassing to admit to. Let&#039;s air it out while we listen to the jams of a time gone by. Phew! ",
      "pageUrl": "11968-ha-fidelity",
      "iTunesUrl": ""
    },
    {
      "id": 11972,
      "events": [],
      "name": "Living Impaired",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/unnamed.jpg",
      "photoUrl": "/api/img/show-images/show-livingimpaired-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Living Impaired is a sketch comedy group that uses the crowd as an extra member of our troupe.\r\nWe have performed all over San Francisco and the Bay Area and have particpated in SF Sketch Fest for the past 3 years. We are sexy, smart, willing to please, and super into erotic fan fiction. ",
      "copy": "&quot;It&#039;s difficult to pigeon-hole Living Impaired but if Carrot Top watched a Kids in the Hall marathon while drinking 3 bottles of Robitussin you might get close. If you come see a Living Impaired show we promise it will be entertaining &amp; you can take a bunch of props home&quot;.",
      "pageUrl": "11972-living-impaired",
      "iTunesUrl": ""
    },
    {
      "id": 11995,
      "events": [],
      "name": "Date Talk",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/img_6375.jpg",
      "photoUrl": "/api/img/show-images/show-datetalk-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Our FM Radio show/podcast has a very specific format.  It takes a date gone bad and deconstructs it from both the participants&#039; perspectives.  The man and woman (or frequently same-sex couples) both explain their ideas about what went wrong during an early dating experience.  The versions are rarely the same and the reasons for the lack of attraction are always enlightening to one or the other or BOTH  of the daters. For the past two years we have entertained the public while educated countless daters on their foibles and also their strengths in dating.  Our live version has the audience participating in the questioning and discussion with both parties from the date. \r\n",
      "copy": "Date Talk LIVE\r\nDating Gone Wrong Gets Big Laughs\r\nJoin stand-up comedians and hosts, Cheryl White and Ira Summer for a hilarious evening of dating gone wrong! This will be a live taping of their Date Talk Radio Show/Podcast.\r\n A live version of the popular new Date Talk Podcast, available on Itunes and KGPC 96.9 Fm radio, Oakland, Ca. brings the concept of, one date; two perspectives, to the comedy stage with two professional, unattached, stand-up comics to interview two doomed daters and deconstruct their failed date on stage. Members of the live audience will have the opportunity to join in the discussion.  How can a man and a woman go on the same date and have completely different experiences?  Finally... get both sides of the dating story. ",
      "pageUrl": "11995-date-talk",
      "iTunesUrl": ""
    },
    {
      "id": 12002,
      "events": [],
      "name": "Get Rich Cheating",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/get_rich_cheating_cover_copy.jpg",
      "photoUrl": "/api/img/show-images/show-getrichcheating-300x300.jpg",
      "sortOrder": 9999,
      "bio": "&quot;Get Rich Cheating&quot; is the critically-acclaimed one-man show from the winner of the Bill Hicks Spirit Award for Thought Provoking Comedy, Jeff Kreisler.  It&#039;s a high energy, interactive fake wealth-building seminar based upon the bestselling HarperCollins book.  It&#039;s become a TED talk and a recurring MSNBC segment and toured the globe - because it about what&#039;s right now.\r\n\r\nhttp://GetRichCheating.com/show.html\r\n\r\nIn these difficult times, there&#039;s only one proven path to ridiculous amounts of money: Cheating.\r\n\r\nGet Rich Cheating is the bestselling book (HarperCollins) turned hilarious wealth building seminar, with Jeff Kreisler as Colbert-meets-Tony-Robbins, using cheating of the day to provide absurd financial advice, encouraging his readers and audience to embrace real techniques he exposes in too-true detail.   \r\n\r\nMore than just a comedian’s take on the state of the world, this is also a thoroughly researched look at contemporary cheating as told through some of its most successful participants. Laugh at the too-common scams that cause so many problems, understand how they work, and realize that you, too, can Get Rich Cheating!\r\n\r\nGet Rich Cheating has rocked festivals, colleges, business schools, corporations, comedy clubs, and theatres across the globe, and was even a recurring segment on MSNBC’s The Dylan Ratigan Show.\r\n\r\nIt is the definitive guide to the illegal, immoral, and fun.  Everyone&#039;s cheating: Why not you? \r\n\r\nThat&#039;s the gist of it...\r\n\r\nHere&#039;s some of what they say:\r\n\r\nAbout the book\r\n&quot;You&#039;ll be laughing all the way to the bank, assuming other cheaters haven&#039;t forced it into bankruptcy yet.&quot;  - Rachel Maddow (MSNBC)\r\n\r\n&quot;Catcher in the Rye for evildoers&quot; - Penthouse Magazine\r\n\r\n&quot;Laugh out loud - roaring!&quot; - CNBC\r\n\r\n&quot;A very funny book with a very timely message&quot; - Terry Jones (Monty Python)\r\n\r\n&quot;A brilliant and brilliantly sustained satirical broadside. On just about every page, you&#039;ll find a pithy, pointed barb worthy of the late great George Carlin&quot; - Tony Hendra (National Lampoon)\r\n\r\n&quot;This is THE book to read on the unemployment line&quot; - Lizz Winstead (Co-creator of The Daily Show)\r\n\r\nAbout the show\r\n&quot;Delectable one liners advising wealth before moral health... As funny and as quotable as anything that appears daily on late-night TV. You are guaranteed a few laugh-out-loud verbal souvenirs&quot;  - The New York Times\r\n\r\n&quot;Hilarious... Kreisler nails the glad-handing &quot;just between us&quot; semi-conspiratorial tone of guru/salesmen such as Tony Robbins... His audience interactions are smooth and he knows how to stick the knife into our guts in the middle of a belly laugh&quot;  - Chicago Tribune\r\n\r\n&quot;A Michael Moore-esque rallying cry... A really great performer&quot; - Time Out New York\r\n\r\n&quot;Plenty of polished one-liners and wry observations&quot; - Time Out Chicago\r\n\r\n&quot;Jeff Kreisler goes where other comics fear to tread (with) a zest missing from (other) shows... Reflections so clever, you wonder why they aren’t present in the political discourse&quot; - Fest\r\n\r\n&quot;A hilarious, recession-proof tutorial on how to get rich without regard for morals or other mortals&quot; - Flavorpill\r\n\r\nKreisler has also been submitted as a stand up - his bio can be found at http://jeffkreisler.com/epk.html\r\n",
      "copy": "Get Rich Cheating - Everyone&#039;s doing it. Why not you?\r\n\r\n&quot;Delectable one liners advising wealth before moral health... As funny and as quotable as anything that appears daily on late-night TV. You are guaranteed a few laugh-out-loud verbal souvenirs&quot;  - The New York Times\r\n\r\n&quot;Hilarious... Kreisler nails the glad-handing &quot;just between us&quot; semi-conspiratorial tone of guru/salesmen such as Tony Robbins... His audience interactions are smooth and he knows how to stick the knife into our guts in the middle of a belly laugh&quot;  - Chicago Tribune\r\n\r\nIn these difficult times, there&#039;s only one proven path to ridiculous amounts of money: Cheating.\r\n\r\nGet Rich Cheating is the bestselling book (HarperCollins) turned hilarious wealth building seminar, with Jeff Kreisler as Colbert-meets-Tony-Robbins, using cheating of the day to provide absurd financial advice, encouraging his readers and audience to embrace real techniques he exposes in too-true detail.   \r\n\r\nMore than just a comedian’s take on the state of the world, this is also a thoroughly researched look at contemporary cheating as told through some of its most successful participants. Laugh at the too-common scams that cause so many problems, understand how they work, and realize that you, too, can Get Rich Cheating!\r\n\r\nGet Rich Cheating has rocked the house at festivals, colleges, business schools, corporations, comedy clubs, and theatres across the globe, and was even a recurring segment on MSNBC’s The Dylan Ratigan Show.\r\n\r\nIt is the definitive guide to the illegal, immoral, and fun.  Everyone&#039;s cheating: Why not you? \r\n\r\nAbout the book\r\n&quot;You&#039;ll be laughing all the way to the bank, assuming other cheaters haven&#039;t forced it into bankruptcy yet.&quot;  \r\n- Rachel Maddow (MSNBC)\r\n\r\n&quot;Catcher in the Rye for evildoers&quot; - Penthouse Magazine\r\n\r\n&quot;Laugh out loud - roaring!&quot; - CNBC\r\n\r\n&quot;A very funny book with a very timely message&quot; - Terry Jones (Monty Python)\r\n\r\n&quot;A brilliant and brilliantly sustained satirical broadside. On just about every page, you&#039;ll find a pithy, pointed barb worthy of the late great George Carlin&quot; - Tony Hendra (National Lampoon)\r\n\r\n&quot;This is THE book to read on the unemployment line&quot; - Lizz Winstead (Co-creator of The Daily Show)\r\n\r\nAbout the show\r\n&quot;A Michael Moore-esque rallying cry... A really great performer&quot; - Time Out New York\r\n\r\n&quot;Pitch perfect satire... A great blend of compelling performance elements: it includes laugh-out-loud humor, scathing social critique, a fun premise that literally pulls the audience right into the action, and excellent writing, performing and direction&quot; - Theater Is Easy\r\n\r\n&quot;Plenty of polished one-liners and wry observations&quot; - Time Out Chicago\r\n\r\n&quot;Jeff Kreisler goes where other comics fear to tread (with) a zest missing from (other) shows... Reflections so clever, you wonder why they aren’t present in the political discourse&quot; - Fest\r\n\r\n&quot;Like all good satire, comedian Jeff Kreisler’s fake wealth-building seminar gets closer to the truth than the putative objects of its scorn.&quot; - Show Showdown\r\n\r\n&quot;A hilarious, recession-proof tutorial on how to get rich without regard for morals or other mortals&quot; - Flavorpill\r\n\r\n\r\n",
      "pageUrl": "12002-get-rich-cheating",
      "iTunesUrl": ""
    },
    {
      "id": 12003,
      "events": [],
      "name": "Unqualified Advice with Jeffery Self ",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/jeffery_self_poster.jpg",
      "photoUrl": "/api/img/show-images/show-unqualifiedadvicewithjefferyself-300x300.jpg",
      "sortOrder": 9999,
      "bio": "How soon is too soon to follow someone you’re dating on Twitter? Is ghosting someone unethical? How do you know if your boyfriend is really playing Candy Crush, or if he’s sending questionable emojis to Heather, that girl he went to high school with?\r\nWith an ever growing number of ways to communicate and meet people; we have entered a brave new world; and it’s never been more confusing. Never fear! Unqualified Advice, With Jeffery Self is here to answer all of your questions. In each episode, Jeffery sits down with three very unqualified advisors (comedians, personalities, and anyone who is verified on Twitter) in front of a small audience, and together, over a bottle of wine (or three), they will answer your burning questions and help you navigate Romance 2.0. ",
      "copy": "How soon is too soon to follow someone you’re dating on Twitter? Is ghosting someone unethical? How do you know if your boyfriend is really playing Candy Crush, or if he’s sending questionable emojis to Heather, that girl he went to high school with?\r\nWith an ever growing number of ways to communicate and meet people; we have entered a brave new world; and it’s never been more confusing. Never fear! Unqualified Advice, With Jeffery Self is here to answer all of your questions. In each episode, Jeffery sits down with three very unqualified advisors (comedians, personalities, and anyone who is verified on Twitter) in front of a small audience, and together, over a bottle of wine (or three), they will answer your burning questions and help you navigate Romance 2.0. ",
      "pageUrl": "12003-unqualified-advice-with-jeffery-self-",
      "iTunesUrl": ""
    },
    {
      "id": 12003,
      "events": [],
      "name": "Unqualified Advice with Jeffery Self ",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/jeffery_self_poster.jpg",
      "photoUrl": "/api/img/show-images/show-unqualifiedadvicewithjefferyself-300x300.jpg",
      "sortOrder": 9999,
      "bio": "How soon is too soon to follow someone you’re dating on Twitter? Is ghosting someone unethical? How do you know if your boyfriend is really playing Candy Crush, or if he’s sending questionable emojis to Heather, that girl he went to high school with?\r\nWith an ever growing number of ways to communicate and meet people; we have entered a brave new world; and it’s never been more confusing. Never fear! Unqualified Advice, With Jeffery Self is here to answer all of your questions. In each episode, Jeffery sits down with three very unqualified advisors (comedians, personalities, and anyone who is verified on Twitter) in front of a small audience, and together, over a bottle of wine (or three), they will answer your burning questions and help you navigate Romance 2.0. ",
      "copy": "How soon is too soon to follow someone you’re dating on Twitter? Is ghosting someone unethical? How do you know if your boyfriend is really playing Candy Crush, or if he’s sending questionable emojis to Heather, that girl he went to high school with?\r\nWith an ever growing number of ways to communicate and meet people; we have entered a brave new world; and it’s never been more confusing. Never fear! Unqualified Advice, With Jeffery Self is here to answer all of your questions. In each episode, Jeffery sits down with three very unqualified advisors (comedians, personalities, and anyone who is verified on Twitter) in front of a small audience, and together, over a bottle of wine (or three), they will answer your burning questions and help you navigate Romance 2.0. ",
      "pageUrl": "12003-unqualified-advice-with-jeffery-self-",
      "iTunesUrl": ""
    },
    {
      "id": 12030,
      "events": [],
      "name": "2 Girls 1 Pup",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/monique_and_comet_1yr.jpg",
      "photoUrl": "/api/img/show-images/show-2girls1pup-300x300.jpg",
      "sortOrder": 9999,
      "bio": "2 Girls 1 Pup is the comedy show you can bring your dog to! Normally set in a pet store, it was recently named one of the &quot;10 Best New Standup Shows in LA&quot; by LA Weekly and is appearing at Riot LA this year. We&#039;ve been getting all sorts of write ups on sites like Interrobang, Comedy Cake, LA Weekly and in dog publications like This Dog&#039;s Life. Point is, we&#039;ve hit on something! It&#039;s not just a cutsey comedy show in a pet store; it&#039;s really funny and smart comedy that happens to be one you can take your dog to. It&#039;s perfect for a market like Los Angeles... or Portland. The show includes standup (appearances have included Ian Karmel, Iliza Shlesinger, Beth Stelling, Baron Vaughn, Dave Anthony, Jake Weisman, Sara Schaefer, Janine Brito, Debra DiGiovani and more), as well as variety acts like pet psychics, magicians (Justin Willman is a huge fan!), characters and more, as well as themed games and segments. It&#039;s hosted by Monique Madrid (All Jane No Dick, Second City, Splitsider) and a guest co-host (the &quot;other girl&quot;) and portions of every show go to a local animal rescue, so it&#039;s a cool way to reach out and make a difference in the community. Every 2 Girls 1 Pup event includes a pre-show red carpet with PUParazzi for the dogs and their two-legged humans to pose on, as well as raffle prizes from local businesses with a portion of the proceeds going to that local animal charity. A Bridgetown Festival show could be hosted by just me (which I often do) or co-hosted by a local woman in the comedy scene. Sometimes (like with Riot) we have a house band - an amazing acoustic duo &quot;Kindred Throats.&quot; This isn&#039;t a must-have, but they&#039;re an awfully fun addition!\r\n\r\nAudiences literally thank me for giving them an event they can bring their dogs to after every performance. It&#039;s not just a show, it&#039;s an event. And it&#039;s an absolute blast! Plus, it&#039;s also a weekly podcast (recently mentioned in Splitsider!), so I&#039;d love the opportunity to interview local dog celebrities, dog-friendly businesses, and other dog-related experts in the Portland area to feature on the PUPcast. It&#039;s fairly easy set up in terms of tech because really all we need (besides mics) is a dog-friendly venue. Beyond that, we&#039;re used to performing in a pet store, so any stage is a luxury!\r\n\r\nP.S. I have so many more awesome photos to share if you&#039;re interested! \r\nP.S.S. The number of performers on the stage would depend on if we had the house band, and if our variety act was one person or a group, so the amount listed below is an estimate. \r\nP.S.S.S The number of crew would also either be 2 as listed or possibly 3 if we were able to bring our PUParazzi. But it&#039;s not a MUST. ",
      "copy": "2 Girls 1 Pup is the comedy show you can bring your dog to! Recently named one of the “10 Best New Stand-Up Shows in L.A.” by LA Weekly, the comedy/variety show features hilarious dog-loving comics, themed games, raffle prizes and more. Hosted by producer Monique Madrid (Riot LA, The Second City, Splitsider), Comet the Pup, and a guest female co-host, audiences are highly encouraged to bring their own dogs to the show. Plus, join us for the pre-show red carpet event - PUParazzi included! Portions of the ticket sales benefit a local animal shelter. Also check out 2 Girls 1 Pup’s weekly PUPcast, featuring comedians talking about their four-legged friends, as well as special interest dog-guests like groomers, pet psychics, vets and Hollywood animal trainers. New episodes come out every Monday on iTunes and Stitcher.",
      "pageUrl": "12030-2-girls-1-pup",
      "iTunesUrl": ""
    },
    {
      "id": 12034,
      "events": [],
      "name": "The Famous Haydell Sisters Big Comeback Variety Show",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/strippeddownphoto.jpg",
      "photoUrl": "/api/img/show-images/show-thefamoushaydellsistersbigcomebackvarietyshow-300x300.jpg",
      "sortOrder": 9999,
      "bio": "The Famous Haydell Sisters are the biggest act to hit Portland&#039;s comedy country music scene since Portland realized it had a comedy country music scene.  Comprised of sisters Maybelle (the cute one) and Mattie (the other one), they were THE country music teen queens in the early &#039;90&#039;s, toping the charts with original hits such as &quot;7 Seconds (Too Short A Ride)&quot;, &quot;Wrangler Butt&quot;, and &quot;Your Broken Heart (Is No Excuse To Be An Asshole)&quot;.  But, their rising star shot off too quickly, and in 1993 [fueled by a house arrest for one and an eye-opening read of &quot;The Illuminatis! Trilogy&quot; for the other], they disappeared from the scene.  Two decades later, the Haydells are back together, picking themselves up by their aging, sequined bootstraps.  They&#039;ve been holding back their differences to host a variety show in Portland that features a hodge-podge of cast-offs and odd balls that defy categorization and will leave you saying, &quot;That was the best shit-show I have ever seen.&quot;\r\n\r\nHere&#039;s why this show is a special opportunity--we&#039;ll take your music acts and weirdos.  This is a chance to have a thematic showcase that is not just pure stand-up or a droning, seated pod cast. Character-based acts, clowning-types, and comedy music Music MUSIC! of all genres would round out this event for a unique offering that could draw folks that have never attended the festival before.  Plus, it&#039;s a chance to expand interpretations of what defines the comedy scene.  \r\n\r\nWe&#039;ll be your hosts, you send us a handful of acts.  Let&#039;s go Country.\r\n\r\n*P.S.: We&#039;re big in Fresno.\r\n\r\n\r\n\r\n\r\n\r\n",
      "copy": "COMEDY. COUNTRY. MUSIC.\r\nThe Famous Haydell Sisters rose to meteoric stardom in the late 80&#039;s and early 90&#039;s as country music teen queens. With such hits as &quot;7 Seconds (Too Short A Ride)&quot;, &quot;Wrangler Butt&quot;, and &quot;Your Broken Heart (Is No Excuse To Be An Asshole), they were part of the soundtrack of America.  But, like all projectiles, they were doomed to crash, and in 1993 (due to a flopped album, a house arrest, and an &quot;Illuminatus! Trilogy&quot;-induced melt-down), the sisters parted ways.  Now, after a 20 year hiatus, Maybelle (The Cute One) and Mattie (The Other One) have brought the act back together and are playing the hits, old and new, along with a cast of scraped-from-the-barrell-bottom characters.  It&#039;s country music the way you WISH you remembered it. www.thefamoushaydellsisters.com\r\n",
      "pageUrl": "12034-the-famous-haydell-sisters-big-comeback-variety-show",
      "iTunesUrl": ""
    },
    {
      "id": 12044,
      "events": [],
      "name": "Sup Doc Podcast",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/supdoclogo1400x1400.jpg",
      "photoUrl": "/api/img/show-images/show-supdocpodcast-300x300.jpg",
      "sortOrder": 9999,
      "bio": " At this point and as far as we can tell we are the only comedy/discussion/interview podcast devoted to documentaries. We have a loyal following and have listeners all over the world. We have now recorded 2 LIVE shows and they both went very well. We screen a doc (both have been 30 min docs) and have a panel of 3 interesting people (in this case comedians) to discuss it. Our last LIVE show was recorded in SF Sketchfest 2016 with comedians Emily Heller, Chris Thayer and David Gborie. \r\n\r\nIt&#039;s interactive too because we can take questions from the audience. People love documentaries and comedians so it&#039;s a great mix! \r\n\r\n",
      "copy": "‘Sup Doc, is a biweekly podcast devoted to discussing documentaries, and the show’s hosts, comedians Paco Romane and George Chen, deconstruct current and classic documentaries with guests as varied as the documentaries they cover.\r\n\r\nHere are just a few or our guests and the docs we have discussed:\r\nComedian Todd Glass about Religulous (the Bill Maher doc)\r\nComedian/performer Jamie DeWolf, great grandson of L. Ron Hubbard, about Going Clear: Scientology and the Prison of Belief\r\nMaximum Fun/Bullseye’s Jesse Thorn about Errol Morris’ Fast Cheap and Out Of Control\r\nBrent Hodge the director of I Am Chris Farley. \r\nMusician Dan Deacon about The Rolling Stones doc Gimme Shelter\r\nComedians Emily Heller, Chris Thayer, David Gborie about Heavy Metal Parking Lot (recorded LIVE for SF Sketchfest)\r\nComedian/Musician Stephe Lynch about Smashing Machine.\r\nDrummer/Musician for Jawbreaker Adam Pfahler about Montage of Heck: The Kurt Cobain doc.\r\nand more!\r\n\r\n&quot;Quality premise and production out of the gate&quot; - CourtingComedy.com \r\n“…These guys are super funny and I really like listening to their stories and conversations. Check it out!…” – iTunes review\r\n“…Kudos to Paco and George for this brilliant idea…” – iTunes review\r\n“…a must listen if you enjoy documentaries…” – iTunes review\r\n“…Comics and docs, great combo…” – iTunes review\r\n“…amazingly in-depth and hilarious…” – iTunes review\r\n“…comedic, well-versed conversations about documentaries…” – iTunes review\r\n&quot;...even when I haven&#039;t seen the films this podcast is entertaining...&quot; - iTunes review\r\n\r\nPaco Romane was twice voted Best Comedian in SF, and has appeared in numerous national commercials, films and plays. He is the producer of one of San Francisco&#039;s longest running comedy shows The Romane Event.\r\nGeorge Chen is a writer and comedian who has performed at SF Sketchfest, Put Your Hands Together, Huebel and Scheer’s Crash Test, The Porchlight Storytelling Series, and SFMoMA. Producer and engineer Will Scovill also engineers the podcasts Tales From The Swan Hotel and Give Me Fiction.",
      "pageUrl": "12044-sup-doc-podcast",
      "iTunesUrl": ""
    },
    {
      "id": 12056,
      "events": [],
      "name": "Dawson&#039;s Queef Presents: Are You Afraid of the Dark?",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/dq_afraid-of-the-dark_oct2015.jpg",
      "photoUrl": "/api/img/show-images/show-dawson039squeefpresentsareyouafraidofthedark-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Hi Bridgetown,\r\n\r\nThis is Mat Montgomery, sound- &amp; fogman for Dawson&#039;s Queef. Going into this pitch, &quot;DQ&quot; as they&#039;re telling me to abbreviate as such, wanted a more objective viewpoint on their &quot;Are You Afraid of the Dark?&quot; show submitted for your approval. As their emotionally removed technician, I&#039;m here to provide it, fully aware I am too a beneficiary in the event DQ gets booked for the 9th annual Bridgetown festival.\r\n\r\nFor most of &quot;Dawson&#039;s Queef Presents: Are You Afraid of the Dark?,&quot; it feels just like the Nickelodeon show. From the textbook variety of preteens surrounding the campfire, to the highly predictable reveals and overcooked dialogue, it’s an uncanny revival completely improvised and initiated with an audience suggestion. Inevitably, the true essence of Queef filters in. A relationship turns abusive, jokes heighten five-fold, and tones shift wildly. What was once an innocently spooky story goes amok with eroticism, anger, and unadulterated good cheer. Of course, I accompany the whole thing with bone-chilling sound design that the performers can only hope to justify on the fly.\r\n\r\nThese are all tenets of our original format as a troupe: a long-form improvised teenage dramedy that goes after 90s/early millenium teen shows such as The O.C., Degrassi, and Dawson&#039;s Creek (of course). The whole result becomes something closer to Strangers With Candy, or The Lonely Island’s The Bu, two shows that brought the members&#039; comedic sensibilities together when the six of them began performing as college freshman in 2008. As soon as we realized how much of a blast everyone was having with the improvised teen drama, we couldn’t resist tackling other episodic shows of rote structure within different genres. After “Law and Order,” “Seinfeld,” and “Game of Thrones”, it’s now time to ask Bridgetown, “Are you afraid of the Queef?” \r\n\r\nWe hope you enjoy the live spookfest we submitted herein. It should speak for itself. There&#039;s also our original scripted &quot;Dawson&#039;s Queef&quot; pilot on FunnyorDie for you to check out here: http://FunnyOrDie.com/m/9j10\r\n\r\nDawson&#039;s Queef is comprised of Ben Backhaus, Michael Margetis, Michael Skarsten, Sam Lowy, Tyler Thursby and me (sound &amp; fog), all currently residing and performing in the Phoenix, AZ area [save us from the inexorable Sonoran heatwave].\r\n\r\nNote: The five members of DQ will be the only performers in the show, but are open to having a fellow Bridgetown comedian open/host the show, or even join in on the improv towards the end for a lightning-fast episode [thus we put down 1 opening below for other performers].\r\n\r\nThanks for your time &amp; heart,\r\n\r\nMat",
      "copy": "Dawson&#039;s Queef is an improvised teen dramedy that takes all the awkward hormonal tropes from 90s teenage TV canon [Boy Meets World, 7th Heaven, Dawson&#039;s Creek] and packs them into a high-energy long-form narrative show. Their &quot;Are You Afraid of the Dark&quot; show takes a spooky turn as the performers gather &#039;round the campfire to tell a scary story, then recreate it live alongside music cues ad libitum!\r\n\r\nDawson&#039;s Queef spawned in Tempe, Arizona in June 2011. In addition to monthly shows across the Phoenix area, Queef has gone on to perform showcases at the 2012 UCB Del Close Marathon, Second City Hollywood, and M.i. Westside Theater in Santa Monica. Queef has also performed a variety of other themed improvised live shows that go beyond &quot;Are You Afraid of the Dark?&quot; and the WB catalogue, including &quot;Law &amp; Order&quot;, &quot;Seinfeld&quot;, and &quot;Game of Thrones.&quot; But regardless of format, the performers bring a subversive edge and emotive commitment to the proceedings that is singular to Queef.\r\n\r\nDawson&#039;s Queef is Ben Backhaus, Michael Margetis, Michael Skarsten, Sam Lowy, Tyler Thursby and Mat Montgomery (sound &amp; fog).",
      "pageUrl": "12056-dawsons-queef-presents-are-you-afraid-of-the-dark",
      "iTunesUrl": ""
    },
    {
      "id": 12060,
      "events": [],
      "name": "Comedy in English",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/fahimhostelpacked.jpg",
      "photoUrl": "/api/img/show-images/show-comedyinenglish-300x300.jpg",
      "sortOrder": 9999,
      "bio": "The show&#039;s concept is pretty simple. 3 comedians (4 if you include myself) perform 15 minutes in front of an intl. crowd (pref ESL) to see if their material is truly universal and can cross cultural and language barriers :) (\r\n\r\nSome examples of Past Comedians include:  Asif Ali (Star of Mr. Robinson on NBC), Jay Montepare (Host of HGTV&#039;s Ellen&#039;s Design Challenge), and Dwayne Perkins (Comedy Central Presents Dwayne Perkins) etc.) \r\n\r\n(Note: I tend to do between 20-45 at the end of the night depending on how good the crowd is, but that can be adjusted and not necessary for the festival)  We&#039;ve been averaging between 25-40plus (which holds about 50 at most) in the room depending on the week, and it&#039;s almost 99 percent so far been from the guests of the hostel.\r\n\r\nIf the festival were to be interested in the concept; I would suggest doing it as a partnership with the Hosteling International Location in Portland. Either doing the show there , or bussing in hostel guests to retain the authenticity of the theme. Could be great cross promotion between Bridgetown and HI!  If HI would not be interested; then I&#039;m sure another Hostel in the area would be as HI does not own the intellectual property. \r\n\r\nFinally ; we are also working a couple established producers on an agreement to develop the show as a new media series, and have already drawn interest from several aggregators to live stream the concept in the near future.  If said deal is in place prior to the festival; we would be interested in filming some of the episodes at the festival if that so interests you. \r\n\r\nBelow is our upcoming Feb Schedule. Thanks for taking a look and look forward to hearing from you!\r\n\r\nSincerely,\r\nMichael Magid\r\n\r\n\r\nTues Show\r\n\r\n2/2-  Dave Ross (IFC&#039;s Women)    , Marcella Arguello (  Carson Daly)  , Merril Davis (  Girls Behaving Badly)   (guest set Sammy Obeid  Conan O Brien)\r\n\r\n2/9-  Paige Weldon (The Meltdown at Nerdist) ,  Whitmer Thomas (Workaholics) , Josh Nasar ( Sons of Anarchy )\r\n\r\n2/16- Chris Cope (Big Sky Comedy), Tim Vargulish (The Comedy Studio),  Nicole Blaine (Virgin Sacrifice)\r\n\r\n2/23-  Matt Ingebretson (Good Heroin)  David Rosenberg Note: This guy -http://www.rosie2000.tumblr.com/   ( Rosie2000)  ,  Jason Gillearn ( HBO&#039;s Aspen Comedy)\r\n\r\n\r\n\r\nSat Show\r\n\r\n2/6 - Karl Hess (Montreal&#039;s JFL)  , Simon Gibson (Chatterbox Comedy)   ,  Nadine Rajabi (Shaws of Sunset w Nadine)\r\n\r\n2/13-  Jake Weisman (IFC&#039;s Women), Greg Santos (The Muppets)   ,  Lou Perez (Impractical Jokers)\r\n\r\n2/20   Michael Monsour (Cap City Comedy) , Michael Mattera (Camp) ,  Danny Lobell (Maron&#039;s WTF)\r\n\r\n2/27- Grant Lyon ( Comics Unleashed) , Johan Miranda (Chatterbox Comedy) ,  Julia Prescott (Mad TV)\r\n",
      "copy": "Comedy in English.  The Show is a concept show where 3 established comedians (as well as a host) attempt to perform 15 minutes in front of an international audience, and find out whether their material is truly &quot;Universal&quot;!  (Some examples of Past Comedians include:  Asif Ali (Star of Mr. Robinson on NBC), Jay Montepare (Host of HGTV&#039;s Ellen&#039;s Design Challenge), and Dwayne Perkins (Comedy Central Presents Dwayne Perkins) etc.)\r\nAdmission is Free, however donations are encouraged.\r\nHostelling International USA is a non-profit organization that has been promoting travel and intercultural exploration to people of all ages since 1934. HI USA is a member of Hostelling International, a network of 4,000 hostels in over eighty countries.\r\n",
      "pageUrl": "12060-comedy-in-english",
      "iTunesUrl": ""
    },
    {
      "id": 12060,
      "events": [],
      "name": "Comedy in English",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/fahimhostelpacked.jpg",
      "photoUrl": "/api/img/show-images/show-comedyinenglish-300x300.jpg",
      "sortOrder": 9999,
      "bio": "The show&#039;s concept is pretty simple. 3 comedians (4 if you include myself) perform 15 minutes in front of an intl. crowd (pref ESL) to see if their material is truly universal and can cross cultural and language barriers :) (\r\n\r\nSome examples of Past Comedians include:  Asif Ali (Star of Mr. Robinson on NBC), Jay Montepare (Host of HGTV&#039;s Ellen&#039;s Design Challenge), and Dwayne Perkins (Comedy Central Presents Dwayne Perkins) etc.) \r\n\r\n(Note: I tend to do between 20-45 at the end of the night depending on how good the crowd is, but that can be adjusted and not necessary for the festival)  We&#039;ve been averaging between 25-40plus (which holds about 50 at most) in the room depending on the week, and it&#039;s almost 99 percent so far been from the guests of the hostel.\r\n\r\nIf the festival were to be interested in the concept; I would suggest doing it as a partnership with the Hosteling International Location in Portland. Either doing the show there , or bussing in hostel guests to retain the authenticity of the theme. Could be great cross promotion between Bridgetown and HI!  If HI would not be interested; then I&#039;m sure another Hostel in the area would be as HI does not own the intellectual property. \r\n\r\nFinally ; we are also working a couple established producers on an agreement to develop the show as a new media series, and have already drawn interest from several aggregators to live stream the concept in the near future.  If said deal is in place prior to the festival; we would be interested in filming some of the episodes at the festival if that so interests you. \r\n\r\nBelow is our upcoming Feb Schedule. Thanks for taking a look and look forward to hearing from you!\r\n\r\nSincerely,\r\nMichael Magid\r\n\r\n\r\nTues Show\r\n\r\n2/2-  Dave Ross (IFC&#039;s Women)    , Marcella Arguello (  Carson Daly)  , Merril Davis (  Girls Behaving Badly)   (guest set Sammy Obeid  Conan O Brien)\r\n\r\n2/9-  Paige Weldon (The Meltdown at Nerdist) ,  Whitmer Thomas (Workaholics) , Josh Nasar ( Sons of Anarchy )\r\n\r\n2/16- Chris Cope (Big Sky Comedy), Tim Vargulish (The Comedy Studio),  Nicole Blaine (Virgin Sacrifice)\r\n\r\n2/23-  Matt Ingebretson (Good Heroin)  David Rosenberg Note: This guy -http://www.rosie2000.tumblr.com/   ( Rosie2000)  ,  Jason Gillearn ( HBO&#039;s Aspen Comedy)\r\n\r\n\r\n\r\nSat Show\r\n\r\n2/6 - Karl Hess (Montreal&#039;s JFL)  , Simon Gibson (Chatterbox Comedy)   ,  Nadine Rajabi (Shaws of Sunset w Nadine)\r\n\r\n2/13-  Jake Weisman (IFC&#039;s Women), Greg Santos (The Muppets)   ,  Lou Perez (Impractical Jokers)\r\n\r\n2/20   Michael Monsour (Cap City Comedy) , Michael Mattera (Camp) ,  Danny Lobell (Maron&#039;s WTF)\r\n\r\n2/27- Grant Lyon ( Comics Unleashed) , Johan Miranda (Chatterbox Comedy) ,  Julia Prescott (Mad TV)\r\n",
      "copy": "Comedy in English.  The Show is a concept show where 3 established comedians (as well as a host) attempt to perform 15 minutes in front of an international audience, and find out whether their material is truly &quot;Universal&quot;!  (Some examples of Past Comedians include:  Asif Ali (Star of Mr. Robinson on NBC), Jay Montepare (Host of HGTV&#039;s Ellen&#039;s Design Challenge), and Dwayne Perkins (Comedy Central Presents Dwayne Perkins) etc.)\r\nAdmission is Free, however donations are encouraged.\r\nHostelling International USA is a non-profit organization that has been promoting travel and intercultural exploration to people of all ages since 1934. HI USA is a member of Hostelling International, a network of 4,000 hostels in over eighty countries.\r\n",
      "pageUrl": "12060-comedy-in-english",
      "iTunesUrl": ""
    },
    {
      "id": 12063,
      "events": [],
      "name": "Recycled Babies Sketch Comedy",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/img_0788.jpg",
      "photoUrl": "/api/img/show-images/show-recycledbabiessketchcomedy-300x300.jpg",
      "sortOrder": 9999,
      "bio": "I would also love to pitch a Recycled Babies  show for Bridgetown . (possibly a blend of sketch, stand-up, and video pieces, or just members doing stand up interspersed with RB Videos) . \r\n\r\nSome of our members (such as Dwayne Perkins) have performed at Bridgetown before,  and one of our members (Samantha Ketcherside) has very strong roots in the Portland area and would literally pack these shows!   \r\n\r\nBelow  is a one sheet regarding the group.  Recently we were finalists at Seattle Sketch Fest , shot a promo piece for Paint Care, appeared at Sketchmelt at Meltdown, perform regularly at the Comedy Central Stages,  and are up for our own new media series with football.com (Demos can be sent) \r\n\r\nWhat I picture for the show could be very simple. \r\n\r\nIntro or Cold Open Sketch\r\nVideo\r\nStand up piece\r\nStand up piece\r\nVideo\r\nStand up Piece\r\nStand up Piece\r\nVideo \r\nClosing sketch.\r\n\r\nThis is a similar format the we used for our summer spectacular at the CC stages and it seemed to go over well.  We can simply  do straight stand up and show some of our videos, or  we can  write a show based around bridgetown to give a full through  line for the show.\r\n\r\nThe Stand up performers who would perform would be Dwayne Perkins , Ian Harris, Michael Magid, and Claude Stuart. (Note instead of members you could fill these slots with festival attendees and just play RB videos in between or  a combo of both. pretty flexible :)     \r\n\r\nThanks for taking the time and look forward to hearing from you! \r\n\r\nSincerely, Recycled Babies\r\n\r\n\r\n\r\n",
      "copy": "Recycled Babies is a silly sketch comedy squad with a “dark” heart. The group blends loveably damaged characters in somewhat familiar situations skewed to the absurd and twisted. The intertwined universe where these sketches live allows the funny to come before the conscience.\r\n\r\n \r\n\r\nThe cast of Recycled Babies is a blend of established and rising stand-up comedians, actors and comedy writers.",
      "pageUrl": "12063-recycled-babies-sketch-comedy",
      "iTunesUrl": ""
    },
    {
      "id": 12063,
      "events": [],
      "name": "Recycled Babies Sketch Comedy",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/img_0788.jpg",
      "photoUrl": "/api/img/show-images/show-recycledbabiessketchcomedy-300x300.jpg",
      "sortOrder": 9999,
      "bio": "I would also love to pitch a Recycled Babies  show for Bridgetown . (possibly a blend of sketch, stand-up, and video pieces, or just members doing stand up interspersed with RB Videos) . \r\n\r\nSome of our members (such as Dwayne Perkins) have performed at Bridgetown before,  and one of our members (Samantha Ketcherside) has very strong roots in the Portland area and would literally pack these shows!   \r\n\r\nBelow  is a one sheet regarding the group.  Recently we were finalists at Seattle Sketch Fest , shot a promo piece for Paint Care, appeared at Sketchmelt at Meltdown, perform regularly at the Comedy Central Stages,  and are up for our own new media series with football.com (Demos can be sent) \r\n\r\nWhat I picture for the show could be very simple. \r\n\r\nIntro or Cold Open Sketch\r\nVideo\r\nStand up piece\r\nStand up piece\r\nVideo\r\nStand up Piece\r\nStand up Piece\r\nVideo \r\nClosing sketch.\r\n\r\nThis is a similar format the we used for our summer spectacular at the CC stages and it seemed to go over well.  We can simply  do straight stand up and show some of our videos, or  we can  write a show based around bridgetown to give a full through  line for the show.\r\n\r\nThe Stand up performers who would perform would be Dwayne Perkins , Ian Harris, Michael Magid, and Claude Stuart. (Note instead of members you could fill these slots with festival attendees and just play RB videos in between or  a combo of both. pretty flexible :)     \r\n\r\nThanks for taking the time and look forward to hearing from you! \r\n\r\nSincerely, Recycled Babies\r\n\r\n\r\n\r\n",
      "copy": "Recycled Babies is a silly sketch comedy squad with a “dark” heart. The group blends loveably damaged characters in somewhat familiar situations skewed to the absurd and twisted. The intertwined universe where these sketches live allows the funny to come before the conscience.\r\n\r\n \r\n\r\nThe cast of Recycled Babies is a blend of established and rising stand-up comedians, actors and comedy writers.",
      "pageUrl": "12063-recycled-babies-sketch-comedy",
      "iTunesUrl": ""
    },
    {
      "id": 12089,
      "events": [],
      "name": "Computer Show &quot;LIVE&quot;",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/cs_adam_360.jpg",
      "photoUrl": "/api/img/show-images/show-computershowquotlivequot-300x300.jpg",
      "sortOrder": 9999,
      "bio": "“Computer Show&quot; is a technology talk show set in 1983 but with real tech-entrepreneur guests from the present day.  Computer Show hit the Internet by storm this fall and only had their first “LIVE&quot; performance at the SF Sketch Fest a month ago. Computer Show is the brainchild of Sandwich Video’s Adam Lisagor and Roxana and Tony Altamirano. Gary Fabert (The host) is played by Rob Baedeker of legendary SF sketch group Kasper Hauser.  It&#039;s as simple as this: The show and its hosts are from 1983, and the guests (real tech entrepreneurs) are from the present.  \r\n\r\nhttp://computer.show\r\n",
      "copy": "&quot;Computer Show&quot; is a technology talk show, set in 1983. The dawn of the personal computing revolution. Awkward hair and awkward suits. Primitive synths and crude graphics. VHS tapes. No Internet. But there&#039;s a twist.\r\n\r\nThe guests on this show are tech luminaries -- experts, founders, thinkers, entrepreneurs...from 2016. They are real, and they are really on &quot;Computer Show&quot; to talk about their thing. Will it go well? Can they break through to the host Gary Fabert (played by Rob Baedeker of the legendary SF-based sketch mainstay Kasper Hauser) and his rotating cast of co-hosts, who know of neither iPhone nor website nor Twitter nor...hardly anything?\r\n\r\nhttp://computer.show",
      "pageUrl": "12089-computer-show-live",
      "iTunesUrl": ""
    },
    {
      "id": 12100,
      "events": [],
      "name": "Tomefoolery",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/4.jpg",
      "photoUrl": "/api/img/show-images/show-tomefoolery-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Twice a month, Chicago comedian Cody Melcher invites funny friends over to talk about a really really weird book he just made them read. Past guests include @midnight&#039;s Dan Telfer, Nostalgia Critic&#039;s Tamara-Lynn Chambers, Last Comic Standing&#039;s Amy Sumpter, MaxFun&#039;s Lady to Lady ladies, Defining Marriage&#039;s Matt Baume, University of Texas Rhetoric Professor Trish Roberts-Miller, and Community’s Danny Pudi. Past books have ranged from alien conspiracy books, to a 1950s pickup artist book, to ‘Twilight’, and everything in between. We love to delve into weird, obscure, terrifying, terrible, and just plain evil books and look at the absurdity of it and the kinds of culture they represent.\r\n\r\nTomefoolery was named one of Queerty.com&#039;s &quot;10 Things We&#039;re Thankful For This Thanksgiving&quot; in 2014 and was recently mentioned in Seattle&#039;s alternative newspaper, The Stranger.\r\n\r\nWe average around 3,000 downloads a month, and upcoming guests this year include Jackson Bird (&quot;Will it Waffle?” on Youtube, The Harry Potter Alliance.com), Mara Wilson (Matilda, Cracked.com), Guy Branum (Totally Biased with W. Kamau Bell, The Mindy Project), and Daniel Kibblesmith (The Late Show with Stephen Colbert, ClickHole.com).",
      "copy": "Twice a month, Chicago comedian Cody Melcher invites funny friends over to talk about a really really weird book he just made them read. Past guests include @midnight&#039;s Dan Telfer, Nostalgia Critic&#039;s Tamara-Lynn Chambers, Last Comic Standing&#039;s Amy Sumpter, MaxFun&#039;s Lady to Lady ladies, Defining Marriage&#039;s Matt Baume, University of Texas Rhetoric Professor Trish Roberts-Miller, and Community’s Danny Pudi. Past books have ranged from alien conspiracy books, to a 1950s pickup artist book, to ‘Twilight’, and everything in between. It&#039;s funny people, crazy books!",
      "pageUrl": "12100-tomefoolery",
      "iTunesUrl": ""
    },
    {
      "id": 12110,
      "events": [],
      "name": "We&#039;re Getting the Band Back Together Podcast",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/gbbt_itunes_copy.jpg",
      "photoUrl": "/api/img/show-images/show-we039regettingthebandbacktogetherpodcast-300x300.jpg",
      "sortOrder": 9999,
      "bio": "We&#039;re Getting the Band Back Together with Gary Petersen is a growing phenomenon of epic proportions. Focusing on the loves that shaped artists lives, Gary Petersen interviews all types of funny people to dig into what obsessions and influence they may have hidden away. ",
      "copy": "Did Punk Rock make you dye your hair? Did Mitch Hedberg make you wear sunglasses and reject doughnut receipts? Did Batman make you fight your dad? Come delve into the complex minds of funny artists in the podcast We&#039;re Getting the Band Back Together with Gary Petersen. Examining influence, love and obsession, Petersen takes comedic minds apart focusing on the positives and negatives of their past. ",
      "pageUrl": "12110-were-getting-the-band-back-together-podcast",
      "iTunesUrl": ""
    },
    {
      "id": 12118,
      "events": [],
      "name": "Unsafe Space",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/immigration-unsafespace-shot.jpg",
      "photoUrl": "/api/img/show-images/show-unsafespace-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Comedians do standup on controversial topics, followed by a response by experts and a discussion with the audience.\r\n\r\nIt&#039;s an environment where people of different views can be outspoken but respectful and the humor makes it a fun experience for everyone. We started the show amidst debate about the free speech of comedians vs. the right of the audience to respond to things they disagreed with. We want to bring everyone into the same room instead of talking past each other online. We want comedians to be able to say whatever they want on hot-button issues, and experts and the audience free to voice their opinions as well, with the result of a fun, stimulating and real conversation.\r\n\r\nExample shows:\r\n\r\n* Islam, featuring Jihad Turk (president of President of Bayan Claremont Islamic Graduate School), Heina Dadabhoy (ex-Muslim blogger), Mitch Burrow (comedian and USMC veteran), and Aron Kader (comedian from the &quot;Axis of Evil&quot; comedy tour).\r\n* Guns, featuring Joshua Stepakoff (Board member of Women Against Gun Violence and mass shooting survivor), Adam Winkler (UCLA Constitutional Law professor), Ed Greer (Comedian and former NRA member) and Katie Massa Kennedy (writer for the Queen Latifah show and activist).\r\n\r\nThe show is recorded as a podcast and hosted by Lou Perez and Toby Muresianu.\r\n\r\nNote: in addition to the monthly live show, we do an in-studio podcast which doesn&#039;t include standup. The video clip is from the most recent one of these, as we did not have a live tape available.",
      "copy": "Comedians do standup on controversial topics, followed by a response by experts and a discussion with the audience.\r\n\r\nEach show has a different theme - from policing to political correctness to feminism - and a panel of people who work in the field and comedians with personal perspectives.\r\n\r\nHosted by comedians Toby Muresianu and Lou Perez and recorded as a podcast.\r\n\r\n",
      "pageUrl": "12118-unsafe-space",
      "iTunesUrl": ""
    },
    {
      "id": 12132,
      "events": [],
      "name": "Hike Mic",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/67922_4513195070498_1484003257_n.jpg",
      "photoUrl": "/api/img/show-images/show-hikemic-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Hike Mic is an open mic hosted by Jason Van Glass and Rob Schultz. Over the last four years, we&#039;ve set up shop at more than a dozen scenic outdoor locations around Los Angeles including the Hollywood Sign, La Brea Tar Pits, and abandoned Los Feliz Zoo. We think this format has limitless appeal in Portland, and would like to bring it to the festival as a mid-afternoon (3PM-5PM) activity, both as a fun additional performance opportunity to all festival performers, and as a social gathering for comedians and comedy fans alike. We are not experts on Portland&#039;s best open spaces that double as photo opportunities, but suspect that the Eastbank Esplanade, Mills End Park, and Belmont Goat Field would be promising locations for a combination adventurous-outing/comedy show. ",
      "copy": "Hike Mic, the world&#039;s best and only traveling outdoor open mic, comes to Portland! Join us in front of the scenic Eastbank Esplanade, historic Mill Ends Park, and famous Belmont Goat Field, with comedians from the festival performing short sets under the best conditions possible: sun up, without a ceiling, next to a goat. It’s a picnic! It’s an adventure! It’s Hike Mic!",
      "pageUrl": "12132-hike-mic",
      "iTunesUrl": ""
    },
    {
      "id": 12147,
      "events": [],
      "name": "Dave Maher Coma Show",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/comashow1_green4_601x800.jpg",
      "photoUrl": "/api/img/show-images/show-davemahercomashow-300x300.jpg",
      "sortOrder": 9999,
      "bio": "At the end of 2014, after a few years of mismanaging my Type I diabetes and abusing drugs and alcohol, I lapsed into a diabetic coma that lasted almost a month. After three weeks, my family came within a legal technicality of taking me off of life support. My friends and the comedy community in Chicago presumed I was dead and posted their eulogies of me on Facebook. Then I woke up. &quot;Dave Maher Coma Show&quot; is the story of that experience and its aftermath. The format of the show is about 50% storytelling, 40% stand-up and 10% theater. I tell the story chronologically but with a stand-up approach that keeps it from being maudlin or overly sentimental. There are several bits that break up the pace of a more traditional storytelling or stand-up show, like an awards segment in which I share the &quot;Best Eulogy&quot; and &quot;Worst Eulogy&quot; (among other categories I share like &quot;Most Awkward Interaction With an Acquaintance&quot;) and an intentionally rigged Q&amp;A game segment near the very end of the show that I call &quot;Better Questions.&quot; It&#039;s a fun, revealing, honest and hopefully enlightening show on a heavy topic unlike any other show I know. ",
      "copy": "During the late autumn of 2014, stand-up comedian Dave Maher was unwittingly hurtling towards a diabetic coma, which left him unconscious for several weeks. On November 13th,  he was pronounced dead (by his friends on social media), and upon waking up a few days later, he found himself like Tom Sawyer at his own internet funeral.\r\n\r\nIn his critically acclaimed one man show, &quot;Dave Maher Coma Show,&quot; Maher reflects on life and online death, plus all the jokes and questions spawned by his experience: What&#039;s the grossest part of coming out of a coma? What&#039;s the best way to flirt with nurses in physical rehab? What now?\r\n\r\n&quot;Dave Maher Coma Show&quot; appears after highly successful and regularly sold-out runs in late 2015 and early 2016 at the Annoyance Theatre in Chicago. Press for the show’s initial run was overwhelmingly positive; Nina Metz of the Chicago Tribune said the show’s &quot;free-form sensibility is smart and hooks you in, with low-key but very honest comedy,&quot; while Benjamin Cannon at Gaper’s Block raved that “it feels like nothing short of an essential act for both audience and its eponymous performer, benefiting from a lean, relaxed style that hearkens back to the long-form works of Spalding Gray.”\r\n\r\nAbout Dave Maher: Raised in Oklahoma and Cincinnati, Dave Maher is a Chicagoan of a dozen years and as many apartments. He has acted and improvised comedy around Chicago since 2008, including a glorious stint at the now-defunct Upstairs Gallery. In 2013, he transcended improv and realized that stand-up is where his brand of energetic, intellectual and autobiographical intensity fits best. He tells stories and jokes at shows around Chicago, and he hosts the live show and podcast Back of the Party that features &quot;intimate public conversations with comedians and other artists about art, work and life&quot; the second Saturday of every month at a record store/boutique shop called Transistor.",
      "pageUrl": "12147-dave-maher-coma-show",
      "iTunesUrl": ""
    },
    {
      "id": 12151,
      "events": [],
      "name": "You Had to Be There",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/you_had_to_be_there_promo_pic.jpg",
      "photoUrl": "/api/img/show-images/show-youhadtobethere-300x300.jpg",
      "sortOrder": 9999,
      "bio": "I love my show. It really shouldn&#039;t work as a concept, but for some reason it does every time. The simple explanation of You Had to Be There is that each performer does their set on stage for the audience AND for a random person on the internet via the webcam chat program Omegle. It&#039;s a simple idea, but it&#039;s the strangers who pop up on screen who really make the show. It&#039;s called You Had to Be There because the individuals and personalities who consistently &quot;arrive&quot; from wherever they are in the world tend to be the most interesting and bizarre weirdos you could ever hope for in the name of entertainment and trying to describe the show later is difficult because you have to see it to believe it. Another facet of this show I love is how into it the live audience gets. It&#039;s very much a group experience because of an inherent desire to participate in something so strange and transient. This community aspect of the show (if the performer invites it) always enhances the fun. It fosters a kind of team environment where the performer and audience are together meeting a new person who they have a limited time to figure out and try to make their friend.\r\n\r\nHere&#039;s a list of memorable interactions from previous shows:\r\n1. A 17-year-old kid was asked randomly if he played guitar. As if from nowhere, he produced an already plugged-in Gretsch that was sitting at his feet. He was then asked if he could play Crazy Train and he instantly started shredding the song and the entire audience sang along. After playing, he said, &quot;Wow, I&#039;m 17 and just got to play for a bar of 50 people in Omaha that I wouldn&#039;t have been allowed in otherwise. Thank you so much. You made my night.&quot; It was magical. It’s a comedy show, but it&#039;s also really uplifting at times and that&#039;s another reason why I love it.\r\n2. Another time, a comedian was telling his jokes to a man on screen and one of his jokes was about purchasing tombstones. The man on screen reaches down m- again as if fro out of nowhere - and pulls out a miniature coffin. Turns out, one of his hobbies is whittling small coffins. The audience lost it. The very next joke was about leather fetishism. The man - once again from out of nowhere - reached down and pulled out his leather whip and proceeded to grab his webcam to show the audience a hole in his wall that he made the other night from &quot;fucking too hard.&quot; Again, the audience lost their minds.\r\n3. Juggalo art show. No explanation needed.\r\n\r\nThe things above are pretty weird and went over incredibly well with the audience in the moment. They’re are some of my favorites, but what’s so wonderful about You Had to Be There is that those aren&#039;t rare occurrences. The show is always that wild. I love it.",
      "copy": "Q: What is this?\r\nA: You Had to Be There is a live stand-up comedy show where comedians perform on stage in front of a live audience as well as a random/live/interactive internet audience on Omegle.com.\r\n\r\nQ: Will there be nudity like on literally every other web chat service?\r\nA: Nudity is a possibility, which is why this show is only for adults who can handle that sort of thing. If a naked person happens to show up on screen, we&#039;ll make a joke about it and move on with our lives.\r\n\r\nQ: Why should I go?\r\nA: If you like shared experiences that involve laughter and fun and don&#039;t mind watching unique shows where magical things happen, then you should definitely check it out. Omegle chats lead to interactions with diverse and interesting characters from all around the globe. You never know who will come on the screen next and that is hopefully not an innuendo.\r\n\r\nThe stories people walk away with after this show are often incredible and sometimes plain unbelievable. Whether it&#039;s a foster kid shredding Crazy Train, a Juggalo art show, or a freestyle rapper who whittles miniature coffins, the things you&#039;ll see on this show are guaranteed to surprise and amaze. If you find yourself having trouble conveying to your friends how crazy this show really is, remember just to tell them: You Had to Be There.",
      "pageUrl": "12151-you-had-to-be-there",
      "iTunesUrl": ""
    },
    {
      "id": 12187,
      "events": [],
      "name": "Kelly Anneken&#039;s Lack of Variety Hour",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/lovcartoon_0.png",
      "photoUrl": "/api/img/show-images/show-kellyanneken039slackofvarietyhour-300x300.jpg",
      "sortOrder": 9999,
      "bio": "This is the monthly cabaret show I run in Oakland, CA. Each month revolves around a theme, and I choose jokes and songs to perform based on that theme. So, for example, a theme of &quot;Marriage/Weddings&quot; featured jokes about my own wedding, weddings I have attended, how to hate-tweet a wedding without getting caught, and marriage in general, plus performances of the songs White Wedding (Billy Idol), Hotel Yorba (The White Stripes), and I Believe in Love (Hair).\r\n\r\nIn addition, I perform several segments that tie into a slideshow I build (like a TED talk, but not at all educational). These are typically topical jokes or they tie into the theme.\r\n-4 Minute Movie: An entire movie condensed into 4 minutes of dialogue, all performed by me. Previous features include Valley of the Dolls, Requiem for a Dream, and A League of Their Own.\r\n-Manifesto Destiny: I practice for my two dream careers, humorously naming nail polish colors and writing misleading movie descriptions for cable channel guides.\r\n-Fame Swap: I&#039;m tired of not being famous, so I choose a celebrity I believe I could easily replace.\r\n\r\nExample slideshow is here: http://prezi.com/utmvvjwtpxwt/?utm_campaign=share&amp;utm_medium=copy&amp;rc=ex0share\r\n\r\nWith each guest comedian, I offer a chance to participate in a &quot;Dream Interview.&quot; They reveal who they would most like to be interviewed by, and then I help them rehearse the questions they&#039;d like to be asked.\r\n\r\nAs a monthly show, I feature one comic, but for festivals, I feature 4 comics doing 10 minute sets, plus 5 minute interviews. The theme will likely be one we&#039;ve done before, and comics will be encouraged to tailor their sets to fit in with the theme. I also have an accompanist, Michelle Alexander, who plays piano and the source of witty, Paul Schaefer-esque banter. \r\n\r\nThanks so much for considering me--I would love to bring this show to Portland.\r\n",
      "copy": "Join comedian Kelly Anneken to enjoy an evening of... Kelly Anneken! Anneken sings, slings jokes, and showcases the comedy stylings of her lucky guest comedians. It&#039;s a night of delight for anyone who enjoys laughter, originality, Kelly Anneken, or all of those things.",
      "pageUrl": "12187-kelly-annekens-lack-of-variety-hour",
      "iTunesUrl": ""
    },
    {
      "id": 12191,
      "events": [],
      "name": "Naughty Bits",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/screen_shot_2016-01-31_at_7.44.05_pm.png",
      "photoUrl": "/api/img/show-images/show-naughtybits-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Our premise is that we give comics sex and dating advice based on their jokes. We&#039;ve been running the show since 2014, and we consistently sell out our monthly show in a theater seating appx 80 people.\r\n\r\nOur polished show can be broken out into 3 segments:\r\n1) A pre-recorded theme song by comedic musician Megan Simon + intros\r\n2) &quot;Sex news:&quot; a weekend update-style segment where we project our favorite sex and dating themed headlines and tell jokes about them (Begins 2:20 in video)\r\n3) Comics + Advice: comics (typically 4, though we&#039;ve successfully run between 3 and 5) tell sex and dating themed jokes and then sit down with us for &quot;advice&quot; (riffing/chatting about the set). It&#039;s a format that allows for both really funny spontaneous moments, and also more sincere discussions of sex and dating. \r\n\r\nWe have a unique premise and a format that allows us to easily plug in festival performers. We recently got a great response when we did the show at Hell Yes Fest, and ran a successful privately booked tour through Dallas, OKC and Tulsa.\r\n\r\nOur favorite aspect of the show is that honesty comics often express during our interviews allows for riffing to hit even harder. An excellent example of this can be seen in our tape at 27:42 through roughly 33:25, in which OKC comedian Josh Lathe shares with us his real point of view on his parent&#039;s relationship and allows the audience to really get to know him on an emotional level, just before telling a number of hilarious stories pointing out the importance of separate bedrooms for flatulent couples.",
      "copy": "Naughty Bits is a stand-up and sex advice show based out of Austin, TX. Comedians tell their best sex and romance jokes while sexperts Ella Gale &amp; Katie Stone give pointers on their *ahem* performance. \r\n\r\nWhat to expect: jokes and riffs on current &quot;sex news,&quot; great planned stand up comedy, hilarious off the cuff moments, and some very real talk about sex and relationships. Audience members are drawn in by the emotional honesty of performers, allowing space for the next joke to hit them even harder in the gut.",
      "pageUrl": "12191-naughty-bits",
      "iTunesUrl": ""
    },
    {
      "id": 12197,
      "events": [],
      "name": "WHO&#039;S THE ROSS?",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/profile_pic.jpg",
      "photoUrl": "/api/img/show-images/show-who039stheross-300x300.jpg",
      "sortOrder": 9999,
      "bio": "&quot;WHO&#039;S THE ROSS?&quot; is Portland&#039;s longest running late-night talk show, having logged 626 live performances in the past 8 years. \r\n\r\nImagine Conan with cocktails!\r\n\r\nEach show presents a brand-new mixture of comedy, music, and interviews, incorporating elements of improv, sketch, stand-up, and musical comedy. \r\n\r\nWTR&#039;s Bridgetown show(s) will feature performances by comedians from the festival, as well as a top-notch Portland musical guest backed by our very talented jazz-funk house-band, &quot;THEM! THE BAND!&quot; Guests personality, background, and experience will be on full display in sit-down interviews, conducted post performance, also featuring an absurd game or contest, ala Fallon&#039;s &quot;Tonight Show.&quot; \r\n\r\nIn addition to the guests from Bridgetown, WTR&#039;s festival performance will be tailor made to the event, exclusively written and constructed for this engagement. \r\n",
      "copy": "&quot;WHO&#039;S THE ROSS?&quot; is Portland&#039;s longest running late-night talk show, having logged 626 shows in the past 8 years. \r\n\r\nImagine Conan with cocktails!\r\n\r\nEach show presents a brand-new mixture of comedy, music, and interviews, incorporating elements of improv, sketch, stand-up, and musical comedy. \r\n\r\nA born &amp; bred Portlander, Aaron Ross is also the host of the &quot;You Who!&quot; rock n roll kid&#039;s show, Pickathon&#039;s &quot;Seriously?!&quot; comedy series, stars in the new web-series &quot;Training Wheels,&quot; and has performed at Comedy Central Live &amp; SXSW (2013-2016). ",
      "pageUrl": "12197-whos-the-ross",
      "iTunesUrl": ""
    },
    {
      "id": 12226,
      "events": [],
      "name": "RED FLAGS by LAURELLY",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/fullsizerender.jpg",
      "photoUrl": "/api/img/show-images/show-redflagsbylaurelly-300x300.jpg",
      "sortOrder": 9999,
      "bio": "SHOW:\r\nLauren Pritchard and Kelly Vrooman are &quot;LAURELLY&quot;, one of the fastest, genuinely hilarious improv duos performing today. They are the current improv CAGE MATCH champions at the iOWest Theatre (45 weeks and counting)! Their two-gal improv show is inspired by a real life &quot;Relationship Red Flag&quot; provided by an audience member.  LAURELLY then launches the audience through a whirlwind roller coaster of story lines and crazy characters.  One minute, they may be playing a sweet father/daughter scene, and the next minute they&#039;re playing every member of a high school band marching to stop a disastrous wedding from happening at Brony Con.  The real wow factor comes in the way Kelly and Lauren jump into each other&#039;s characters - rotating the cast of many between the two of them. In the end, LAURELLY brings redemption to the audience member&#039;s relationship red flag and saves the day! You&#039;ll definitely want to get on this twisty, thrilling ride - and find out what the Los Angeles improv scene has come to know as the &quot;It Duo&quot;!  \r\n\r\nFORMAT: \r\nRED FLAGS begins with some quick warm up introductions, crowd work, and then a suggestion, leading into the aforementioned  30-40 minute RED FLAG epic.  We then want to invite one or two Bridgetown improv performers we have never worked with (especially a guy who is ready to play in this world) onto the stage for a mini game, a 15 minute Red Flag telenovela on stage.    NOTE: LAURELLY also can do a full MUSICAL version of this to up the ante.  In December 2015, they did a completely improvised Holiday musical that felt so perfect even me (the manager) thought they had to have sketched it out - but nope - every lyric (Lauren and Kelly are professional singers) was improvised.  It gave Dickens a run for their money.\r\n\r\nPERFORMER BIOS:\r\nLauren Pritchard - started improvising in FL with Wayne Brady as a fetus in 1991. She now performs in LA at Improv Olympic, ComedySportz and UCB. She was a regular cast member on season 14 of MADtv.  Lauren is currently recurring on Disney Channel&#039;s Stuck in the Middle, Gamers Guide, and Jessie. She has also appeared on numerous other TV shows and stars in the Film The Engagement Claus (Christmas 2016)\r\n\r\nKelly Vrooman - is currently the star of The Chica Show on Sprout/NBC Kids and the face of national spots for Bounty and Microsoft.  Kelly is also a cast member of the sketch group, Tiny Muscles, at The Pack Theatre in Hollywood and her writing has been featured in The Huffington Post and WomensHealth.gov. ",
      "copy": "RED FLAGS is a fast-paced improv show about all disastrous relationships starring Los Angeles team LAURELLY.  Lauren Pritchard and Kelly Vrooman are &quot;LAURELLY&quot;, one of the fastest, genuinely hilarious improv duos performing today. Their two-gal improv show is inspired by a real life &quot;Relationship Red Flag&quot; provided by an audience member.  LAURELLY then launches the audience through a whirlwind roller coaster of story lines and crazy characters based on this relationship headed for doom.  One minute, they may be playing a sweet father/daughter scene, and the next minute they&#039;re playing every member of a high school band marching to stop a disastrous wedding from happening at Brony Con. The real wow factor comes in the way Kelly and Lauren jump into each other&#039;s characters - rotating the cast of many between the two of them. In the end, LAURELLY brings redemption to the audience member&#039;s relationship red flag and saves the day! You&#039;ll definitely want to get on this twisty-turny ride - and find out what the Los Angeles improv scene has come to know as the &quot;It Duo&quot;!  \r\n",
      "pageUrl": "12226-red-flags-by-laurelly",
      "iTunesUrl": ""
    },
    {
      "id": 12237,
      "events": [],
      "name": "Comedy Roast of a Brewmaster ",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/brewmasterroast_flyer_with_blank_bottom.jpg",
      "photoUrl": "/api/img/show-images/show-comedyroastofabrewmaster-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Hey Bridgetown! Our show is a Comedy Roast, we run it monthly here in the Bay Area (SF and Berkeley) and each time feature a different archetype as a guest of honor.  Then we find an actual professional from that field, write some hilarious jokes for them and have a good old fashion, no jokes barred, comedy roast! \r\n\r\nThis show is super fun, it&#039;s been going on for the last three years and we were just in SF Sketchfest!  We&#039;ve roasted everything from a Lawyer, Pothead and Street Kid to a Stripper, Drag Queen and Professional Wrestler.\r\n\r\nWe would love to come up with 4 of our best roasters and then add to that line-up with some locals.  As far as the guest of honor, we thought a Brewmaster would be a good topic for Portland, but are also flexible on that.  We can handle getting the guest of honor confirmed and set-up once there is a date.\r\n\r\nThank you for your consideration and I look forward to hearing back from you.\r\n\r\nBest,\r\n-Pete ",
      "copy": "San Francisco based RoastSF brings it&#039;s own brand of heart stopping, fall-to-the-floor laughing, no-jokes barred comedy roasts! Featuring monthly shows around the Bay Area and one offs across the country.  Join them as they bring 8 of the best INSULT comics together to mock each other and that night&#039;s controversial guest of honor. As always: drinking is encouraged, sensitivity…. is not.\r\n\r\nAs a special one off for the Bridgetown Comedy Festival, RoastSF presents:  Comedy Roast of a Brewmaster!\r\n\r\nThis month&#039;s guest of honor, a local Brewmaster who&#039;s spent his life dedicated to crafting the perfect vessels of inebriation.  How can you hate a brewmaster? Well, for one, you can be jealous.  Come see if he falls victim to the comics wacky mainstream perceptions or if he can take the abuse and stay sober enough to defend himself.  Sound mean?  It is! Don&#039;t worry though, the show will be as much about ripping on the Brewmaster as it is on those who love beer too much and those who, for some odd reason, hate it.  Also we made sure to get a Brewmaster whose a happy drunk!  So get ready to knock back a few cold ones, laugh your face off and oh yea DEFINITELY don&#039;t bring the kids because this one&#039;s gonna get sloppy.",
      "pageUrl": "12237-comedy-roast-of-a-brewmaster-",
      "iTunesUrl": ""
    },
    {
      "id": 12239,
      "events": [],
      "name": "The Slide Show",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/slide_show_pic.png",
      "photoUrl": "/api/img/show-images/show-theslideshow-300x300.jpg",
      "sortOrder": 9999,
      "bio": "The Slide Show presents a challenge to performers, create a funny story on stage utilizing the images projected on the screen behind them. The performer has 30 seconds to preface their story before the slides start, then eight random images (from a group of over 500 images) are projected on the screen for thirty seconds each, and then they have thirty seconds at the end to wrap up their story. The show is a lot of fun for the performers as they each try to come up with a unique framing for their story (things like: a person laying out their presidential platform, explaining a movie they just saw, relaying a crazy night out, telling a bedtime story, etc.) as well as fit the images into the context of what they are talking about. Often, there are sublime moments of synchronicity where images seem to pop up perfectly timed to what the person is saying. These moments are incredible, unique experiences for both the performer and the audience. \r\n\r\nThe show is great for performers because it requires no advanced preparation and does not require them to burn any material. I usually perform the show with 10 other comics and myself hosting which takes about 70-75 minutes (each set is exactly six minutes because of the timing of the slides) but it can be done with up to 14 people and still be completed in 90 or so minutes. \r\n \r\nThe Slide Show is one of the shows that has grown out of QED Comedy Laboratory, an experimental comedy show that I created and run with a different theme every week. We have staged this show a few times there as well as at the Scruffy City Comedy festival and I have toured with it, including at the Comedy Underground in Seattle.\r\n\r\nIt&#039;s a fun show that has never failed to please audiences and performers alike. \r\n",
      "copy": "In The Slide Show, comedians will have to make up a story based on eight random images shown for thirty seconds at a time on the screen behind them. ",
      "pageUrl": "12239-the-slide-show",
      "iTunesUrl": ""
    },
    {
      "id": 12250,
      "events": [],
      "name": "The Gateway Show",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/new-gateway-logo-flat.png",
      "photoUrl": "/api/img/show-images/show-thegatewayshow-300x300.jpg",
      "sortOrder": 9999,
      "bio": "The show is a simple one - Stand up comics do what they do best for five to seven minutes each, in order. We then have the comics, the show and the audience take a quick five to ten minute intermission where the performers get VERY stoned. Then we reconvene and have the same performers go BACK up in the exact same order to attempt to do ANOTHER set while they are completely high. \r\n\r\nThe audience loves it and is VERY supportive. Sometimes when we pitch the show to comedians they think it will be a mean spirited show, but it is exactly the opposite. If you&#039;ve smoked pot before you have had an experience where you smoked too much and people just relate to that. If you&#039;ve never smoked then the entire experience is so absurd you can&#039;t help but laugh. We have never had a comic had a bad experience and we&#039;ve been doing the show for over a year now.\r\n\r\nWe&#039;ve done the show in Seattle, Portland, Bellingham, Walla Walla and Richland so far. This year we have Olympia, Tacoma and Salem ready to host the show. Now that smoking is fully legal in Portland this is a great chance to bring this show to the festival and have a truly West coast-only experience with comics from out of town. If the legality of smoking is a worry, we have also done entire shows with edibles before, but we have never run into any legal worries in any cities as we just have the comics leave the premises to get stoned.\r\n\r\nWe hope you decide to go with the show!\r\n\r\nPS. I know you didn&#039;t ask for any promo, but here is the show as featured on local Portland&#039;s NBC affiliate - http://www.kgw.com/news/943967",
      "copy": "Stop us if you&#039;ve heard this one before - some of our favorite comics in the nation hit our stage and do their best sets, then they get WAY too high, only to come back on stage to do another set completely baked out of their minds.",
      "pageUrl": "12250-the-gateway-show",
      "iTunesUrl": ""
    },
    {
      "id": 12251,
      "events": [],
      "name": "Fresh Fish Variety Hour",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/fresh_fish_clean_small.jpg",
      "photoUrl": "/api/img/show-images/show-freshfishvarietyhour-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Fresh Fish is a variety show I host at UCB LA with its own unique voice and feel to it. Ask any comic who&#039;s performed and they will tell you it&#039;s a fun, weird, one of a kind show. From the time the audience enters the theatre we engage them in some way - for example, having performers in character usher them in as tour guides, pointing out historic events that happened in and around the theatre. To open the show I have the audience stand up to sing the national anthem. Which is &#039;All-Star&#039; by Smash Mouth. I also have a house band called The All Band Leaders Band - they were all so great, I made each of them the band leader. So between acts they each play whatever song they want, and when I ask the band leader a question they all answer at once. I doubt the regular musicians would make the trip, but there&#039;s no rehearsal involved so I&#039;m sure I could get a group together from Portland. My goal is to present a show that surprises and engages the audience throughout, and is also a positive fun experience. I book a mix of stand ups, sketch groups, characters, musical acts, and weird/variety acts such as magicians, sword jugglers, dance troupes, and stilt walkers. I book a mix of well-known acts (Jerry Minor, Nicole Byer, Trevor Moore, Brody Stevens) and great lesser known ones. In addition there are a few regular performers on the show such as Natalie Palamides (Powerpuff Girls) who would hopefully make the trip. Here are photos from past shows: https://www.facebook.com/freshfishshow/photos_stream Also, I&#039;m not a good editor. So the video linked below isn&#039;t best quality, but hopefully can give you an idea. ",
      "copy": "A sensory experience featuring standup, music, sketch &amp; other nonsense hosted by Michael Busch. Michael is a regular performer at The Upright Citizens Brigade in Los Angeles, and has appeared in numerous commercials and TV shows including Glee, Pretty Little Liars, Key &amp; Peele, Human Giant, and Conan. ",
      "pageUrl": "12251-fresh-fish-variety-hour",
      "iTunesUrl": ""
    },
    {
      "id": 12252,
      "events": [],
      "name": "Sorry, Please Continue",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/spc_logo.jpg",
      "photoUrl": "/api/img/show-images/show-sorrypleasecontinue-300x300.jpg",
      "sortOrder": 9999,
      "bio": "The show is a themed storytelling show. Every month, there is a theme, such as DATING or FAMILY. The Storytellers take turns telling their stories while a panel of comedians sit on a couch onstage and interrupt with jokes and questions and commentary. It is the most fun I&#039;ve ever had onstage, and so much fun to watch. Sometimes the stories are amazing on their own. Other times the story doesn&#039;t have much to it, but there are so many details that lead to amazing riffs from the panel. It is truly unpredictable and always a great time. ",
      "copy": "Described as cross between The Moth Radio Hour and Mystery Science Theater 3000, Sorry, Please Continue features some amazing stories told by anyone who wants to participate mixed with commentary from some of the best comedians around. ",
      "pageUrl": "12252-sorry-please-continue",
      "iTunesUrl": ""
    },
    {
      "id": 12259,
      "events": [],
      "name": "I SHIT YOU NOT!",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/isynpromo.jpg",
      "photoUrl": "/api/img/show-images/show-ishityounot-300x300.jpg",
      "sortOrder": 9999,
      "bio": "&quot;I SHIT YOU NOT!&quot; is a monthly storytelling show and weekly podcast featuring comedians, storytellers and regular people sharing true and embarrassing tales, often dealing with failed restraint and bodily blunders. Since its inception in 2012 &quot;I SHIT YOU NOT!&quot; has set itself apart from other live lit and comedy shows by giving audiences a one-of-a-kind storytelling experience and was named one of the Best Shows in Chicago by The Chicago Reader in 2015!  \r\n\r\nThe live show takes place on the last Thursday of every month and is hosted/ produced by comedians Michael Sanchez (Comedians You Should Know) and Seth Davis (Laugh Factory, Zanies, and Seth and Mallory’s Kickback Comedy Show).  Monte Lamonte, a founding member of the show now lives in LA but is still apart of our family.  \r\n\r\nBeing apart of this show has been so much fun.  We have met people who thanked us for giving them a safe place to share their most embarrassing moments.  Even our mom’s come out to this show and talk about how much they love it.  The misconception about the show is that it is gross potty humor but it is amazing to see performers be so sweet and vulnerable while sharing some of their most intimate embarrassing memories.  The show is also just plain old fun.  Audiences at everyone of our shows are rooting harder for our performers than I have ever seen in any other medium and everyone walks away like they were all part of one big supportive party.  We are literally celebrating our embarrassment.  \r\n\r\nThe way our show works is Michael and Seth will host each show and then we bring on our storytellers.  Storytellers consist of comics, storytellers, improvisors, and your regular everyday average Joe/ Joanne.  Each show usually has 6 storytellers not including the hosts and it is our goal for every show to have 3 women and 3 men perform.  The other awesome aspect of our show is that each story is recorded and put on to our “POODCAST”.  The “POODCAST” is hosted by Michael Sanchez, Monte Lamonte, and Seth Davis.  We sit around reminiscing of funny memories and embarrassing personal tales.  It’s like hanging out with your buddies and talking and laughing the entire time.  Each “POODCAST” also features a performance from one of our storyteller’s live shows.  It’s really fun.\r\n\r\nOur shows also make great dates.  Randomly I looked us up on Yelp and read this review where this woman wrote, &quot;There&#039;s no better way to impress your date than to invite him to a night of poop stories. Showing that you&#039;re willing to laugh, clap and heckle at over an hour of filthy story telling will demonstrate that you&#039;re exactly the kind of cool girl he can take home to his kickball league...”  It’s funny because we usually find more women at our shows than men.   \r\n\r\nWe hope you’ll check out our show and consider us for your festival. Thanks!",
      "copy": "&quot;I SHIT YOU NOT!&quot; is a monthly storytelling show and weekly podcast featuring comedians, storytellers and regular people sharing true and embarrassing tales, often dealing with failed restraint and bodily blunders. Since its inception in 2012 &quot;I SHIT YOU NOT!&quot; has set itself apart from other live lit and comedy shows by giving audiences a one-of-a-kind storytelling experience and was named one of the Best Shows in Chicago by The Chicago Reader in 2015!  \r\n\r\nThe live show takes place on the last Thursday of every month and is hosted by comedians Michael Sanchez (Comedians You Should Know) and Seth Davis (Laugh Factory, Zanies, Seth and Mallory’s Kickback Comedy Show).\r\n\r\n\r\nWebsite: http://ishityounotshow.com \r\nPodcast: http://itunes.apple.com/us/podcast/the-poodcast!/id880376178",
      "pageUrl": "12259-i-shit-you-not",
      "iTunesUrl": ""
    },
    {
      "id": 12282,
      "events": [],
      "name": "Crushes, Loves, &amp; One Night Stands",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/img_0010.jpg",
      "photoUrl": "/api/img/show-images/show-crusheslovesamponenightstands-300x300.jpg",
      "sortOrder": 9999,
      "bio": "CRUSHES, LOVES, &amp; ONE NIGHT STANDS\r\n\r\nThis show would be a great edition to the Bridgetown Comedy Festival because the theme is based entirely on what people think about most of the time; dating and relationships and the tragic comedy that occurs when trying to be with another person.  It&#039;s mainly storytelling based but we also allow comics to do their relationship material to mix things up.  And we are starting to have performers illustrate their stories, or provide other visual aids, to have a more multi-media approach.  The show is based on personal confessions so as hosts we take extra special care to make sure that we create a welcoming environment for all backgrounds, performers and audience alike.\r\n\r\nCRUSHES, LOVES, &amp; ONE NIGHT STANDS is a different kind of comedy experience that will stick with any audience long after they have left the show and would be a great edition to the Bridgetown Comedy Festival.",
      "copy": "CRUSHES, LOVES, AND ONE STANDS is a stand up/storytelling show devoted entirely to confessional dating experiences.  Hosts, Richard Toomer and Gabby Poccia, invite comics, storytellers, and other dynamic personalities to share their hilarious hook up stories, first crush memories, and funny thoughts on relationship in general.  Come laugh at the lengths we&#039;ll go through to not be alone, the tragedies and victories that occur in the pursuit of others, or just come and feel better knowing there are others who Facebook stalked their exes this week.  Whether you&#039;re a sentimental kitten or a supersonic nymphonic tornado, you&#039;re bound to enjoy the affair.",
      "pageUrl": "12282-crushes-loves--one-night-stands",
      "iTunesUrl": ""
    },
    {
      "id": 12319,
      "events": [],
      "name": "Date Night: Comedians Give Dating Advice ",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/datenightnyc.jpg",
      "photoUrl": "/api/img/show-images/show-datenightcomediansgivedatingadvice-300x300.jpg",
      "sortOrder": 9999,
      "bio": "This is a showcase of comedians answering anonymous dating, relationship &amp; sex questions with the wisdom and ridiculous insight only a comedian has. It&#039;s an improv and &quot;anything can go&quot; experience that keeps you engaged.The comedians weave their own dating experiences, stories, and jokes with random and unexpected questions. It&#039;s stand up comedy with a TWIST! After a run on tour, the show found it&#039;s home for over 6 months on every 4th Thursday 10PM at The Creek and The Cave (NYC) where it was nominated for &quot;Best New Show&quot;. It&#039;s new home is inside Sandy Station, in Salt Lake City, Utah where it&#039;s performed monthly. (The hosts &amp; founders moved to SLC from NYC, which is the normal comedy trajectory of course). The show was also taken on tour to test out it&#039;s concept, and had great shows in Seattle at the Comedy Underground, Portland, Oregon at Kickstand Comedy and other less awesome towns. The show was founded, hosted and is produced by comedy duo: Doug &amp; Teresa Wyckoff, and we&#039;ve had great comedians on the show from Mark Normand to Ben Kronberg. DIfferent comedians with different styles, bringing unplanned magic to the stage. \r\n\r\nThe audience writes down relationship/sex/dating questions on cards, comedians pull out the cards during their set and improv their sets based on the questions they receive. \r\n\r\nYou can learn more about the show here:\r\nhttp://www.theheandsheshow.com/what-is-date-night/",
      "copy": "Comedians answer YOUR dating &amp; relationship questions. Your favorite comedians answering YOUR anonymous Relationship, Dating and Sex questions with the wisdom and insight only a comedian has. It&#039;s an &quot;anything can happen&quot; stand up comedy experience. We weave our own dating experiences, stories, and jokes with YOUR random and unexpected questions. ",
      "pageUrl": "12319-date-night-comedians-give-dating-advice-",
      "iTunesUrl": ""
    },
    {
      "id": 12349,
      "events": [],
      "name": "The Tinkle Twins ",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/screen_shot_2016-02-03_at_3.03.33_am.png",
      "photoUrl": "/api/img/show-images/show-thetinkletwins-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Hosted by Dana Gould and Arden Myrin, The Tinkle Twins! is a popular LA variety show at the Nerdmelt Theater at Meltdown Comics in Los Angeles.  It  features comedy from top comics, with the occasional magician or musician thrown in to keep things Tinkletastic! Former Simpsons writer Dana Gould&#039;s latest comedy album I Know It&#039;s Wrong debuted at #1 on iTunes. He can also be seen on the new TNT show Mob City created by Frank Darabont. Arden Myrin is a regular @Midnight panelist, appeared on over 100 episodes of Chelsea Lately, and recently she has been on Orange is the New Black, Key &amp; Peele, Inside Amy Schumer and Fresh Off the Boat.",
      "copy": "Hosted by Dana Gould and Arden Myrin, The Tinkle Twins! is a popular LA variety show at the Nerdmelt Theater at Meltdown Comics in Los Angeles.  It  features comedy from top comics, with the occasional magician or musician thrown in to keep things Tinkletastic! Former Simpsons writer Dana Gould&#039;s latest comedy album I Know It&#039;s Wrong debuted at #1 on iTunes. He can also be seen on the new TNT show Mob City created by Frank Darabont. Arden Myrin is a regular @Midnight panelist, appeared on over 100 episodes of Chelsea Lately, and recently she has been on Orange is the New Black, Key &amp; Peele, Inside Amy Schumer and Fresh Off the Boat.",
      "pageUrl": "12349-the-tinkle-twins-",
      "iTunesUrl": ""
    },
    {
      "id": 12359,
      "events": [],
      "name": "Uncalled Four",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/facebook-logo-full.jpg",
      "photoUrl": "/api/img/show-images/show-uncalledfour-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Uncalled Four is one of the best interactive shows in the country, with fest attendees contributing, voting, and winning prizes. We also highlight the city we&#039;re in, soliciting local businesses for quirky and awesome prizes, trying to find the &quot;weird&quot; where you live. But above all that, it&#039;s the comics who love doing the show. Competition brings out the best in them. In short, it&#039;s a fun and dirty comedy game show where everyone wins.",
      "copy": "Half stand up, half game show, Uncalled Four is an interactive crowd experience. Comedians write a deck of 20 terrible/hilarious answers to audience questions like &quot;What does Trump&#039;s hair smell like?&quot; or &quot;Dad went out to buy _____ and never came back.&quot; Comedians each submit a card while we give out a prize each round, then fan reaction determines the winner. After 30 minutes, comics can wager points in the final &quot;Degenerate Gambler&quot; round to see who will be The Worst Person.",
      "pageUrl": "12359-uncalled-four",
      "iTunesUrl": ""
    },
    {
      "id": 12359,
      "events": [],
      "name": "Uncalled Four",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/facebook-logo-full.jpg",
      "photoUrl": "/api/img/show-images/show-uncalledfour-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Uncalled Four is one of the best interactive shows in the country, with fest attendees contributing, voting, and winning prizes. We also highlight the city we&#039;re in, soliciting local businesses for quirky and awesome prizes, trying to find the &quot;weird&quot; where you live. But above all that, it&#039;s the comics who love doing the show. Competition brings out the best in them. In short, it&#039;s a fun and dirty comedy game show where everyone wins.",
      "copy": "Half stand up, half game show, Uncalled Four is an interactive crowd experience. Comedians write a deck of 20 terrible/hilarious answers to audience questions like &quot;What does Trump&#039;s hair smell like?&quot; or &quot;Dad went out to buy _____ and never came back.&quot; Comedians each submit a card while we give out a prize each round, then fan reaction determines the winner. After 30 minutes, comics can wager points in the final &quot;Degenerate Gambler&quot; round to see who will be The Worst Person.",
      "pageUrl": "12359-uncalled-four",
      "iTunesUrl": ""
    },
    {
      "id": 12362,
      "events": [],
      "name": "Sexpot Comedy",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/andy_juett_kayvan_silly_picture_day.jpg",
      "photoUrl": "/api/img/show-images/show-sexpotcomedy-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Sexpot Comedy is the knockdown, drag out leader of Denver&#039;s comedy scene and the architect and producing arm of 30 live shows and 16 podcasts a month, an original webseries and a free porprietary radio stream (SEXPOT RADIO.) The coup de gras of these  shows is the Sexpot Comedy monthly show and GQ Magazine agrees naming SEXPOT COMEDY ONE OF THE 5 FUNNIEST NIGHTS IN AMERICA in the August 2015 Comedy Issue with Amy Schumer. It&#039;s the busiest, most anticipated show of the month with pre-show shenanigans by Jim Hickox before the show. Jim routinely taunts and challenges the audience with bizarre videos and typed messages on the 30 foot screen at the oriental theater to the point that if there are &#039;bad actors&#039; in the crowd, they will be skewered at Jim&#039;s request as the smart comedy mob at Sexpot Comedy&#039;s shows won&#039;t tolerate it. Then the show kicks off with stand up or a sketch by Andy Juett and an array of comedy cohorts, a Sexpot Comedy video and then it&#039;s right into the best of Denver mixed with today&#039;s biggest national comedic names including: Kumail Nanjiani, T.J. Miller, Matt Braunger, Kate Berlant, Rory Scovel, Nikki Glaser, Beth Stelling, Aparna Nancherla, The Grawlix, Andy Kindler and more. Andy Juett and Kayvan Khalatbari started these secret cannabis friendly shows in Kayvan&#039;s pizza restaurants late at night with blacked out windows and free weed and pizza. They grew out of necessity into a monthly show at a theater that seats 400. The press and crowds agree: Sexpot Comedy is the best monthly show in Denver. Recent headline: &#039;MEET DENVER&#039;S UNABASHED LEADER OF COMEDY&quot; -ROOSTER MAGAZINE in reference to Andy Juett. Late to the actual standup game himself, Andy has 10,000 hours in producing, acting and writing. Juett has aggressively taken to the stage bringing Sexpot Comedy to SXSW, the Hollywood Improv, The Comedy Exposition of Chicago, CROM and CROM WEST and sold the most tickets at 2015&#039;s High Plains Comedy Festival which Juett co-founded. As one recent strange introduction portended, &#039;&#039;Juett is the Chris Hardwick of Denver and he&#039;s just getting started.&quot; Bridgetown Comedy Festival remains Sexpot Comedy&#039;s biggest live show goal. We humbly beseech consideration to make this dream a reality in 2016. NOTE: VIDEO SUBMISSION is JUST Andy&#039;s opener at 2015 High Plains. Matt Braunger or Charlene can speak to enthusiasm for the show.",
      "copy": "Sexpot Comedy is Denver&#039;s biggest monthly Show. Party starter Andy Juett leads the charge into a foray of video, sketch and pre-show antics via Denver stalwart Jim Hickox so get there early. From start to finish, Sexpot Comedy is a raging cannabis infused laugh fest that keeps things loose and unpredictable through some of the best standup has to offer. Guests are a smattering of Denver&#039;s finest and past national darlings like Kumail Nanjiani, Matt Braunger, Nikki Glaser, Beth Stelling, Rory Scovel and Kate Berlant. In the August 2015 Comedy Issue of GQ Magazine Sexpot Comedy was names one of the 5 FUNNIEST NIGHTS IN AMERICA. Born out of speakeasy free cannabis and pizza shows, Kayvan Khalatbari and Andy Juett have grown Sexpot Comedy into Denver&#039;s most influential scene contributor. Get ready to laugh and feel free to get lifted a Mile High. They&#039;ll do all the work. You just bliss out. Beware: Your sides WILL hurt. But you&#039;ll feel great.",
      "pageUrl": "12362-sexpot-comedy",
      "iTunesUrl": ""
    },
    {
      "id": 12365,
      "events": [],
      "name": "Dark Spots",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/12643019_10153434152798517_4838108582744034361_n.jpg",
      "photoUrl": "/api/img/show-images/show-darkspots-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Dark Spots is a show that encourages uncomfortable subject matter chosen carefully by the performers selected for the show under a theme picked by the host and producers (Shane Torres, Alison Zeidman, and Nate Fridson). The show prides itself on conquering subjects that maybe considered taboo by many people. Dark Spots also takes a great amount of pride in having performers with different perspectives and experiences on the theme of that months show.  For instance one theme was addiction and performers covered everything food addiction to gambling, to cutting.  While it&#039;s a somewhat untradtional approach to a comedy show it has been something that we are very proud of and has taken on very large and dedicated crowd in here in New York. ",
      "copy": "Dark Spots is a free, monthly comedy show where comedians are asked to perform their darkest, saddest, and most traumatic–but funny–bits. Hosted by Shane Torres (Comedy Bang Bang, Just for Laughs), Nate Fridson (Bridgetown Comedy Festival, AST Records), and Alison Zeidman (Reductress, New York Times), each month performers are asked to do a set inspired by a different dark theme, such as death, illness, depression, divorce, addiction, and more. ",
      "pageUrl": "12365-dark-spots",
      "iTunesUrl": ""
    },
    {
      "id": 12366,
      "events": [],
      "name": "B)i(G EXPRESSION",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/zombiecoverart.jpg",
      "photoUrl": "/api/img/show-images/show-bigexpression-300x300.jpg",
      "sortOrder": 9999,
      "bio": "We get the audience to drop some hard truths; That&#039;s just one thing you can definitely expect from a B)i(G EXPRESSION show. Some hard truths may include having a sex dream about your lonely mom, calling your dad fat when you&#039;re eight years old, or sleeping around with three people in one day. Using spotlights and full washes instead of blackouts, the duo has changed the traditional form of a normal sketch show to create a seamless comedy experience that&#039;s more like an acid trip. With the help of live tribal drummers, vignettes of human behavior are shown through campfire storytelling. The show features original songs, videos, and encourages audience participation.\r\nOur audience members have described our shows as &quot;The Burning Man of Comedy.&quot;",
      "copy": "Blake Harrison and Garrett Mendez return as the comedy truthsayers to blow minds, change the world, and face some hard truths. Come fear trippin and enjoy a slice of humble pie.",
      "pageUrl": "12366-big-expression",
      "iTunesUrl": ""
    },
    {
      "id": 12371,
      "events": [],
      "name": "Cartoons &amp; Comedy",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/cartoons_logo.jpg",
      "photoUrl": "/api/img/show-images/show-cartoonsampcomedy-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Cartoons &amp; Comedy is a fun nostalgic trip with lots of laughs.  I put together episodes of the best (and worst) cartoons from the 80&#039;s and early 90&#039;s and edit in the commercials from that time.  A panel of comedians riff on the show while the crowd enjoys free cereal.  Between and after the episodes I have the comics do short stand up sets with material related to growing up.  The show has been running for three years here in Denver and has been very well received.  At every show, someone yells out &quot;I had that toy!&quot; or &quot;Oh my god I totally forgot about that!&quot;  The mix of the cartoons, commercials and cereal really puts people back into a place of being a kid again.  It&#039;s a labor of love that has drawn such awesome guests as Chris Fairbanks, Sean Patton, Rory Scovel and Run Funches.  ",
      "copy": "Cartoons &amp; Comedy is a purely fun show for crowds and performers alike, a rare glimpse into childhood from the safely ironic distance of years past. The show offers a way to bond over shared memories and laugh at the absurdity we used to innocently accept at face value, all leavened by cheap beer and sugary cereal. Cartoons &amp; Comedy brings its childlike bonhomie and essential spirit while presenting the nimble riffs of Denver&#039;s funniest locals and drop-ins from comedy nerd heroes like Ron Funches, Rory Scovel and Power Violence. At the helm of this endeavor is Chris Baker, who hustles his cherubic ass off — cutting together a video package of old cartoons, wrestling videos and &#039;80s toy commercials, and booking a lineup of quick-witted comics. Join Baker along with local comics and special guests Mystery Science Theater-style mockery. ",
      "pageUrl": "12371-cartoons--comedy",
      "iTunesUrl": ""
    },
    {
      "id": 12371,
      "events": [],
      "name": "Cartoons &amp; Comedy",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/cartoons_logo.jpg",
      "photoUrl": "/api/img/show-images/show-cartoonsampcomedy-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Cartoons &amp; Comedy is a fun nostalgic trip with lots of laughs.  I put together episodes of the best (and worst) cartoons from the 80&#039;s and early 90&#039;s and edit in the commercials from that time.  A panel of comedians riff on the show while the crowd enjoys free cereal.  Between and after the episodes I have the comics do short stand up sets with material related to growing up.  The show has been running for three years here in Denver and has been very well received.  At every show, someone yells out &quot;I had that toy!&quot; or &quot;Oh my god I totally forgot about that!&quot;  The mix of the cartoons, commercials and cereal really puts people back into a place of being a kid again.  It&#039;s a labor of love that has drawn such awesome guests as Chris Fairbanks, Sean Patton, Rory Scovel and Run Funches.  ",
      "copy": "Cartoons &amp; Comedy is a purely fun show for crowds and performers alike, a rare glimpse into childhood from the safely ironic distance of years past. The show offers a way to bond over shared memories and laugh at the absurdity we used to innocently accept at face value, all leavened by cheap beer and sugary cereal. Cartoons &amp; Comedy brings its childlike bonhomie and essential spirit while presenting the nimble riffs of Denver&#039;s funniest locals and drop-ins from comedy nerd heroes like Ron Funches, Rory Scovel and Power Violence. At the helm of this endeavor is Chris Baker, who hustles his cherubic ass off — cutting together a video package of old cartoons, wrestling videos and &#039;80s toy commercials, and booking a lineup of quick-witted comics. Join Baker along with local comics and special guests Mystery Science Theater-style mockery. ",
      "pageUrl": "12371-cartoons--comedy",
      "iTunesUrl": ""
    },
    {
      "id": 12399,
      "events": [],
      "name": "Yo, Is This Racist? LIVE PODCAST",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/yo_logo.jpg",
      "photoUrl": "/api/img/show-images/show-yoisthisracistlivepodcast-300x300.jpg",
      "sortOrder": 9999,
      "bio": "The Yo, Is This Racist? Podcast is a daily podcast offshoot of the blog of the same name, with the very simple premise: Ask me if something is racist, and I&#039;ll tell you. The podcast typically has a writer/comedian guest and me, Andrew Ti, the host, taking a call-in question from a fan, about any and all aspects of racism, or potential racism, in pop culture, politics, the Internet, and sometimes, just from some asshole at work. The tone of the show is as light as the subject matter allows, funny people time to address serious issues in a way that doesn&#039;t need to be preachy or pedantic, and can be fun.\r\n\r\nFor the live versions of the podcast, I typically have one or two guests, and we take both calls from the voicemail inbox, but also questions from the audience, in a longer form 45min-1hr block. The idea is to create a safe space to ask your dumb questions, to take the sting out of racism and accidentally being racist, and to provide a unique perspective on this burning question.\r\n\r\nAt Bridgetown, specifically, I&#039;d also be open to the idea of working in stand-up sets, either by having the performers do a quick set, and then calling them back to form the panel that will answer questions.",
      "copy": "Yo, Is This Racist? is the podcast that provides a much needed service: Ask them if something is racist, and they&#039;ll tell you. Join host Andrew Ti and guests, as they answer your burning questions about anything you think might be racist, from politics, TV, movies, the Internet, your racist-ass grandma, anything. GUARANTEE: WE WILL SOLVE RACISM AT THIS SHOW",
      "pageUrl": "12399-yo-is-this-racist-live-podcast",
      "iTunesUrl": ""
    },
    {
      "id": 12412,
      "events": [],
      "name": "The Worst",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/group_photo_the_night_before_it_happened.jpg",
      "photoUrl": "/api/img/show-images/show-theworst-300x300.jpg",
      "sortOrder": 9999,
      "bio": "What is the worst? Well, some would say waiting in traffic, going to a parent teacher conference, or the films of Uwe Boll. The Worst, is a show dedicated to all of that. \r\n\r\nOur show started out as a bunch of stand up comedians who got bored of doing the same thing every night and thought that writing sketches would be fun. It has since transformed into a multimedia hodge podge of live sketches, stand up performances, musical acts, and videos ranging from man on the streets to mini documentaries. The whole show runs on a simple theme, basically if you&#039;ve ever referred to anything as &quot;the worst&quot; in exasperation, we probably have a sketch, or a video, or a musical number about just that. \r\n\r\nThe cast of The Worst formerly performed as Don&#039;t Watch This Show: Live, which was named the Best Comedic Variety Show by SF Weekly in 2013. We performed in SF Sketchfest for 3 years and even won their video contest in 2014. We performed as The Worst at two sold out showcases in this year&#039;s festival. But that doesn&#039;t really tell the whole story. The Worst is 8 people working on something they love, and apparently what we love is borderline-absurdist sketch comedy. We strive to raise the bar for what people expect from a sketch comedy show. No topic is too touchy nor obscure and no stage is safe from being covered in anything from corn flakes to fake blood. \r\n\r\nWe would also love to feature 1 or 2 guest comics to do sets during the course of the show and participate in a sketch or two.",
      "copy": "Founded in 2015 by stand-up comedians, The Worst strives to be something different. A variable engine of absurdity, parody, and obtuseness, with equal parts SNL, morning talk shows, and awkward high school stories The Worst offers an alternative to both traditional stand-up and the independent theater circuit by offering a little of both. \r\n\r\nThe Worst is: \r\n\r\nJustin Alan - A bearded bow tie aficionado has never sounded so funny. Justin Alan started telling jokes on stage in early 2011 and is going stronger than ever. Justin has been hustling hard from SF to NY to LA doing stand up, and is tapping into improv, writing, and acting as well. He hates spiders.\r\n\r\nSeamus Calder - Born and raised in San Francisco, Seamus has been active in theater for over a decade. An ordained minister, freelance writer, and a failed mayoral candidate sometimes he does stand up, sometimes he sleeps till noon. His hair is amazing, and he has never lost a game of Star Fox 64.\r\n\r\nBrian Fields - Brian grew up a hick boy in the southern part of Ohio. He bagged groceries during the summer. He became a professional poker player and made a bunch of money. He has a Ph.D. in Computers. Brian believes happiness is possible in this world, however ephemeral.\r\n\r\nSarah Longacre - As demonstrated by the length of time it took for this bio to be written, Sarah is a procrastinator who is allowed to be in the group because she lets us typecast her as small children and loose women. Her acting profession peaked at the age of 8 when she was cast in a musical production of Babes In Toyland, where she played the non speaking role of the creepy cat. Sarah sells market research by day and does whatever she feels like at night, including drinking wine and pestering her cat and husband. \r\n\r\nJacob Rubin - Jacob Rubin is an Oakland-based comedian, writer, and otherwise performer in whatever he&#039;s asked to do. He has performed at clubs all over California, including the Purple Onion, the SF Punchline, and the Comedy Store in Hollywood, but he has been seen hitting his head on door frames in venues all across the country. As of this writing, he has use of both of his legs, but you never know. \r\n\r\nEmily Van Dyke - Emily Van Dyke is 31 and still on her mom&#039;s cell phone plan. Originally from Indiana, The Crossroads of America, she has struggled to overcome a monotone voice, nearsightedness and the death of her late cat &quot;Patches&quot; to become a comic who has an apartment with a washer/dryer inside of it. Emily hosts the comedy dating show &quot;Flirting with Laughter,&quot; she was the winner of the 2013 Walk the Plank Comedy Competition and she performs in clubs and basements all the time. Also Emily Van Dyke is not related to Dick Van Dyke so don&#039;t be an idiot and ask her that. ",
      "pageUrl": "12412-the-worst",
      "iTunesUrl": ""
    },
    {
      "id": 12422,
      "events": [],
      "name": "Hecklevision",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/image_0.jpeg",
      "photoUrl": "/api/img/show-images/show-hecklevision-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Hecklevision is bad movies made better with guest comics and the audience texting jokes on-screen instantly!\r\n\r\nUm, as you&#039;re aware I submitted this last year and it was accepted but didn&#039;t work out due to scheduling conflicts so I&#039;m trying again!\r\n\r\nHollywood Theatre could do this at 9:30pm on Saturday 6/4 or Sunday 6/5 so let me know what you think! Tech needs would be covered by Hollywood.\r\n\r\nPS. It required a video so I just I linked the Hackers trailer but we can do anything!",
      "copy": "Bad movies + text messages = HECKLEVISION! Through the magic of MuVChat technology, your jokes, heckles and commentary are encouraged - in TEXT form! Tap out your wittiest wisecracks with your phone and they&#039;ll appear instantly on screen! Each month, special guests will hang out to crack jokes via text with you and a few hundred of your best friends! ",
      "pageUrl": "12422-hecklevision",
      "iTunesUrl": ""
    },
    {
      "id": 12436,
      "events": [],
      "name": "BURN HEAL",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/12362654_1206535912693343_6439776447756023597_o_0.jpg",
      "photoUrl": "/api/img/show-images/show-burnheal-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Burn Heal is a combination of Stand Up Comedy and Oddball Video Games!\r\nComics are each given a short set to show off their funny side, and then are thrown into a competitive, frenetic tournament. Gabriella Fox (Showtime, Comedy Central, HBO) and Phillip Binder (Dreamworks, Comedy Central), the hosts of the show, categorize the odd and nostalgic video game titles (Gang Beasts, Nidhogg, Mount Your Friends) that range from new and odd to old and broken. The comics are each mic&#039;d and provide color commentary along with the hosts. \r\nThe show is separated into 2 comics each doing 10 minutes of material, followed by the SAME COMICS playing a game they&#039;ve probably never heard of. Rules are explained through video clips and a practice round is given for familiarity. It&#039;s four comics total, with the final game being a championship round. \r\nThe games, being absolutely non-intuitive, strike a chord with hardcore gamers and people just looking for a spectacle.\r\nPrevious performers include Brent Weinbach, Matt Donaher, Emmy Blotnick, and Whitmer Thomas.\r\n",
      "copy": "BURN HEAL exists only to make stand up comics do good at something else: video games. Hosts Gabriella Fox (Showtime, Comedy Central, HBO) and Phillip Binder (Dreamworks, Comedy Central) categorize the odd and nostalgic video games from the edges of the internet. Comics do their set, that&#039;s what they&#039;re comfortable with, followed by the most non-intuitive games dug up from the darknet.",
      "pageUrl": "12436-burn-heal",
      "iTunesUrl": ""
    },
    {
      "id": 12445,
      "events": [],
      "name": "The Crabfeast with Ryan Sickler and Jay Larson",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/crabfeast_atccover.jpg",
      "photoUrl": "/api/img/show-images/show-thecrabfeastwithryansicklerandjaylarson-300x300.jpg",
      "sortOrder": 9999,
      "bio": "The Crabfeast is a conversational and storytelling podcast hosted by Jay Larson and Ryan Sickler. Our unique combination of comradery, storytelling, comedic wit and lives lived full make for an amazing podcast experience.",
      "copy": "The Crabfeast is a conversational and storytelling podcast hosted by Jay Larson and Ryan Sickler. Their podcast comes out every Toozdee on the All Things Comedy Network, and has featured guests such as Jay Mohr, Pete Holmes, Hannibal Buress, etc. They’ve been featured at SXSW, Riot LA, Bridgetown Comedy Festival, SF Sketchfest, The Pete Holmes Show on TBS and the Damon Bruce National Radio Show. Each month they host a live podcast at the Improv Lab. Jay and Ryan’s unique combination of comradery, storytelling, comedic wit and lives lived full make for an amazing podcast experience.",
      "pageUrl": "12445-the-crabfeast-with-ryan-sickler-and-jay-larson",
      "iTunesUrl": ""
    },
    {
      "id": 12450,
      "events": [],
      "name": "First Comes Love",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/fcl.png",
      "photoUrl": "/api/img/show-images/show-firstcomeslove-300x300.jpg",
      "sortOrder": 9999,
      "bio": "**Honestly the show description is pretty brilliant, but this show has really been growing over the past year, and Ron Jeremy starred in it during the NY Comedy Festival this year. It&#039;s quite the experience **\r\n\r\nA few years ago, comedian and bored drunk Kyle Ayers decided to post a fake job on Craigslist, out of pure curiousity. He put an ad up, claiming to be a producer for a very prominant adult film (porn) company. &quot;Send me your best three to four page porn script. I want to find the &#039;next big thing in adult film writing.&#039; And make it weird.&quot;\r\n\r\nHe wasn&#039;t sure what to expect, but he certainly didn&#039;t expect the flood of responses. Over 1,000 responses in just under a week. Musicals, movie spoofs, personal experiences put down on pages, sex toys you&#039;ve never even heard of, everything. Over a thousand scripts and (still!) growing. After a while, Kyle decided it was time to do something with these scripts. \r\n\r\nUsing the talents of some of the best comedians around (and willing members of the audience!), First Comes Love honors this aspiring porn writers by acting these scripts out, live on stage. Word for word, line for line, typo for typo, comedians, actors, and audience members pay tribute through performance, and get really, really weird. Props, costumes, everything that would make up a bad high school theater production.\r\n\r\nFirst Comes Love has been featured in the Brooklyn Comedy Festival, the NerdMelt Showroom in Los Angeles, RIOT festival in LA, COME AND TAKE IT COMEDY festival in Houston, and has been standing room only for all of its shows. A show on the rise, it has big things planned moving forward. ",
      "copy": "A few years ago, comedian and bored drunk Kyle Ayers decided to post a fake job on Craigslist, out of pure curiousity. He put an ad up, claiming to be a producer for a very prominant adult film (porn) company. &quot;Send me your best three to four page porn script. I want to find the &#039;next big thing in adult film writing.&#039; And make it weird.&quot;\r\n\r\nHe wasn&#039;t sure what to expect, but he certainly didn&#039;t expect the flood of responses. Over 1,000 responses in just under a week. Musicals, movie spoofs, personal experiences put down on pages, sex toys you&#039;ve never even heard of, everything. Over a thousand scripts and (still!) growing. After a while, Kyle decided it was time to do something with these scripts. \r\n\r\nUsing the talents of some of the best comedians around (and willing members of the audience!), First Comes Love honors this aspiring porn writers by acting these scripts out, live on stage. Word for word, line for line, typo for typo, comedians, actors, and audience members pay tribute through performance, and get really, really weird. Props, costumes, everything that would make up a bad high school theater production.\r\n\r\nFirst Comes Love has been featured in the Brooklyn Comedy Festival, the NerdMelt Showroom in Los Angeles, RIOT festival in LA, COME AND TAKE IT COMEDY festival in Houston, and has been standing room only for all of its shows. A show on the rise, it has big things planned moving forward. ",
      "pageUrl": "12450-first-comes-love",
      "iTunesUrl": ""
    },
    {
      "id": 12450,
      "events": [],
      "name": "First Comes Love",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/fcl.png",
      "photoUrl": "/api/img/show-images/show-firstcomeslove-300x300.jpg",
      "sortOrder": 9999,
      "bio": "**Honestly the show description is pretty brilliant, but this show has really been growing over the past year, and Ron Jeremy starred in it during the NY Comedy Festival this year. It&#039;s quite the experience **\r\n\r\nA few years ago, comedian and bored drunk Kyle Ayers decided to post a fake job on Craigslist, out of pure curiousity. He put an ad up, claiming to be a producer for a very prominant adult film (porn) company. &quot;Send me your best three to four page porn script. I want to find the &#039;next big thing in adult film writing.&#039; And make it weird.&quot;\r\n\r\nHe wasn&#039;t sure what to expect, but he certainly didn&#039;t expect the flood of responses. Over 1,000 responses in just under a week. Musicals, movie spoofs, personal experiences put down on pages, sex toys you&#039;ve never even heard of, everything. Over a thousand scripts and (still!) growing. After a while, Kyle decided it was time to do something with these scripts. \r\n\r\nUsing the talents of some of the best comedians around (and willing members of the audience!), First Comes Love honors this aspiring porn writers by acting these scripts out, live on stage. Word for word, line for line, typo for typo, comedians, actors, and audience members pay tribute through performance, and get really, really weird. Props, costumes, everything that would make up a bad high school theater production.\r\n\r\nFirst Comes Love has been featured in the Brooklyn Comedy Festival, the NerdMelt Showroom in Los Angeles, RIOT festival in LA, COME AND TAKE IT COMEDY festival in Houston, and has been standing room only for all of its shows. A show on the rise, it has big things planned moving forward. ",
      "copy": "A few years ago, comedian and bored drunk Kyle Ayers decided to post a fake job on Craigslist, out of pure curiousity. He put an ad up, claiming to be a producer for a very prominant adult film (porn) company. &quot;Send me your best three to four page porn script. I want to find the &#039;next big thing in adult film writing.&#039; And make it weird.&quot;\r\n\r\nHe wasn&#039;t sure what to expect, but he certainly didn&#039;t expect the flood of responses. Over 1,000 responses in just under a week. Musicals, movie spoofs, personal experiences put down on pages, sex toys you&#039;ve never even heard of, everything. Over a thousand scripts and (still!) growing. After a while, Kyle decided it was time to do something with these scripts. \r\n\r\nUsing the talents of some of the best comedians around (and willing members of the audience!), First Comes Love honors this aspiring porn writers by acting these scripts out, live on stage. Word for word, line for line, typo for typo, comedians, actors, and audience members pay tribute through performance, and get really, really weird. Props, costumes, everything that would make up a bad high school theater production.\r\n\r\nFirst Comes Love has been featured in the Brooklyn Comedy Festival, the NerdMelt Showroom in Los Angeles, RIOT festival in LA, COME AND TAKE IT COMEDY festival in Houston, and has been standing room only for all of its shows. A show on the rise, it has big things planned moving forward. ",
      "pageUrl": "12450-first-comes-love",
      "iTunesUrl": ""
    },
    {
      "id": 12451,
      "events": [],
      "name": "Occasionally Awesome",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/occasionallyawesome_atccover.jpg",
      "photoUrl": "/api/img/show-images/show-occasionallyawesome-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Join Nick Youssef and Kevin Christy, two L.A natives, as they interview their comedian, actor, artist and degenerate friends in search of the parts of life that are occasionally awesome. Also they talk about jeans and Radiohead a lot.",
      "copy": "Join Nick Youssef and Kevin Christy, two L.A natives, as they interview their comedian, actor, artist and degenerate friends in search of the parts of life that are occasionally awesome. Also they talk about jeans and Radiohead a lot.",
      "pageUrl": "12451-occasionally-awesome",
      "iTunesUrl": ""
    },
    {
      "id": 12451,
      "events": [],
      "name": "Occasionally Awesome",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/occasionallyawesome_atccover.jpg",
      "photoUrl": "/api/img/show-images/show-occasionallyawesome-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Join Nick Youssef and Kevin Christy, two L.A natives, as they interview their comedian, actor, artist and degenerate friends in search of the parts of life that are occasionally awesome. Also they talk about jeans and Radiohead a lot.",
      "copy": "Join Nick Youssef and Kevin Christy, two L.A natives, as they interview their comedian, actor, artist and degenerate friends in search of the parts of life that are occasionally awesome. Also they talk about jeans and Radiohead a lot.",
      "pageUrl": "12451-occasionally-awesome",
      "iTunesUrl": ""
    },
    {
      "id": 12452,
      "events": [],
      "name": "The Hard Times Presents: All Comics Are Bastards",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/12575715_581725921975547_1534839850_n.jpg",
      "photoUrl": "/api/img/show-images/show-thehardtimespresentsallcomicsarebastards-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Known as &quot;The Onion&quot; for punk rock and hardcore kids, &quot;The Hard Times&quot; has built a substantial online following and is regularly found plastered on your facebook feed, or in links retweeted regularly by Jonah Ray...  Hosted by Hard Times co-founder and head writer Bill Conway A.C.A.B has been bringing a really unique  live show to Kickstand Comedy this year. The shows are well attended and in addition to comedy fans, they consistently bring out an audience that most comedy shows don&#039;t know how to reach. The show format includes character bits, stand ups, sketch, and A/V making a really dynamic DIY show with great energy. Plus you get to hear Jason Traeger telling old school punk stories... its a fantastic show with a great DIY vibe.",
      "copy": "The Hard Times: All Comics Are Bastards is here to bring some joy into your dark life. Known as &quot;The Onion for punk rock and hardcore kids&quot; The Hard Times has amassed a giant on-line following . Hosted by co-founder and head writer Bill Conway, A.C.A.B. brings a unique DIY show of characters, stand ups, video, and true stories from the mosh pit.  If comedy is the new punk rock The Hard Times Presents: A.C.A.B is ground zero.",
      "pageUrl": "12452-the-hard-times-presents-all-comics-are-bastards",
      "iTunesUrl": ""
    },
    {
      "id": 12452,
      "events": [],
      "name": "The Hard Times Presents: All Comics Are Bastards",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/12575715_581725921975547_1534839850_n.jpg",
      "photoUrl": "/api/img/show-images/show-thehardtimespresentsallcomicsarebastards-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Known as &quot;The Onion&quot; for punk rock and hardcore kids, &quot;The Hard Times&quot; has built a substantial online following and is regularly found plastered on your facebook feed, or in links retweeted regularly by Jonah Ray...  Hosted by Hard Times co-founder and head writer Bill Conway A.C.A.B has been bringing a really unique  live show to Kickstand Comedy this year. The shows are well attended and in addition to comedy fans, they consistently bring out an audience that most comedy shows don&#039;t know how to reach. The show format includes character bits, stand ups, sketch, and A/V making a really dynamic DIY show with great energy. Plus you get to hear Jason Traeger telling old school punk stories... its a fantastic show with a great DIY vibe.",
      "copy": "The Hard Times: All Comics Are Bastards is here to bring some joy into your dark life. Known as &quot;The Onion for punk rock and hardcore kids&quot; The Hard Times has amassed a giant on-line following . Hosted by co-founder and head writer Bill Conway, A.C.A.B. brings a unique DIY show of characters, stand ups, video, and true stories from the mosh pit.  If comedy is the new punk rock The Hard Times Presents: A.C.A.B is ground zero.",
      "pageUrl": "12452-the-hard-times-presents-all-comics-are-bastards",
      "iTunesUrl": ""
    }
  ]
}