{
  "shows": [
    {
      "id": 12487,
      "events": [],
      "name": "An Evening With Aimee Mann and Ted Leo (and Friends!)",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/aimee_ted.jpg",
      "photoUrl": "/api/img/show-images/show-aneveningwithaimeemannandtedleoandfriends-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Collectively and individually, Aimee Mann and Ted Leo have more years of musical experience under their belts than most.  You might call them “lifers.”  But they were first drawn into each others circles by the late, great Scott Miller (Game Theory/Loud Family), who brought Ted to Aimee’s awareness back in 2001. Over the years, they became friendly, getting lunch when Ted was in Los Angeles or Aimee was in New York, guesting on this or that comedy or music show together, etc., but they truly bonded over a misspelled word and a hashtag on Twitter, “#dumbie.” Their mutual appreciation of such #dumb things and increased communication (140 characters at a time) eventually lead to a tour together, which lead to spending more time with each other’s music and in each other’s company, which lead to them guesting on each other’s songs nightly on tour, and another mutual appreciation via a chance over-hearing in a hotel room in Chicago, as Aimee came to collect Ted to go get lunch again (they like lunch): early Thin Lizzy.  Inspired by the folksy but edgy rock melodicism and spooky, soulful atmosphere of songs like “Honesty is no Excuse” (which they, in fact, began covering), Aimee sent Ted the stem of a new song just one week after their first tour together had ended.  They began writing together, and “The Both” (originally called #BOTH, because it made them laugh) was born.  They completed what was first slated to be an EP over the course of the next couple of months, but growing ever closer and ever more fulfilled working together, The Both began to take shape as a real and ongoing concern, and the EP became an LP, released April 15, 2014.  They continued to tour with each of their separate concerns (though even then, mostly together) throughout the remainder of 2013, but also played shows as The Both.\r\n\r\n\r\nFor their Bridgetown performance, Aimee and Ted will welcome musician and comedian friends from the festival lineup and beyond for a can&#039;t-miss night of entertainment.",
      "copy": "An Evening With Aimee Mann and Ted Leo (and Friends!)",
      "pageUrl": "12487-an-evening-with-aimee-mann-and-ted-leo-and-friends",
      "iTunesUrl": ""
    },
    {
      "id": 12537,
      "events": [],
      "name": "An Evening with Rachel Bloom",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/rachel.png",
      "photoUrl": "/api/img/show-images/show-aneveningwithrachelbloom-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Rachel Bloom is a comedian, actress, writer and singer based in Los Angeles. She currently stars in the TV series “Crazy Ex-Girlfriend” on the CW Network and earned both a Golden Globe and Critics Choice award for her performance. She has been named a comic to watch by Cosmopolitan, Time Out LA and Backstage Magazine, and has been featured in Variety and the LA Times. Her comedic music videos have appeared on the Onion AV Club, Jezebel, Huffington Post, Buzzfeed and Cracked, among others. Her 2010 music video “Fuck Me, Ray Bradbury” won the award for “Best Music Video” at Dragon*Con and was nominated for a 2011 Hugo Award for “Best Dramatic Presentation: Short Form;” and her 2012 music video “You Can Touch My Boobies” won the LA Weekly Web Award for Best Youtube Song. She has also released two albums: “Please Love Me” (a compilation of old/new hits) and “Suck It, Christmas!!! (A Chanukah Album).” Her recent live performance credits include Just for Laughs in Montreal, Fun Fun Fun Fest, the Arlington Drafthouse and The Limestone Comedy Festival.\r\n \r\nRachel developed and starred in a musical pilot for Showtime called “Crazy Ex-Girlfriend,” co-written with Aline Brosh McKenna and directed by Marc Webb. The series was eventually picked up by the CW Network. Her other television writing credits include “Robot Chicken,” “Allen Gregory,” The People’s Choice Awards, and “The High Fructose Adventures of Annoying Orange.” Her acting work includes roles on “How I Met Your Mother,” “Robot Chicken,” The Yahoo! webseries “The Fuzz”  and the CW webseries “Gallery Mallory.” She has written and starred in two live musical sketch comedy shows at the Upright Citizens Brigade Theater in LA and New York: “Rachel Bloom is a Triple Threat!!!” and “Sing Out, Louise!”\r\n\r\nRachel graduated from NYU, Tisch School of the Arts in 2009 with a BFA in Theater.  At NYU, she studied with the CAP 21 musical theater studio, Experimental Theater Wing, and International Theater Workshop in Amsterdam. She was also a writer, performer and director for the college sketch group HammerkatzNYU.",
      "copy": "Rachel Bloom is a comedian, actress, writer and singer based in Los Angeles. She currently stars in the TV series “Crazy Ex-Girlfriend” on the CW Network and earned both a Golden Globe and Critics Choice award for her performance. She has been named a comic to watch by Cosmopolitan, Time Out LA and Backstage Magazine, and has been featured in Variety and the LA Times. Her comedic music videos have appeared on the Onion AV Club, Jezebel, Huffington Post, Buzzfeed and Cracked, among others. Her 2010 music video “Fuck Me, Ray Bradbury” won the award for “Best Music Video” at Dragon*Con and was nominated for a 2011 Hugo Award for “Best Dramatic Presentation: Short Form;” and her 2012 music video “You Can Touch My Boobies” won the LA Weekly Web Award for Best Youtube Song. She has also released two albums: “Please Love Me” (a compilation of old/new hits) and “Suck It, Christmas!!! (A Chanukah Album).” Her recent live performance credits include Just for Laughs in Montreal, Fun Fun Fun Fest, the Arlington Drafthouse and The Limestone Comedy Festival.\r\n \r\nRachel developed and starred in a musical pilot for Showtime called “Crazy Ex-Girlfriend,” co-written with Aline Brosh McKenna and directed by Marc Webb. The series was eventually picked up by the CW Network. Her other television writing credits include “Robot Chicken,” “Allen Gregory,” The People’s Choice Awards, and “The High Fructose Adventures of Annoying Orange.” Her acting work includes roles on “How I Met Your Mother,” “Robot Chicken,” The Yahoo! webseries “The Fuzz”  and the CW webseries “Gallery Mallory.” She has written and starred in two live musical sketch comedy shows at the Upright Citizens Brigade Theater in LA and New York: “Rachel Bloom is a Triple Threat!!!” and “Sing Out, Louise!”\r\n\r\nRachel graduated from NYU, Tisch School of the Arts in 2009 with a BFA in Theater.  At NYU, she studied with the CAP 21 musical theater studio, Experimental Theater Wing, and International Theater Workshop in Amsterdam. She was also a writer, performer and director for the college sketch group HammerkatzNYU.",
      "pageUrl": "12537-an-evening-with-rachel-bloom",
      "iTunesUrl": ""
    },
    {
      "id": 12470,
      "events": [],
      "name": "Theme Park Improv",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/themepark.jpg",
      "photoUrl": "/api/img/show-images/show-themeparkimprov-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Theme Park brings together an all-star lineup of comedy heavyweights for a long-form improv extravaganza! For its 2016 Bridgetown edition, Theme Park includes Rachel Dratch (SNL, 30 Rock), John Michael Higgins (Best In Show, Arrested Development), Oscar Nuñez (The Office), Janet Varney (You&#039;re The Worst, The Legend of Korra), Jessica Makinson (South Park, Maron), Cole Stratton (RiffTrax, Pop My Culture) and surprise guests.",
      "copy": "The Theme Park Improv Show&#039;s improvisers take a single suggestion of a theme from the audience, and wing an entire set of fast-paced long-form scenes and characters, based on stories from a special guest monologist. After a few years absence, they return to Bridgetown with a stellar lineup: Rachel Dratch (&quot;Saturday Night Live&quot;),  John Michael Higgins (&quot;A Mighty Wind&quot;),  Jessica Makinson (&quot;Halfway Home&quot;), Oscar Nunez (&quot;The Office&quot;) Cole Stratton (&quot;Pop My Culture Podcast&quot;) and Janet Varney (&quot;Burning Love&quot;). ",
      "pageUrl": "12470-theme-park-improv",
      "iTunesUrl": ""
    },
    {
      "id": 12492,
      "events": [],
      "name": "Baked",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/baked_square.jpg",
      "photoUrl": "/api/img/show-images/show-baked-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Baked is an evening of music and comedy hosted by Brendon Small (Metalocalypse, Home Movies) and Steve Agee (The Sarah Silverman Program, New Girl, Adventure Time) and an incredibly talented band including Joe Travers (Zappa Plays Zappa, Mike Keneally Band), Pete Griffin (Zappa Plays Zappa, Dethklok), and Mike Keneally (Mike Keneally Band)*. After a yearlong residency at LA&#039;s world famous jazz club The Baked Potato, Baked travels north to force its musical and comedic ethos onto the inhabitants of Portland and ultimately destroy their brains. Join us for a show in which comics are encouraged to perform in a musical capacity after a set of standup comedy. *Band lineup subject to change",
      "copy": "",
      "pageUrl": "12492-baked",
      "iTunesUrl": ""
    },
    {
      "id": 11725,
      "events": [],
      "name": "Guy Branum&#039;s Gay Bash",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/gaybash.jpg",
      "photoUrl": "/api/img/show-images/show-guybranum039sgaybash-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Guy gathers all his favorite LGBT comedians performing at this year’s festival for one big gay bash! ",
      "copy": "",
      "pageUrl": "11725-guy-branums-gay-bash",
      "iTunesUrl": ""
    },
    {
      "id": 12399,
      "events": [],
      "name": "Yo, Is This Racist? LIVE PODCAST",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/yo_logo.jpg",
      "photoUrl": "/api/img/show-images/show-yoisthisracistlivepodcast-300x300.jpg",
      "sortOrder": 9999,
      "bio": "The Yo, Is This Racist? Podcast is a daily podcast offshoot of the blog of the same name, with the very simple premise: Ask host Andrew Ti if something is racist, and he&#039;ll tell you. The podcast typically has a writer/comedian guest and Andrew, taking a call-in question from a fan about any and all aspects of racism, or potential racism, in pop culture, politics, the Internet, and sometimes, just from some asshole at work. The tone of the show is as light as the subject matter allows funny people time to address serious issues in a way that doesn&#039;t need to be preachy or pedantic, and can be fun.\r\n\r\n",
      "copy": "Yo, Is This Racist? is the podcast that provides a much needed service: Ask them if something is racist, and they&#039;ll tell you. Join host Andrew Ti and guests, as they answer your burning questions about anything you think might be racist, from politics, TV, movies, the Internet, your racist-ass grandma, anything. GUARANTEE: WE WILL SOLVE RACISM AT THIS SHOW",
      "pageUrl": "12399-yo-is-this-racist-live-podcast",
      "iTunesUrl": ""
    },
    {
      "id": 12445,
      "events": [],
      "name": "The Crabfeast with Ryan Sickler and Jay Larson",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/crabfeast_atccover.jpg",
      "photoUrl": "/api/img/show-images/show-thecrabfeastwithryansicklerandjaylarson-300x300.jpg",
      "sortOrder": 9999,
      "bio": "The Crabfeast is a conversational and storytelling podcast hosted by Jay Larson and Ryan Sickler. Our unique combination of comradery, storytelling, comedic wit and lives lived full make for an amazing podcast experience.",
      "copy": "The Crabfeast is a conversational and storytelling podcast hosted by Jay Larson and Ryan Sickler. Their podcast comes out every Toozdee on the All Things Comedy Network, and has featured guests such as Jay Mohr, Pete Holmes, Hannibal Buress, etc. They’ve been featured at SXSW, Riot LA, Bridgetown Comedy Festival, SF Sketchfest, The Pete Holmes Show on TBS and the Damon Bruce National Radio Show. Each month they host a live podcast at the Improv Lab. Jay and Ryan’s unique combination of comradery, storytelling, comedic wit and lives lived full make for an amazing podcast experience.",
      "pageUrl": "12445-the-crabfeast-with-ryan-sickler-and-jay-larson",
      "iTunesUrl": ""
    },
    {
      "id": 12530,
      "events": [],
      "name": "Julian Loves Music",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/jlm.jpg",
      "photoUrl": "/api/img/show-images/show-julianlovesmusic-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Host Julian McCullough has spun off the hugely popular Doug Loves Movies podcast and made Julian Loves Music. The live podcast taping will feature hilarious comedian and musician guests as well as dumb games and a prize bag for one lucky audience member. ",
      "copy": "Host Julian McCullough has spun off the hugely popular Doug Loves Movies podcast and made Julian Loves Music. The live podcast taping will feature hilarious comedian and musician guests as well as dumb games and a prize bag for one lucky audience member. If you plan on coming, make yourself a name tag out of an iconic album cover and you could be that lucky gal or fella!",
      "pageUrl": "12530-julian-loves-music",
      "iTunesUrl": ""
    },
    {
      "id": 12539,
      "events": [],
      "name": "Probably Science",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/probsci.jpeg",
      "photoUrl": "/api/img/show-images/show-probablyscience-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Three professional comedians/incompetent scientists take you through this week in science. Incompetently. Featuring Matt Kirshen, Andy Wood, Jesse Case and special guests from the word of comedy, and occasionally science.",
      "copy": "Three professional comedians/incompetent scientists take you through this week in science. Incompetently. Featuring Matt Kirshen, Andy Wood, Jesse Case and special guests from the word of comedy, and occasionally science.",
      "pageUrl": "12539-probably-science",
      "iTunesUrl": ""
    },
    {
      "id": 11550,
      "events": [],
      "name": "Joke Thieves",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/jt_newlogo_web.png",
      "photoUrl": "/api/img/show-images/show-jokethieves-300x300.jpg",
      "sortOrder": 9999,
      "bio": "It&#039;s Comedy Set Swapping LIVE!   The show where comedians perform their own jokes, then each others&#039;.   Will it be a car crash or an improv masterclass?   The fun is in the finding out.\r\n\r\nThe show has enjoyed three sell-out runs at the Edinburgh Fringe (2013 - 2015), regular packed houses at it&#039;s U.K. comedy club residencies (Downstairs @ The King&#039;s Head, London &amp; The Stand, Edinburgh) and huge successes overseas in Singapore, Hong Kong, Australia, Norway, Iceland, Austria and the U.S. The format is currently being adapted for television by the team at the Comedy Unit (part of Zodiac Media) and has been made into a BBC2 television pilot in the U.K. Outside of the U.K. the show is being developed in conjunction with ICM Partners.\r\n\r\nHere&#039;s some of our press/accolades over the last couple of years:\r\n\r\nWINNER: Chortle Award for Best Club Show 2015 - London\r\nSHORTLISTED: TOP 5 Comedy Shows of 2014 (The List)\r\nCritics Choice &amp; TOP 10 late nights out at the fringe (Time Out London)\r\nCritics Choice (Time Out New York)\r\nCritics Pick (New York Times)\r\n\r\n&#039;One of the most eye-opening hours I&#039;ve spent at the fringe ... a brilliant format&#039; (Brian Logan, The Guardian, UK)\r\n&#039;It&#039;s a comedians&#039; in-joke that everyone in the room can enjoy&#039; (Alice Jones, The Independent, UK)\r\n&#039;Spontaneous and anarchic, Joke Thieves is a unique, thoroughly enjoyable hour of mischief&#039; (Jay Richardson, Fest Magazine, UK)\r\n&#039;See comics deconstructing each other&#039;s acts ... and you have a truly electric night&#039; (Brian Donaldson, The Scotsman, UK)\r\n&#039;An undoubted hit ... the birth of a new cult comedy night&#039; (Steve Bennett, Editor of chortle.co.uk, UK)\r\n&#039;One of the best live shows we&#039;ve seen ... it&#039;s ace!&#039; (Mark Boosey, Editor of British Comedy Guide, UK)\r\n\r\n",
      "copy": "It&#039;s comedy set swapping live! The show where comedians perform their own jokes, then each other&#039;s. Best comedy club show – London 2015 (Chortle Awards). Top five comedy shows of 2014 (List, UK). Top 10 late nights out at the Fringe (Time Out). &#039;A brilliant format&#039; (Guardian, UK). &#039;Birth of a new cult comedy night ... an undoubted hit&#039; (Chortle.co.uk). &#039;Spontaneous and anarchic&#039; **** (Fest, UK). &#039;A truly electric night&#039; **** (Scotsman, UK). &#039;Action-packed and chaotic&#039; **** (BroadwayBaby.co.uk). &#039;Deserves more than one visit&#039; **** (One4Review.co.uk). As heard on BBC Radio 4 Extra&#039;s Comedy Club and recently made into a BBC2 television pilot in the U.K.",
      "pageUrl": "11550-joke-thieves",
      "iTunesUrl": ""
    },
    {
      "id": 12463,
      "events": [],
      "name": "Nato Green Presents: Laughter Against the Machine",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/latm.png",
      "photoUrl": "/api/img/show-images/show-natogreenpresentslaughteragainstthemachine-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Laughter Against the Machine launched in 2008 in San Francisco by Nato Green &amp; W. Kamau Bell. It explodes the concept of political comedy, offering a show where the comedians and the audience to expect to be challenged, to laugh, and think at the same time. It&#039;s an issue-oriented, no-holds-bar show with no preconceived expectations, no party lines, and certainly no cheerleading - showcasing comics who have beef with everybody, including themselves.\r\n\r\nOver the years, LATM has toured nationally, and featured such comedians as Margaret Cho, Janine Brito, Jimmy Dore, Hari Kondabolu, Aparna Nancherla, Hasan Minhaj, Maria Bamford, Moshe Kasher, Will Durst, Baratunde Thurston, Emily Heller, Marcella Arguello, and more. \r\n\r\nWelcome to Laughter Against The Machine: Guerrilla Stand-up Comedy.",
      "copy": "",
      "pageUrl": "12463-nato-green-presents-laughter-against-the-machine",
      "iTunesUrl": ""
    },
    {
      "id": 12462,
      "events": [],
      "name": "Persona!",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/personalogo.jpg",
      "photoUrl": "/api/img/show-images/show-persona-300x300.jpg",
      "sortOrder": 9999,
      "bio": "The country’s finest stand-up comedians are invited to perform as their funniest characters in a show called by Laughspin Magazine, &quot;A total riot” and ”a stand out,&quot; at the Bridgetown Comedy Festival. The show features the many faces of Tony Sam as host.\r\n ",
      "copy": "",
      "pageUrl": "12462-persona",
      "iTunesUrl": ""
    },
    {
      "id": 12359,
      "events": [],
      "name": "Uncalled Four",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/facebook-logo-full.jpg",
      "photoUrl": "/api/img/show-images/show-uncalledfour-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Uncalled Four is one of the best interactive shows in the country, with fest attendees contributing, voting, and winning prizes. We also highlight the city we&#039;re in, soliciting local businesses for quirky and awesome prizes, trying to find the &quot;weird&quot; where you live. But above all that, it&#039;s the comics who love doing the show. Competition brings out the best in them. In short, it&#039;s a fun and dirty comedy game show where everyone wins.",
      "copy": "Half stand up, half game show, Uncalled Four is an interactive crowd experience. Comedians write a deck of 20 terrible/hilarious answers to audience questions like &quot;What does Trump&#039;s hair smell like?&quot; or &quot;Dad went out to buy _____ and never came back.&quot; Comedians each submit a card while we give out a prize each round, then fan reaction determines the winner. After 30 minutes, comics can wager points in the final &quot;Degenerate Gambler&quot; round to see who will be The Worst Person.",
      "pageUrl": "12359-uncalled-four",
      "iTunesUrl": ""
    },
    {
      "id": 12151,
      "events": [],
      "name": "You Had to Be There",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/you_had_to_be_there_promo_pic.jpg",
      "photoUrl": "/api/img/show-images/show-youhadtobethere-300x300.jpg",
      "sortOrder": 9999,
      "bio": "The simple explanation of &quot;You Had to Be There&quot; is that each performer does their set on stage for the audience AND for a random person on the internet via the webcam chat program Omegle. It&#039;s a simple idea, but it&#039;s the strangers who pop up on screen who really make the show. It&#039;s called &quot;You Had to Be There&quot; because the individuals and personalities who consistently &quot;arrive&quot; from wherever they are in the world tend to be the most interesting and bizarre weirdos you could ever hope for in the name of entertainment. You have to see it to believe it. \r\n\r\n&quot;You Had to Be There&quot; is very much a group experience because of the audience&#039;s inherent desire to participate in something so strange and transient. This community aspect of the show (if the performer invites it) always enhances the fun. It fosters a kind of team environment where the performer and audience are together meeting a new person who they have a limited time to figure out and try to make their friend.\r\n\r\nHere&#039;s a list of memorable interactions from previous shows:\r\n1. A 17-year-old kid was asked randomly if he played guitar. As if from nowhere, he produced an already plugged-in Gretsch that was sitting at his feet. He was then asked if he could play Crazy Train and he instantly started shredding the song and the entire audience sang along. After playing, he said, &quot;Wow, I&#039;m 17 and just got to play for a bar of 50 people in Omaha that I wouldn&#039;t have been allowed in otherwise. Thank you so much. You made my night.&quot; It was magical. It’s a comedy show, but it&#039;s also really uplifting at times and that&#039;s another reason why I love it.\r\n2. Another time, a comedian was telling his jokes to a man on screen and one of his jokes was about purchasing tombstones. The man on screen reaches down m- again as if fro out of nowhere - and pulls out a miniature coffin. Turns out, one of his hobbies is whittling small coffins. The audience lost it. The very next joke was about leather fetishism. The man - once again from out of nowhere - reached down and pulled out his leather whip and proceeded to grab his webcam to show the audience a hole in his wall that he made the other night from &quot;fucking too hard.&quot; Again, the audience lost their minds.\r\n3. Juggalo art show. No explanation needed.\r\n",
      "copy": "Q: What is this?\r\nA: You Had to Be There is a live stand-up comedy show where comedians perform on stage in front of a live audience as well as a random/live/interactive internet audience on Omegle.com.\r\n\r\nQ: Will there be nudity like on literally every other web chat service?\r\nA: Nudity is a possibility, which is why this show is only for adults who can handle that sort of thing. If a naked person happens to show up on screen, we&#039;ll make a joke about it and move on with our lives.\r\n\r\nQ: Why should I go?\r\nA: If you like shared experiences that involve laughter and fun and don&#039;t mind watching unique shows where magical things happen, then you should definitely check it out. Omegle chats lead to interactions with diverse and interesting characters from all around the globe. You never know who will come on the screen next and that is hopefully not an innuendo.\r\n\r\nThe stories people walk away with after this show are often incredible and sometimes plain unbelievable. Whether it&#039;s a foster kid shredding Crazy Train, a Juggalo art show, or a freestyle rapper who whittles miniature coffins, the things you&#039;ll see on this show are guaranteed to surprise and amaze. If you find yourself having trouble conveying to your friends how crazy this show really is, remember just to tell them: You Had to Be There.",
      "pageUrl": "12151-you-had-to-be-there",
      "iTunesUrl": ""
    },
    {
      "id": 12118,
      "events": [],
      "name": "Unsafe Space",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/immigration-unsafespace-shot.jpg",
      "photoUrl": "/api/img/show-images/show-unsafespace-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Comedians do standup on controversial topics, followed by a response by experts and a discussion with the audience.\r\n\r\nIt&#039;s an environment where people of different views can be outspoken but respectful and the humor makes it a fun experience for everyone. We started the show amidst debate about the free speech of comedians vs. the right of the audience to respond to things they disagreed with. We want to bring everyone into the same room instead of talking past each other online. We want comedians to be able to say whatever they want on hot-button issues, and experts and the audience free to voice their opinions as well, with the result of a fun, stimulating and real conversation.\r\n\r\nExample shows:\r\n\r\n* Islam, featuring Jihad Turk (president of President of Bayan Claremont Islamic Graduate School), Heina Dadabhoy (ex-Muslim blogger), Mitch Burrow (comedian and USMC veteran), and Aron Kader (comedian from the &quot;Axis of Evil&quot; comedy tour).\r\n* Guns, featuring Joshua Stepakoff (Board member of Women Against Gun Violence and mass shooting survivor), Adam Winkler (UCLA Constitutional Law professor), Ed Greer (Comedian and former NRA member) and Katie Massa Kennedy (writer for the Queen Latifah show and activist).\r\n\r\nThe show is recorded as a podcast and hosted by Lou Perez and Toby Muresianu.\r\n",
      "copy": "Comedians do standup on controversial topics, followed by a response by experts and a discussion with the audience.\r\n\r\nEach show has a different theme - from policing to political correctness to feminism - and a panel of people who work in the field and comedians with personal perspectives.\r\n\r\nHosted by comedians Toby Muresianu and Lou Perez and recorded as a podcast.\r\n\r\n",
      "pageUrl": "12118-unsafe-space",
      "iTunesUrl": ""
    },
    {
      "id": 11841,
      "events": [],
      "name": "Earthquake Hurricane",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/web-header.png",
      "photoUrl": "/api/img/show-images/show-earthquakehurricane-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Four of Portland&#039;s best comics put on one of Portland&#039;s best shows every week. It&#039;s a standup show with a strong emphasis on group hosting, starting with a group riff at the top and bottom of the show, and audience participation during those sessions. Oh yeah, and we&#039;re in a bike shop / bar which is the most Portland thing ever.\r\n\r\nIn the year since we started we&#039;ve become a staple of the Portland scene including Willamette Week&#039;s pick for best comedy show, Portland Mercury picks, and a feature in The Portland Monthly.",
      "copy": "Earthquake Hurricane is a powerhouse comedy show hosted by four of Portland&#039;s comics: Bri Pruett (WW Funniest 5), Curtis Cook (Vice TV), Alex Falcone (Portlandia) and Anthony Lopez (Bridgetown vet). Run out of a bike shop / bar (because Portland), EQH has quickly established itself as the place to see top-tier comedy in Portland. Willamette Week&#039;s pick for best comedy show 2015, plus featured in great write-ups from the Portland Mercury, Paste Magazine, and The Portland Monthly.",
      "pageUrl": "11841-earthquake-hurricane",
      "iTunesUrl": ""
    },
    {
      "id": 11165,
      "events": [],
      "name": "Stand Up For Yourself! With Amy Miller",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/amylogobordermedium.jpg",
      "photoUrl": "/api/img/show-images/show-standupforyourselfwithamymiller-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Stand Up For Yourself! is a hybrid stand-up comedy, therapy, and morning talk show. The show began last year at Helium Comedy Club and was an instant success! It&#039;s a combination of laughs, and real talk + hilarious and revealing games, audience participation, and general humiliation. As a person obsessed with talk shows in the vein of Wendy Williams, Steve Harvey, and other shows hosted by someone with no official therapy training just doling out love and life advice to broken people, I thought...what people are more broken then comics? The show and hosting style allow a comfortable space for comics to do their regular set, and then sit down reveal some of their deepest secrets. In shows past, we&#039;ve had guests admit to a range of life events all the way from butt stuff to cancer diagnoses to suicidal thoughts to molestation to being completely clueless about love. And somehow we manage to keep it funny.\r\n\r\nAudience members love it, as they&#039;re encouraged to ask questions, ask for life advice, and try to help the comics. They&#039;re also encouraged to participate in a regular call and response of the show title with the host. \r\n&quot;STAND UP&quot;\r\n&quot;FOR YOURSELF!&quot;\r\n\r\nSome popular past segments:\r\n\r\n- &quot;Gettin&#039; Posi with Pasi&quot; - a regular segment in which Portland comic Adam Pasi compliments as many people in the room as he can in 2 minutes. Makes people feel so good!\r\n- Blind Leading the Blind - This is when a comic with a terrible relationship history gives love advice to people in the crowd\r\n- &quot;Eli-ke or E-don&#039;t like it&quot; - A segment with bi-racial Portland comedian Jeremy Eli in which I projected things that are stereotypically enjoyed by either white people or black people, and made him choose\r\n- A Walk in the Woods - Comic and Audience are led into an extended psychological test (lights down, Enya playing) many of us took at 5th grade slumber parties\r\n\r\nI&#039;d love to try this format with comics I only know a little bit about, as I think the unfamiliarity would lend itself to even more ridiculous findings.\r\n\r\nOh, and there is a plant. And a producer on a god mic à la Gelman or Letterman Liz. It&#039;s so fun!",
      "copy": "After seeing a stand-up comedy show, did you ever leave asking yourself &quot;What is wrong with these people?&quot; Equal parts &quot;Iyanla: Fix My Life&quot; and &quot;Between Two Ferns,&quot; Stand-Up For Yourself is the first hybrid stand-up comedy and therapy morning talk show that happens at night. Your favorite comics do their material and then sit down for some tough love interviews, games, and audience interactions.\r\n\r\nBring your own questions! Make them as personal as you want, I don&#039;t care! Audience participation encouraged. Prizes! Surprise guests! Games! Maybe some tears! People will laugh. \r\n\r\nLives will be changed. Comics will get fixed.\r\n\r\nHosted by the modern day Dr. Shirley, Amy Miller!\r\n",
      "pageUrl": "11165-stand-up-for-yourself-with-amy-miller",
      "iTunesUrl": ""
    },
    {
      "id": 12476,
      "events": [],
      "name": "Rants Off/ Dance Off",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/rodo_logo_square.jpg",
      "photoUrl": "/api/img/show-images/show-rantsoffdanceoff-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Rants Off / Dance Off is a comedy game show where comedians compete in a battle of wits and moves! Contestants offer their heated opinions on subjects--some prepared, some improvised--and then, like ice cream to a hot pepper so foolishly eaten whole, sooth their raw nerves by dancing to music they may or may not know. Judgement is summarily doled out panel-style. Winners receive little but pride and regrets. Great fun is had by all.\r\nRants Off / Dance Off has been a part of Portland&#039;s Bridgetown Comedy Festival and All Jane Comedy Festival, as well as Bumbershoot in Seattle. Hosted by Whitney Streed.",
      "copy": "Rants Off / Dance Off is a comedy game show where comedians compete in a battle of wits and moves! Contestants offer their heated opinions on subjects--some prepared, some improvised--and then, like ice cream to a hot pepper so foolishly eaten whole, sooth their raw nerves by dancing to music they may or may not know. Judgement is summarily doled out panel-style. Winners receive little but pride and regrets. Great fun is had by all.\r\nRants Off / Dance Off has been a part of Portland&#039;s Bridgetown Comedy Festival and All Jane Comedy Festival, as well as Bumbershoot in Seattle. Hosted by Whitney Streed.",
      "pageUrl": "12476-rants-off-dance-off",
      "iTunesUrl": ""
    },
    {
      "id": 12464,
      "events": [],
      "name": "It&#039;s Going to Be Okay",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/okay.jpg",
      "photoUrl": "/api/img/show-images/show-it039sgoingtobeokay-300x300.jpg",
      "sortOrder": 9999,
      "bio": "It&#039;s Gonna Be Okay is free WEEKLY stand up comedy show EVERY Monday. The show showcases the best comedians in Portland along with some travelling national comics. The show is always fun, smart, geeky, quirky, feminist, progressive, and unique and is a special love letter to Portland&#039;s wonderful budding hotbed of alternative comedy sweethearts, hosted by Barbara Holm",
      "copy": "It&#039;s Gonna Be Okay is free WEEKLY stand up comedy show EVERY Monday. The show showcases the best comedians in Portland along with some travelling national comics. The show is always fun, smart, geeky, quirky, feminist, progressive, and unique and is a special love letter to Portland&#039;s wonderful budding hotbed of alternative comedy sweethearts, hosted by Barbara Holm",
      "pageUrl": "12464-its-going-to-be-okay",
      "iTunesUrl": ""
    },
    {
      "id": 12528,
      "events": [],
      "name": "The Liberators present Mood Music",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/1511213_10152473035432787_902461193_n.jpg",
      "photoUrl": "/api/img/show-images/show-theliberatorspresentmoodmusic-300x300.jpg",
      "sortOrder": 9999,
      "bio": "This is an improv comedy show that uses the audience members&#039; personal playlists on their portable music devices as a soundtrack to the show. A DJ collects their devices before the show, mines them for music during the show, then returns them after the show. The DJ plays songs from the playlist which inspires improv scenes, or highlights the scenes. \r\n\r\nThere are 4 members of The Liberators, but we would LOVE to include guest improvisers from the festival.\r\nThe main improv troupe will be: The Liberators.\r\nThe Liberators have been described as &quot;one of the best improv troupes anywhere&quot; (Portland Mercury) and have been bringing their signature brand of sexysmart improv comedy to Portland and beyond for over 10 years. \r\nThe LIberators are\r\nShelley McLendon (Owner: Siren Theater and  Bad Reputation Productions)\r\nJohn Breen (Upright Citizens Brigade)\r\nNicholas Kessler ( The Moth- Portland, Portland Center Stage)\r\nTony Marcellino (Bad Reputation Productions, The 3rd Floor)\r\n\r\n",
      "copy": "The Liberators present Mood Music\r\nThe Liberators have been described as &quot;one of the best improv troupes anywhere&quot; (Portland Mercury) and have been bringing their signature brand of sexysmart improv comedy to Portland and beyond for over 10 years. Tonight, they will be rocking their crowd favorite show- Mood Music: YOU let us borrow your portable musical device (Iphone, Ipod, MP3 player) and we mine your personal playlist for music that serves as the soundtrack to The Liberators&#039; improv. With guest DJ Beau Brousseau!",
      "pageUrl": "12528-the-liberators-present-mood-music",
      "iTunesUrl": ""
    },
    {
      "id": 12529,
      "events": [],
      "name": "Leviathan",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/leviathan.jpg",
      "photoUrl": "/api/img/show-images/show-leviathan-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Leviathan is storytelling + improv\r\nThis is basically the improv format called the Armando: a group of improvisers do scenes based on personal stories told by a person of note. The improvisers would be mostly made up of the Siren Theater house team of improvisers, but we would love to include other improvisers from the festival. We would also love to ask other festival performers to be the storytellers.  There are typically 1-2 storytellers per show)",
      "copy": "Leviathan- improv + storytelling\r\nTake the best improv comedians from Portland, Oregon and beyond, provide them with personal stories told on the spot by a person of note, let them improvise scenes based on these stories, and you have Leviathan.",
      "pageUrl": "12529-leviathan",
      "iTunesUrl": ""
    },
    {
      "id": 11676,
      "events": [],
      "name": "Reading The Bible With Dan Live",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/bible.png",
      "photoUrl": "/api/img/show-images/show-readingthebiblewithdanlive-300x300.jpg",
      "sortOrder": 9999,
      "bio": "In Reading the Bible With Dan Live, Dan Weber and his comedy writing partner “The Bible” and his co-host Nariko Ott dissect the most popular stories found in the wacky insanity that is America&#039;s Most Revered Book. We read stories such as Adam and Eve getting thrown out of the garden of Eden; Noah&#039;s Ark and the flood; Cain and Abel; Jacob tricking Issac to become the father of the nation of Israel, and the destruction of Sodom and Gomorrah.  Joining them is a rotating panel of comics who comment on each and every crazy thing read. \r\n\r\nPanelists have included Amy Miller, Christian Ricketts, Whitney Streed and Kristine Levine.\r\n\r\nMusical accompaniment provided by Ira Novos.\r\n\r\nIt&#039;s slightly informative and super hilarious.\r\n\r\nAdditionally, the live show has a drinking game named &quot;Behold!&quot; Every time that word is used in the Bible, the audience takes a drink. This happens way more than it really should.\r\n\r\nThere really isn&#039;t anything else like it.\r\n\r\nFor the Bridgetown show we would read about the destruction of Sodom and Gomorrah because that story is absolutely insane.",
      "copy": "Reading the Bible with Dan Live, a show where a collection of very funny people read, then mock, America&#039;s Most Revered Book.",
      "pageUrl": "11676-reading-the-bible-with-dan-live",
      "iTunesUrl": ""
    },
    {
      "id": 12546,
      "events": [],
      "name": "Competitive Erotic Fan Fiction",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/ceff_2015_generic.jpg",
      "photoUrl": "/api/img/show-images/show-competitiveeroticfanfiction-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Competitive Erotic Fan Fiction with Bryan Cook is a live show and popular podcast on the Nerdist Network. It has been recognized as one of the top shows in LA by LA Weekly and listed in the Top 20 Comedy Podcasts by Rolling Stone. The LA show, held every month at the Virgil, recently celebrated its third anniversary. Each show features two rounds of comics, writing and performing Erotic Fan Fiction pieces, based upon their whims or audience suggestions. It’s really stupid.",
      "copy": "",
      "pageUrl": "12546-competitive-erotic-fan-fiction",
      "iTunesUrl": ""
    },
    {
      "id": 12547,
      "events": [],
      "name": "Reunited",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/reunited.png",
      "photoUrl": "/api/img/show-images/show-reunited-300x300.jpg",
      "sortOrder": 9999,
      "bio": "REUNITED! Brings together the casts of beloved sitcoms for in-depth panel discussions, Q &amp; A sessions, and table-reads of classic scenes.\r\n \r\nThe catch? The shows never existed, except in the minds of hosts/show-creators Josh Androsky (Spongebob Square Pants) and Bryan Cook (Competitive Erotic Fan Fiction.) Oh, and none of the guests have any prior knowledge of the series they supposedly “starred on.”\r\n",
      "copy": "",
      "pageUrl": "12547-reunited",
      "iTunesUrl": ""
    },
    {
      "id": 12550,
      "events": [],
      "name": "Lance Bangs Presents: Come Laugh with Us",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/cmwu_2016.jpg",
      "photoUrl": "/api/img/show-images/show-lancebangspresentscomelaughwithus-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Filmmaker Lance Bangs presents some of his favorite comedians and screens special footage from his personal archives.",
      "copy": "",
      "pageUrl": "12550-lance-bangs-presents-come-laugh-with-us",
      "iTunesUrl": ""
    },
    {
      "id": 12552,
      "events": [],
      "name": "Pep Talks Podcast",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/peptalks_atccover4.jpg",
      "photoUrl": "/api/img/show-images/show-peptalkspodcast-300x300.jpg",
      "sortOrder": 9999,
      "bio": "A comedic look at our crumbling world with Eddie Pepitone and other funny people.",
      "copy": "",
      "pageUrl": "12552-pep-talks-podcast",
      "iTunesUrl": ""
    },
    {
      "id": 12553,
      "events": [],
      "name": "Eddie Pepitone&#039;s Bloodbath",
      "originalPhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/show-submissions/pepitoneblood.jpg",
      "photoUrl": "/api/img/show-images/show-eddiepepitone039sbloodbath-300x300.jpg",
      "sortOrder": 9999,
      "bio": "Eddie Pepitone sets the tone with his latest rant on our descent into madness as a society, and then his friends do their most scathing and dark standup material.",
      "copy": "",
      "pageUrl": "12553-eddie-pepitones-bloodbath",
      "iTunesUrl": ""
    }
  ]
}