[
 {
  "Name": "Sean Cullen",
  "Bio": "<p>Expect the unexpected with Seán Cullen, a nimble master of improvisation and accomplished impressionist who delights in the absurd. The 25-year veteran of the Canadian comedy scene is an award-winning comedian, actor and writer.</p>\n<p>Cullen has made multiple appearances on The Tonight Show with Jay Leno (NBC) and The Late Late Show (CBS). He was a finalist in the sixth season of Last Comic Standing (NBC) and was a regular on The Ellen Degeneres Show (CBS). He starred in his own television series The Seán Cullen Show (CBC), also serving as creator, executive producer and writer on the series. He hosted Just For Laughs 20th Anniversary and the travel series What Were They Thinking? (Discovery), earning Gemini Awards for each. He has had several specials including Comedy Central Presents, the Gemini-nominated Comedy Now! special titled Seán Cullen: Wood, Cheese &amp; Children! and Seán Cullen’s Home for Christmas (CBC) and COMICS!. He has made multiple appearances on Just For Laughs (CBC) earning him a Gemini Award-Best Performance-Variety-Series.</p>\n<p>His feature film credits include Atom Egoyan’s Where the Truth Lies, Mike Myers’ The Love Guru and Phil The Alien, earning him a Canadian Comedy Award, Best Male Performance-Film.</p>\n<p>Cullen monthly podcast The Seanpod was nominated for a 2012 Canadian Comedy Award for Best Podcast and is available on Apple iTunes. He has leant his voice to a number animated series such as: Jimmy Two-Shoes (Teletoon/Disney XD) earning two Gemini-nominations and Rocket Monkeys (Teletoon).</p>\n<p>Cullen performs live on stage Canada, including Just For Laughs in Montreal/Toronto, and has appeared as far afield as the Melbourne Comedy Festival and Edinburgh Fringe. </p>\n<p>A prolific writer, he is the author of five popular young adult novels and is beginning to write a sixth new book. His first novel Hamish X and the Cheese Pirates won a Rocky Mountain Book Award and an Arthur Ellis Award and his book The Prince of Neither Here Nor There was nominated for a 2010 Toronto Book Award. He has written many television comedies and animated series, select credits include The Seán Cullen Show (CBC), Seán Cullen’s Home for Christmas (CBC), Seán Cullen: Wood, Cheese &amp; Children! (CTV/The Comedy Network) and more recently, Camp Lakebottom and Rocket Monkeys, premiering on Teletoon in fall 2012. He has also written and performed songs for A Wrinkle in Time (ABC), Just For Laughs 20th Anniversary (CBC), The Gemini Awards (CBC) and the Star TV Theme Song (Star TV, CityTV).</p>\n<p>Cullen has released two comedy albums, Seán Cullen Live! and I Am a Human Man are available on Apple iTunes.</p>\n<p>Described in Time Magazine as “the vanguard of comedy&#039;s next generation”, Cullen has earned three Gemini Awards, three Canadian Comedy Awards, an ACTRA Award, a Rocky Mountain Book Award, an Arthur Ellis Book Award and was twice nominated for the Edinburgh Comedy Award.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot-seancullen-04-300dpi.jpg",
  "PerformerId": "6791",
  "SortOrder": 50,
  "ExcludeFromList": false,
  "id": "6791",
  "pageUrl": "6791-sean-cullen",
  "events": [
   "7658",
   "7661",
   "7663",
   "7671",
   "7702"
  ],
  "mc_events": []
 },
 {
  "Name": "Paul F. Tompkins",
  "Bio": "<p>Paul F. Tompkins hosts the Fusion channel’s No, You Shut Up!, the web series Speakeasy with Paul F. Tompkins, the podcasts The Pod F. Tompkast and The Dead Authors Podcast, and the live variety show Varietopia with Paul F. Tompkins at the West Hollywood theatre Largo at The Coronet. He is a cast member of the live show &amp; podcast The Thrilling Adventure Hour and is a regular guest on both the television and podcast versions of Comedy Bang! Bang!  For a full list of Mr. Tompkins’ stage, television and film credits, ask your teacher or a policeman.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/paulftompkins.jpg",
  "PerformerId": "7588",
  "SortOrder": 50,
  "ExcludeFromList": false,
  "id": "7588",
  "pageUrl": "7588-paul-f-tompkins",
  "events": [
   "7657"
  ],
  "mc_events": []
 },
 {
  "Name": "Emo Philips",
  "Bio": "<p>Described by Jay Leno as \"the best joke writer in America,\" by British comedian Gary Delaney as the best joke writer in the world, and by \"Weird Al\" Yankovic as one of the funniest people on the planet, Emo Philips has performed over 6000 times throughout the English-speaking world. Since starting out in Chicago in 1976 at the age of twenty, Emo has had award-winning comedy albums, several cable specials (including an hour-long one on HBO), and many appearances on network television, both in America and in the UK. He has appeared in films (most notably, as the table-saw demonstrator in UHF) and has lent his distinctive voice to animated TV shows (such as Slacker Cats, Doctor Katz, Adventure Time, and Home Movies), but his first love, stand-up, remains his true one.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/emo2.jpg",
  "PerformerId": "7775",
  "SortOrder": 50,
  "ExcludeFromList": false,
  "id": "7775",
  "pageUrl": "7775-emo-philips",
  "events": [
   "7661",
   "7671",
   "7677"
  ],
  "mc_events": []
 },
 {
  "Name": "Dan Harmon",
  "Bio": "<p>Dan Harmon serves as creator/executive producer of the NBC comedy series “Community.” </p>\n<p>Harmon’s pursuit of minimal work for maximum reward took him from stand-up to improv to sketch comedy, then finally to Los Angeles, where he began writing feature screenplays. His first deal was with Robert Zemeckis at Imagemovers, for whom he co-wrote “Monster House.”  Along with his writing partner Rob Schrab, Harmon went on to write the Ben Stiller directed pilot “Heat Vision and Jack,” starring Jack Black and Owen Wilson. </p>\n<p>Disillusioned by the legitimate industry, Harmon retreated underground, during which time he attended classes at nearby Glendale Community College. It was also during this time that Harmon co-founded Channel 101, an untelevised non-profit audience-controlled network for undiscovered filmmakers, many of whom used it to launch mainstream careers, including the boys behind SNL’s Digital Shorts. Harmon and Schrab then partnered with Sarah Silverman to create her series for Comedy Central, “The Sarah Silverman Program,” where he served as the head writer for several episodes. </p>\n<p>Harmon then created, wrote and performed in the VH1 sketch series “Acceptable TV.” As part of a blind deal with Sony and inspired by his experience as a community college student, Harmon created “Community” which marked his first network series.  Harmon is also the co-creator of the animated Adult Swim series “Rick &amp; Morty.”</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/dan_harmon_0.jpg",
  "PerformerId": "6854",
  "SortOrder": 60,
  "ExcludeFromList": false,
  "id": "6854",
  "pageUrl": "6854-dan-harmon",
  "events": [
   "7670"
  ],
  "mc_events": []
 },
 {
  "Name": "Reggie Watts",
  "Bio": "<p>Reggie Watts is an internationally renowned vocal artist/ beatboxer/ musician/ comedian who wows audiences with his live performances which are 100% improvised.  Using his formidable voice, looping pedals, and his vast imagination, Reggie blends and blurs the lines between music and comedy.  No two performances are the same and to that end, ”genius” is the word most often used to describe Reggie Watts.  LA Weekly crowned him ”the most wildly inventive new talent of the past five years” while New York Magazine hailed Reggie as “Spectacularly original,” Rolling Stone featured him as “Hot Comedian,” SPIN named him as “Best New Comedian” and the LA Times praised Reggie is “a superstar.” </p>\n<p>On screen, in addition to his role as co-star on “Comedy Bang! Bang!”, his special \"Reggie Watts:  A Live At Central Park\" aired on Comedy Central in May 2012.  He also has appeared multiple times on Conan, and on Late Night With Jimmy Fallon, Jimmy Kimmel Live, John Oliver’s Stand-Up New York, HBO’s The Yes Men Save The World, IFC, Comedy Central’s Michael and Michael Have Issues, UK’s \"Funny Or Die,\" and PBS’ Electric Company.</p>\n<p>“Offbeat genius” – Playboy</p>\n<p>“Do yourself a big favor and go see him on tour now.” – MTV</p>\n<p>“It is not fair to compare the other performers to Watts – he is playing in a whole other professional league.” – New York Times</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/reggie_watts.jpg",
  "PerformerId": "7595",
  "SortOrder": 60,
  "ExcludeFromList": false,
  "id": "7595",
  "pageUrl": "7595-reggie-watts",
  "events": [
   "7660",
   "7661",
   "7674",
   "7701",
   "7734",
   "7783",
   "7796"
  ],
  "mc_events": []
 },
 {
  "Name": "Matt Braunger",
  "Bio": "<p>Matt Braunger was raised in Portland, OR. A headlining comedian since 2007 and an actor since childhood, Matt's comedy has appeared on The Late Show with David Letterman, The Tonight Show, Conan, The Late Late Show with Craig Ferguson,and Live at Gotham. He is a regular panelist on \"Chelsea Lately\" and Comedy Central's \"@Midnight.\" Matt's half-hour special on Comedy Central was released in 2009, and his hour special, \"Shovel Fighter,\" was released in 2012. In 2008 he won \"Best of the Fest\" at the Rooftop Festival in Aspen and in 2009 he was named to Variety's \"Top 10 Comics to Watch.\" He has released two albums, \"Soak Up the Night\" and \"Shovel Fighter.\" Matt has performed at a variety of prestigious comedy festivals including the Just For Laughs Festival in Montreal and Chicago, SXSW, Bumbershoot, and in 2007 he co-founded the Bridgetown Festival in Portland, OR. Matt's television credits include a recurring role on NBC's \"Up All Night,\" a series regular on \"Mad TV,\" and roles on \"The Michael Fox Show,\" \"Happy Endings,\" HBO's \"Family Tree\" \"Blue Mountain State,\" \"The United States of Tara,\" and \"Pushing Daisies.\"</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/matt_braunger.jpg",
  "PerformerId": "6858",
  "SortOrder": 70,
  "ExcludeFromList": false,
  "id": "6858",
  "pageUrl": "6858-matt-braunger",
  "events": [
   "7637",
   "7638",
   "7650",
   "7661",
   "7672",
   "7706",
   "7741",
   "7742",
   "8635"
  ],
  "mc_events": []
 },
 {
  "Name": "Kumail Nanjiani",
  "Bio": "<p>Kumail is a tireless Los Angeles-based writer and performer who has been featured in Variety’s “10 Comics to Watch,” the Hollywood Reporter’s “10 Rising Comedy Talents” and New York Magazine’s “10 Comedians that Funny People Find Funny.” Kumail first gained attention for his critically acclaimed one-man show “Unpronounceable” (directed by Paul Provenza), and in 2008, he received two ECNY awards for Best Male Stand-up Comedian and Best One Man Show.  He’s toured with Stella, Eugene Mirman, and Zach Galifianakis and has been seen performing stand-up on “Conan,” “Late Night with Jimmy Fallon,” “The Late Show with David Letterman,” and “Jimmy Kimmel Live.” He has also been featured on “Portlandia,” “The Colbert Report,” “Michael and Michael Have Issues,” Fox’s “Traffic Light,” and the feature film “Life As We Know It.” He was recently featured on “John Oliver’s New York Stand-Up Show” on Comedy Central and was a regular cast member on TNT’s “Franklin &amp; Bash.” He has released his one-hour Comedy Central Special and album “Beta Male” in 2013, and and will be appearing on Mike Judge’s upcoming “Silicon Valley” on HBO.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/kumail.jpg",
  "PerformerId": "6862",
  "SortOrder": 70,
  "ExcludeFromList": false,
  "id": "6862",
  "pageUrl": "6862-kumail-nanjiani",
  "events": [
   "7659",
   "7668"
  ],
  "mc_events": []
 },
 {
  "Name": "James Adomian",
  "Bio": "<p>James Adomian is a daredevil dancing queen  — but don’t you know deep down he’s just a kitten? James was a top-10 finalist on NBC's Last Comic Standing and is a frequent guest on Comedy Bang Bang and other wild podcasts. He performs standup and characters live at Upright Citizens Brigade and at festivals, theatres, dive bars, party schools and radical political events across North America. His debut album Low Hangin Fruit was released by Earwolf in August 2012.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/jamesadomian.jpg",
  "PerformerId": "7881",
  "SortOrder": 80,
  "ExcludeFromList": false,
  "id": "7881",
  "pageUrl": "7881-james-adomian",
  "events": [
   "7638",
   "7645",
   "7783",
   "7796",
   "7804",
   "7806",
   "7807",
   "8631"
  ],
  "mc_events": []
 },
 {
  "Name": "Wil Anderson",
  "Bio": "<p>Wil Anderson is a stand up first and foremost, touring Australia and the world at every opportunity, performing more than two hundred shows a year. His stand up is a densely written, high-speed ride through one of the most wonderful comedic imaginations in the world. Politics, pop and the personal come together in a Wil Anderson routine, always delivered with more conviction and enthusiasm than any man’s vocal chords can take.</p>\n<p>Over the last 4 years Wil spent a lot of time north of the equator, performing live in London, Edinburgh, Ireland, Montreal, Canada, New Zealand and across the US and securing regular guest appearances on the popular US late night comedy talk show, Chelsea Lately.</p>\n<p>Since 2008 Wil has been the host and executive producer of the ABC (Australian Broadcast Company) TV&#039;s highest rating program &quot;The Gruen Transfer series&quot; - a role that saw him nominated for a Gold Logie in 2010, and also won Best Entertainment Show at the AACTA awards in 2011. </p>\n<p>Gruen has spawned the spin-offs Gruen Nation, the sports themed Gruen Sweat and Gruen Planet. In 2013 Wil returned to host a series of Gruen Nation and Gruen Planet which was once again the number 1 entertainment show on the ABC network, a record fifth year in a row.  In 2012 Gruen Planet was nominated for a Logie, and in May 2013 Gruen Sweat won the prestigious Rose d&#039;Or, Europe&#039;s equivalent of the Emmys. </p>\n<p>But it’s on stage where Wil is in his element: 2012 saw Wil busy touring his hit live show Wilarious to sold out venues around Australia, earning rave reviews and winning his third consecutive Bulmer&#039;s People’s Choice Award at the Melbourne Comedy Festival, not to mention being named one of comedy’s hottest acts by none other than John Cleese.  </p>\n<p>2013 saw Wil’s most successful tour yet, with GoodWil being seen by over 50,000 people including audience across North America in Vancouver, Montreal, LA, New York, Minneapolis, Seattle, DC, Cleveland and Denver.</p>\n<p>GoodWil was awarded a Fringe Award for Best Comedy during the Adelaide Fringe Festival, and enjoyed a sell-out 21-night run at the prestigious 1600-seat Princess Theatre during the Melbourne International Comedy Festival where it received a five-star review from the Herald-Sun. It was later performed everywhere from a a log-cabin in Alaska to a two-week sold-out season at the prestigious Soho Theatre in London. </p>\n<p>To cap off 2013, GoodWil was nominated for a Helpmann award (Australia’s Tonys) for live comedy performance. This is a record-breaking fourth nomination in a row. </p>\n<p>Wil is also the host of the popular podcasts Wilosophy which regularly tops the iTunes charts in Australia, and TOFOP which was recently named iTunes Best Classic Audio podcast for 2013.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/img_3281web.jpg",
  "PerformerId": "6833",
  "SortOrder": 80,
  "ExcludeFromList": false,
  "id": "6833",
  "pageUrl": "6833-wil-anderson",
  "events": [
   "7658",
   "7668",
   "7671",
   "7687",
   "7703",
   "7915"
  ],
  "mc_events": []
 },
 {
  "Name": "Sean Patton",
  "Bio": "<p>Sean Patton is a comedian based in Los Angeles and New York, by way of New Orleans. Sean began doing standup in the Crescent City, and has since performed in comedy clubs across the US and Canada. Sean also performed at The Melbourne International Comedy Festival (2011), and twice at Montreal’s Just for Laughs Comedy Festival (2008, 2010). In the TV world, Sean has appeared on Comedy Central's Live at Gotham (2009), Late night with Jimmy Fallon (2010), and twice on Conan (2011, 2013). 2013 also marked the release of his own Comedy Central Half Hour Special. As for acting, Sean played a guest starring role on IFC’s Maron and a co-starring role on Comedy Central’s Inside Amy Schumer. Sean also shot an unscripted travel pilot in 2013 for The Esquire Network, entitled Best Bars in America. The show has been picked up for 10 episodes and will shoot over spring 2014.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/seanpatton.jpg",
  "PerformerId": "6859",
  "SortOrder": 100,
  "ExcludeFromList": false,
  "id": "6859",
  "pageUrl": "6859-sean-patton",
  "events": [
   "7622",
   "7659",
   "7671",
   "7703",
   "7742",
   "7805"
  ],
  "mc_events": []
 },
 {
  "Name": "Lance Bangs",
  "Bio": "<p>Lance Bangs is a filmmaker, documentarian, and music video director.</p>\n<p>His comedy work includes directing David Cross's film Let America Laugh, as well as standup specials for Marc Maron, John Hodgman, Nick Thune, Todd Barry and Rob Delaney. Bangs has also been heavily involved in the filming and production of MTV’s Jackass television series and its subsequent movies.  He Executive Produces the current adultswim series Loiter Squad and recently directed The Greatest Event in Television History with Adam Scott.</p>\n<p>He will be directing the new Comedy Central series Meltdown with Jonah Ray and Kumail Nanjiani.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/lancebangs_0.jpg",
  "PerformerId": "7882",
  "SortOrder": 100,
  "ExcludeFromList": false,
  "id": "7882",
  "pageUrl": "7882-lance-bangs",
  "events": [
   "7669"
  ],
  "mc_events": [
   "7783"
  ]
 },
 {
  "Name": "Jeff Davis",
  "Bio": "<p>Jeff B. Davis is a multi-talented actor/comedian, born and bred in Los Angeles, CA.  His career began at age 4 as \"Linus\" in a terribly ill-advised, all-children production of You're a Good Man, Charlie Brown at the Goundlings Theater.  On opening night, Jeff vomited all over his director, then turned and took the stage.   At age 9, Jeff was cast as \"Louis\" in Yul Brynner's final production of The King and I, which toured nationally and closed on Broadway when Jeff was 11, after nearly 800 vomit-free performances.</p>\n<p>In high school Jeff began improvising with Los Angeles ComedySportz, eventually learning the skills he'd later need as a frequent guest on the hit television show Whose Line is it, Anyway?  Jeff has a long list of TV credits, including Steven Martin's NBC comedy The Downer Channel, WB's On the Spot, NBC's Happy Family, the Sarah Silverman Show, Drew Carey's Green Screen Show and Improvaganza, to name just a few.  Jeff spends many nights of the year performing live with \"Whose Line\" stars Ryan Stiles, Greg Proops, and Chip Esten to standing ovations all over North America.  When he's not on stage, Jeff is in Hollywood trying to break George Clooney's record of \"most failed television pilots.\"</p>\n<p>Jeff is currently a guest on CW's reboot of Whose Line is it, Anyway?, and can be heard on the highly-acclaimed, deeply weird Harmontown podcast with NBC's Community creator Dan Harmon.  Listen at your own risk.</p>\n<p>Feel free to bother Jeff on Twitter @JeffBryanDavis.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/jeffdavis.jpg",
  "PerformerId": "6856",
  "SortOrder": 100,
  "ExcludeFromList": false,
  "id": "6856",
  "pageUrl": "6856-jeff-davis",
  "events": [
   "7670"
  ],
  "mc_events": []
 },
 {
  "Name": "Paul Provenza",
  "Bio": "<p>Paul Provenza has been a major name in stand-up comedy for decades. He is the co-creator and director of the critically acclaimed comedy/documentary The Aristocrats. He has written, produced, and starred in several comedy specials, including the comedy talk show Comics Only for Comedy Central and his own one-man show for Showtime, The Incredible Man-Boy. He is an artistic consultant to the Montreal and Chicago Just for Laughs festivals, and co-produced and starred in The Green Room with Paul Provenza for Showtime. He is the host of the acclaimed Sky TV series and stage show Set List.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/paul_provenza_pic.jpg",
  "PerformerId": "7803",
  "SortOrder": 100,
  "ExcludeFromList": false,
  "id": "7803",
  "pageUrl": "7803-paul-provenza",
  "events": [
   "7642"
  ],
  "mc_events": [
   "7816",
   "7671",
   "7677"
  ]
 },
 {
  "Name": "Nathan Fielder",
  "Bio": "<p>Nathan Fielder is currently in production on the second season of his hit Comedy Central series “Nathan For You,” which he writes, directs, and stars in. Nathan has written and performed on the series “Jon Benjamin Has a Van” and “Important Things with Demetri Martin”.</p>\n<p>Hailing from Canada, Nathan is also well known for his online shorts and his weekly segments on the acclaimed CBC comedy series “This Hour Has 22 Minutes.&quot; For his work &quot;22 Minutes&quot; Fielder received a Canadian Comedy Award, a Writer&#039;s Guild Award, and was nominated for a Gemini.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/nathan_fielder.jpg",
  "PerformerId": "7800",
  "SortOrder": 100,
  "ExcludeFromList": false,
  "id": "7800",
  "pageUrl": "7800-nathan-fielder",
  "events": [
   "7662"
  ],
  "mc_events": []
 },
 {
  "Name": "Jonah Ray",
  "Bio": "<p>Jonah Ray is a writer/comedian originally from Kailua, Oahu. He’s written and performed on shows like “Human Giant,” “Supernews,” “Attack of the Show,” Comedy Central’s “Live At Gotham” and “Web Soup.” A co-host on the Nerdist podcast with Chris Hardwick, Jonah also puts together a weekly comedy show at Meltdown Comic Books in Los Angeles with Kumail Nanjiani. Be sure to check out his blog at jonahray.com. He more often than not posts stuff about penguins, zombies, and “Mystery Science Theater 3000.”</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/jonahray.jpg",
  "PerformerId": "6863",
  "SortOrder": 100,
  "ExcludeFromList": false,
  "id": "6863",
  "pageUrl": "6863-jonah-ray",
  "events": [
   "7625",
   "7645",
   "7659",
   "7669"
  ],
  "mc_events": []
 },
 {
  "Name": "Jamie Lee",
  "Bio": "<p>Named one of the Top Five Comedians Who Should Be Movie Stars by Nerve.com and one of the Top 18 Women You Should Be Following On Twitter by Huffington Post, Jamie Lee is an unstoppable force in comedy, and a currently a cast member on the hit MTV series &quot;Girl Code&quot; and writer for the TBS late night show The Pete Holmes Show.</p>\n<p>Jamie’s standup appeared recently on TBS’s “Conan” and Comedy Central’s “John Oliver’s New York Stand Up Show”. Jamie was a semi-finalist on NBC&#039;s Last Comic Standing co-hosted the first annual Critics Choice Awards for Vh1.com and appeared on E!’s “Chelsea Lately”, TBS’s “The Pete Holmes Show”, Vh1’s &quot;Undateable&quot;, TruTV&#039;s &quot;World&#039;s Dumbest&quot;, MTV’s “Money From Strangers”, Yahoo’s “Mansome,” and performed stand-up on TV Guide&#039;s all-female comedy series &quot;Stand Up in Stilettos.&quot; She’s additionally written for Rob Dyrdek&#039;s MTV series Ridiculousness.</p>\n<p>Jamie&#039;s acting experience ranges from national commercials to web series to feature film. Kid Farm a parody of TLC&#039;s &quot;19 Kids and Counting&quot; that Lee created with Front Page Films, was featured on HuffingtonPost.com, ComedyCentral.com and BestWeekEver.tv - not to mention tweeted with praise by acclaimed screen writer Diablo Cody. It is now an original series on Comedy Central&#039;s CCstudios.com. Jamie will also be starring in the upcoming web series “Love’s A Bitch” for Official Comedy.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/jamie_lee_girl_code_small.jpg",
  "PerformerId": "6014",
  "SortOrder": 105,
  "ExcludeFromList": false,
  "id": "6014",
  "pageUrl": "6014-jamie-lee",
  "events": [
   "7639",
   "7645",
   "7663",
   "7749",
   "7796",
   "7914",
   "8635"
  ],
  "mc_events": []
 },
 {
  "Name": "Henry Phillips",
  "Bio": "<p>Henry Phillips  has been seen and heard performing his twisted songs and stories on 'Comedy Central Presents', ABC’s ’Jimmy Kimmel Live’, satellite and terrestrial radio nationwide. His critically acclaimed albums, fusing mellow folk-rock ballads with psychopathic lyrics have earned him mention in Billboard magazine’s ’Critic’s Choice’, as well as acclaim from such notable artists as Moby, who refers to Phillips' songs as \"disconcertingly funny\". His semi-biographical comedy film \"Punching the Clown\" received the Audience award at Slamdance film festival '09, and the sequel is scheduled to shoot this year.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/henryphillips_2.jpg",
  "PerformerId": "7579",
  "SortOrder": 110,
  "ExcludeFromList": false,
  "id": "7579",
  "pageUrl": "7579-henry-phillips",
  "events": [
   "7621",
   "7624",
   "7625",
   "7651",
   "7734",
   "7810",
   "7913"
  ],
  "mc_events": []
 },
 {
  "Name": "W. Kamau Bell",
  "Bio": "<p>Socio-political comedian W. Kamau Bell has emerged as the post-modern voice of comedy. Named an Ambassador of Racial Justice by the ACLU, his weekly half-hour FX comedy series, Totally Biased with W. Kamau Bell, premiered in August 2012 and became a critically acclaimed but criminally short nightly show in September of 2013 on FX’s new comedy network FXX. The NY Times called Kamau “the most promising new talent in political comedy in many years.” The show was nominated for “Best Talk Series” at the 2012 NAACP Image Awards and Salon.com listed Kamau on their “Sexiest Men of 2012” list, calling the series “surreptitiously revolutionary in its effortless diversity and humanism.” The San Francisco Chronicle raved, “it makes The Daily Show seem like something your dad watches.” Totally Biased was executive produced by Chris Rock, who became a fan after seeing a performance of Kamau’s one man show.</p>\n<p>In 2010, Kamau released his second stand up album, Face Full of Flour, which was named one of the Top 10 Best Comedy Albums of the year by iTunes and Punchline Magazine. His first album One Night Only was released in 2007. Also in 2007 he developed his one-man show The W. Kamau Bell Curve: Ending Racism in About An Hour, which received rave reviews from audiences, critics, and industry insiders. The show was a comedy pick in The Guardian during its 2011 run at the Edinburgh Fringe Festival, a Time Out NY critic’s pick in the 2010 NY Comedy Festival, and played to sold-out audiences in the 2009 NY International Fringe Festival.</p>\n<p>Kamau sits on the board of Race Forward, a racial justice think tank and home for media and activism, and Hollaback, a non-profit and movement to end street harassment. He has been featured on several of the biggest comedy podcasts including WTF with Marc Maron, Comedy &amp; Everything Else, Citizen Radio, The Sound of Young America, and Jordan, Jesse, GO!, and is a regular correspondent on The War Room on Current TV.</p>\n<p>Praised by Punchline Magazine as “one of our nation’s most adept racial commentators with a blistering wit,” Kamau was voted San Francisco’s best comedian by the SF Weekly, the SF Bay Guardian, and 7×7 Magazine. Robin Williams calls Kamau “ferociously funny,” and Vernon Reid of the band Living Colour offers “W. Kamau Bell is in the vanguard of a new era of American comedy for an unsettling, troubling, and strangely hopeful time. Firmly in the fearless tradition of Mort Sahl, Lenny Bruce, Richard Pryor, and Chris Rock. Comedy as common sense purged of the absurd hypocrisy that is Our America.” The SF Weekly called Kamau “smart, stylish, and very much in the mold of politically outspoken comedians like Dave Chappelle,” though he was more excited that they called him “handsome.”</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/kamaubell.jpg",
  "PerformerId": "7895",
  "SortOrder": 110,
  "ExcludeFromList": false,
  "id": "7895",
  "pageUrl": "7895-w-kamau-bell",
  "events": [
   "7637",
   "7702",
   "7733",
   "8632"
  ],
  "mc_events": []
 },
 {
  "Name": "Aparna Nancherla",
  "Bio": "<p>Aparna started out doing comedy in her hometown of Washington, D.C. and currently resides in New York City, where most recently she was a writer and regular correspondent on FX’s &quot;Totally Biased with W. Kamau Bell.&quot;  She is an alumna of the NBC Stand Up for Diversity program, and in 2013 was one of the breakout New Faces at the prestigious Just For Laughs Festival in Montreal.  She has performed all over the US including Portland’s Bridgetown Comedy Festival, SF Sketchfest, Bentzen Ball, Aspen’s Rooftop Comedy Festival, and The Great American Comedy Festival.  She has also been a contributing writer for NPR, Reader’s Digest, The Huffington Post, The Washington Post Magazine, XM Radio, and Slate V.  She can regularly be seen performing at the Upright Citizen’s Brigade’s in LA and NYC.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/aparna_nancherla_headshot.jpg",
  "PerformerId": "6823",
  "SortOrder": 115,
  "ExcludeFromList": false,
  "id": "6823",
  "pageUrl": "6823-aparna-nancherla",
  "events": [
   "7641",
   "7645",
   "7646",
   "7651",
   "7659",
   "7679",
   "7810"
  ],
  "mc_events": []
 },
 {
  "Name": "Julian McCullough",
  "Bio": "<p>You may recognize Julian from a variety of basic cable shows that constantly run his episodes without paying him residuals because life isn't fair. These shows include Late Night with Jimmy Fallon, Chelsea Lately, Guy Code, Love You, Mean It with Whitney Cummings, and Comedy Central Presents. There is a reason Julian is on TV so much, and that is because he is a super fun hang! Man that guy is funny. On and off stage, he really is a great time!</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/julianmccullough.jpg",
  "PerformerId": "6860",
  "SortOrder": 120,
  "ExcludeFromList": false,
  "id": "6860",
  "pageUrl": "6860-julian-mccullough",
  "events": [
   "7645",
   "7659",
   "7685",
   "7710",
   "7913",
   "7919"
  ],
  "mc_events": []
 },
 {
  "Name": "Alice Wetterlund",
  "Bio": "<p>Alice “Pretty-in-a-Not-Shitty-Way” Wetterlund has performed her non-yelling brand of comedy on stages such as Comix, Broadway Comedy Club, UCB theaters, San Francisco’s Punchline and The Hollywood Improv, and on critically-acclaimed shows including College Humor Live, Big Terrific, and Meltdown.  She has also performed nationally in festivals such as Bridgetown, Moon Tower and Women in Comedy, and frequently tours with Comedy Central on Campus.  This year, she was a New Face for the 2013 Just for Laughs Comedy Festival in Montreal and was on the official line up for FOX’s Night of Comedy in Los Angeles.  Her credits include guest stars on NEW GIRL (FOX) and BETAS (Amazon original series).  Currently, Alice can be seen as a series regular on MTV’s GIRL CODE.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/alicewetterlund.jpg",
  "PerformerId": "7777",
  "SortOrder": 120,
  "ExcludeFromList": false,
  "id": "7777",
  "pageUrl": "7777-alice-wetterlund",
  "events": [
   "7645",
   "7660",
   "7699",
   "7703",
   "7739",
   "7750",
   "7783"
  ],
  "mc_events": []
 },
 {
  "Name": "Nate Bargatze",
  "Bio": "<p>Nate Bargatze has had two late night appearance on Late Night with Jimmy Fallon, four appearances on Conan and had his own Comedy Central Presents in 2011. He has written for Spike TV&#039;s Video Game Awards and received critical acclaim at the Montreal Comedy Festival multiple years. When he isn&#039;t winning comedy festivals in both New York and Boston, performing at Bonnaroo, or on tour with Jimmy Fallon&#039;s &quot;Clean Cut Comedy Tour,&quot; he might just be performing for troops in Iraq, which he has done five times. His debut comedy album &quot;Yelled at by a Clown&quot; reached #1 on the iTunes comedy charts.  Nate was also featured as one of Esquire&#039;s Best New Comedians of 2012, as one of Marc Maron&#039;s comedians to watch in Rolling Stone and in Paste Magazine, and as one of the 10 Comedians Who Deserve Their Own TV Show on CoolMaterial.com.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/nate_bargatze.jpg",
  "PerformerId": "6374",
  "SortOrder": 120,
  "ExcludeFromList": false,
  "id": "6374",
  "pageUrl": "6374-nate-bargatze",
  "events": [
   "7645",
   "7695",
   "7699",
   "7749"
  ],
  "mc_events": []
 },
 {
  "Name": "Andres du Bouchet",
  "Bio": "<p>Andres is a staff writer at CONAN. He performs all over L.A., mostly at &quot;alt&quot; venues. His first comedy album, &quot;Naked Trampoline Hamlet,&quot; is available on iTunes. He&#039;s currently working on his second album with A Special Thing Records.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/andres_du_bouchet_03.jpg",
  "PerformerId": "6065",
  "SortOrder": 120,
  "ExcludeFromList": false,
  "id": "6065",
  "pageUrl": "6065-andres-du-bouchet",
  "events": [
   "7623",
   "7625",
   "7632",
   "7645",
   "7646",
   "7740"
  ],
  "mc_events": []
 },
 {
  "Name": "Jon Daly",
  "Bio": "<p>Jon Daly writes, performs, and is a supervising producer on THE NICK SHOW KROLL for Comedy Central which premiered in early 2013. He can currently be seen in Ben Stiller and Fox’s THE SECRET LIFE OF WALTER MITTY and is a costar of The Amazon series BETAS. He appeared in Fox’s BRIDE WARS opposite Kate Hudson and Anne Hathaway and can be seen on Adult Swim’s NTSF:SD:SUV::, the series premiere of PARKS AND RECREATION, on Spike TV’s comedy series PLAYERS, and has recurred on ABC’s HAPPY ENDINGS and HBO’s cult favorite, THE LIFE AND TIMES OF TIM. Jon also co-created and starred in his Comedy Central pilot RICH DICKS along with Nick Kroll.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/jon_daly_photo.jpg",
  "PerformerId": "6808",
  "SortOrder": 125,
  "ExcludeFromList": false,
  "id": "6808",
  "pageUrl": "6808-jon-daly",
  "events": [
   "7646",
   "7657",
   "7702",
   "7740"
  ],
  "mc_events": []
 },
 {
  "Name": "Baron Vaughn",
  "Bio": "<p>BARON VAUGHN recently released his first comedy recording, Raised By Cable, produced by AST Records, available at Amazon (mp3 and CD), and iTunes. Baron’s performed stand-up on Conan (twice), Late Night with Jimmy Fallon, The Late Late Show with Craig Ferguson, and has had numerous appearances on Comedy Central most recently in the form of his own “Half Hour” comedy special. He’s performed in the HBO U.S. Comedy Arts Festival (Aspen), The Just for Laughs Comedy Festival (Montreal), The South Beach Comedy Festival (Miami), Moontower Comedy Festival (Austin), San Francisco Sketchfest, Vancouver Comedy Festival, All Points West Music Festival (New Jersey), FYF Music Festival (Los Angeles), Bonnaroo Music and Arts Festival (TN), and Bumbershoot Music and Arts Festival (Seattle). He has also appeared in many shows on VH1, MTV, FUSE as well as the films Black Dynamite, Cloverfield, The Other Guys (Deleted Scenes), and was a series regular on USA’s recently canceled Fairly Legal (2010-2012).</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/baron_at_8_yrs._3rd_grade.jpg",
  "PerformerId": "6849",
  "SortOrder": 125,
  "ExcludeFromList": false,
  "id": "6849",
  "pageUrl": "6849-baron-vaughn",
  "events": [
   "7638",
   "7741",
   "7746",
   "7815",
   "8635"
  ],
  "mc_events": [
   "7701",
   "7733"
  ]
 },
 {
  "Name": "Christian Duguay",
  "Bio": "<p>Christian is an alumni of the Groundlings Theater Main Company and was a cast member on Fox&#039;s MadTV. He has also appeared on &quot;Arrested Development&quot; and Fox &quot;NFL Sunday.&quot; He was featured in the Rodney Dangerfield Award showcase at the Riot LA alternative Comedy Festival in 2014, and is the Executive Producer of &quot;Ridiculousness&quot; (MTV) and &quot;Fantasy Factory&quot; (MTV). He regularly performs stand up comedy in the Los Angeles area.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/img_0481.jpg",
  "PerformerId": "6123",
  "SortOrder": 125,
  "ExcludeFromList": false,
  "id": "6123",
  "pageUrl": "6123-christian-duguay",
  "events": [
   "7622",
   "7639",
   "7660",
   "7678",
   "7914",
   "8633"
  ],
  "mc_events": []
 },
 {
  "Name": "Hari Kondabolu",
  "Bio": "<p>Hari Kondabolu is a Brooklyn-based, Queens-raised comic who has been described by Time Out NY as &quot;smart, analytical and rising.&quot; Hari recently released his debut standup comedy album Waiting for 2042 on Kill Rock Stars and featured on NPR&#039;s &quot;Fresh Air with Terry Gross.&quot; He was also a writer and correspondent for FX’s Totally Biased with W. Kamau Bell.</p>\n<p>Hari has done standup on the Late Show with David Letterman, Conan, Jimmy Kimmel Live, and John Oliver’s New York Standup Show. His Comedy Central Presents half-hour television special debuted in February 2011. He has also performed at such notable festivals as South by Southwest, Bumbershoot, Sasquatch and the Just For Laughs in Montreal and Chicago.</p>\n<p>He has also appeared on such popular podcasts as &quot;WTF with Marc Maron,&quot; &quot;You Made it Weird with Pete Holmes&quot; and &quot;Too Beautiful to Live with Luke Burbank.&quot;</p>\n<p>When in New York City, Hari co-hosts the Untitled Kondabolu Brothers Podcast with his younger brother Ashok (“Dap” from hip hop group Das Racist) and their live show the Untitled Kondabolu Brothers Project.</p>\n<p>His website is <a href=\"http://www.harikondabolu.com\">www.harikondabolu.com</a> and is @harikondabolu on Twitter.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/hari_kondabolu-_2011_web.jpg",
  "PerformerId": "6835",
  "SortOrder": 125,
  "ExcludeFromList": false,
  "id": "6835",
  "pageUrl": "6835-hari-kondabolu",
  "events": [
   "7688",
   "7740",
   "7749",
   "7916",
   "8632"
  ],
  "mc_events": []
 },
 {
  "Name": "Matt Kirshen",
  "Bio": "<p>London born Matt Kirshen&#039;s precision wit has earned him an impressive reputation on the international comedy circuit. Most recently his appearances on Late Night with Jimmy Fallon, The Late Late Show with Craig Ferguson, Paul Provenza’s Green Room, and as a finalist on NBC&#039;s &quot;Last Comic Standing&quot; has earned him a whole new host of fans in the United States and a surprising number of other countries worldwide. </p>\n<p>He has also recorded a half-hour special for the World Stands Up, Comedy Central, and has acclaimed festival appearances at Montreal, Edinburgh, Kilkenny, Glastonbury, Reading, Leeds, Bermuda, and Amsterdam. </p>\n<p>His debut CD, &quot;I Guess We&#039;ll Never Know&quot; was named in Punchline Magazine&#039;s top 10 albums of 2009, and his hit appearance at the 2008 Just For Laughs festival in Montreal resulted in no fewer than four of his gags appearing in the Montreal Gazette&#039;s roundup of their best jokes of the fest. </p>\n<p>Matt has appeared in and written for numerous television shows in the UK, including a charity gala featuring Jimmy Fallon, which resulted in Jimmy himself requesting Matt to open for him in a college tour to promote his new Late Night hosting slot. </p>\n<p>His youthful looks disguise a veteran comic with almost a decade of experience, and a wealth of smart, funny and relatable material, making him a firm favorite with college audiences. While it&#039;s his prime-time NBC appearances that most American comedy fans will recognize him from, they are often surprised at the breadth and scope of his material, described by one reviewer as &quot;intelligent, but with the emphasis firmly on the funny&quot;</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/kirshen_matt-1429.jpg",
  "PerformerId": "6365",
  "SortOrder": 125,
  "ExcludeFromList": false,
  "id": "6365",
  "pageUrl": "6365-matt-kirshen",
  "events": [
   "7642",
   "7646",
   "7671",
   "7677",
   "7698",
   "7749"
  ],
  "mc_events": []
 },
 {
  "Name": "Adam Newman",
  "Bio": "<p>Adam Newman is a New Hampshire-born, Georgia-schooled, Brooklyn-based comedian who has appeared on the Late Show with David Letterman and John Oliver&#039;s New York Stand-Up Show on Comedy Central. He was among Comedy Central&#039;s first class of &quot;Comics to Watch&quot; and later performed as a &quot;New Face&quot; at the prestigious Just for Laughs Comedy Festival in Montreal. His critically acclaimed debut stand-up CD, &quot;Not for Horses,&quot; was released by Rooftop Comedy. </p>\n<p>Adam&#039;s TV appearances include MTV&#039;s &quot;The CollegeHumor Show,&quot; various talking head shows on the TV Guide Network, the Tyra Banks Show (weird!), and dozens of CollegeHumor Originals on CollegeHumor.com.  Adam hosts the popular &quot;BIG LONG SETS&quot; at NYC&#039;s Upright Citizens Brigade Theatre, and &quot;Butt Talk,&quot; the world&#039;s #1 Number 2 podcast.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/newman_kylemakrauer.jpg",
  "PerformerId": "6069",
  "SortOrder": 125,
  "ExcludeFromList": false,
  "id": "6069",
  "pageUrl": "6069-adam-newman",
  "events": [
   "7663",
   "7738",
   "7745",
   "7951",
   "8635"
  ],
  "mc_events": []
 },
 {
  "Name": "Adrienne Iapalucci",
  "Bio": "<p>Born and bred in the Bronx, Adrienne Iapalucci’s skewed look on life is reflected in her unique brand of intelligent comedy. Her dark sense of humor is enhanced by her political incorrectness and counteracted by her love of dogs.</p>\n<p>Comedy fans might recognize Adrienne from her performances as a semifinalist on season 7 of NBC’s Last Comic Standing and her recent appearance on the Late Show with David Letterman.</p>\n<p>In 2009, Adrienne won the first ever People’s Choice award at the New York Comedy Festival. She was also a semifinalist in the festival&#039;s New York Funniest Stand-Up contest and a runner-up in the New York Underground Comedy Festival’s Best of the Boroughs contest.</p>\n<p>Adrienne has been featured in the Daily News, New York Times, Reader’s Digest, and TimeOut NY magazine. In 2010 Adrienne made her international debut as part of Montreal’s Just For Laughs Festival, where she took part in “New Faces.”  Adrienne recently made her first late night appearance in November, 2013 on The David Letterman Show.</p>\n<p>Adrienne can be seen touring comedy clubs and colleges around the country.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/adrienne.jpg",
  "PerformerId": "6611",
  "SortOrder": 125,
  "ExcludeFromList": false,
  "id": "6611",
  "pageUrl": "6611-adrienne-iapalucci",
  "events": [
   "7652",
   "7915",
   "7919",
   "8579",
   "8633"
  ],
  "mc_events": []
 },
 {
  "Name": "Myq Kaplan",
  "Bio": "<p>Myq Kaplan is a comedian named Mike Kaplan.</p>\n<p>He has been seen on the Tonight Show with Conan O&#039;Brien, the Late Show with David Letterman, and in his own half-hour Comedy Central Presents special. He has been heard on his albums &quot;Meat Robot&quot; and &quot;Vegan Mind Meld,&quot; his podcast, &quot;Hang Out With Me&quot; on the Keith and The Girl network, and also thousands of other podcasts and things that aren&#039;t podcasts. In addition to being seen and heard, he has been smelled and tasted and touched. This May, his one-hour special, &quot;Small, Dork, and Handsome,&quot; will debut on Netflix, and all kinds of other things will probably happen in the future, but bios are mainly about the past. </p>\n<p>Check out myqkaplan.com for more information, or just be the autonomous human you are and do what you like. Thanks!</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/myq-kaplan-0587-2.jpg",
  "PerformerId": "6818",
  "SortOrder": 130,
  "ExcludeFromList": false,
  "id": "6818",
  "pageUrl": "6818-myq-kaplan",
  "events": [
   "7650",
   "7680",
   "7738",
   "7748",
   "7806",
   "7810",
   "7967"
  ],
  "mc_events": [
   "7648",
   "7734"
  ]
 },
 {
  "Name": "Myq Kaplan",
  "Bio": "<p>Myq Kaplan is a comedian named Mike Kaplan.</p>\n<p>He has been seen on the Tonight Show with Conan O&#039;Brien, the Late Show with David Letterman, and in his own half-hour Comedy Central Presents special. He has been heard on his albums &quot;Meat Robot&quot; and &quot;Vegan Mind Meld,&quot; his podcast, &quot;Hang Out With Me&quot; on the Keith and The Girl network, and also thousands of other podcasts and things that aren&#039;t podcasts. In addition to being seen and heard, he has been smelled and tasted and touched. This May, his one-hour special, &quot;Small, Dork, and Handsome,&quot; will debut on Netflix, and all kinds of other things will probably happen in the future, but bios are mainly about the past. </p>\n<p>Check out myqkaplan.com for more information, or just be the autonomous human you are and do what you like. Thanks!</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/myq_kaplan_headshot_web2.jpg",
  "PerformerId": "6818",
  "SortOrder": 130,
  "ExcludeFromList": false,
  "id": "6818",
  "pageUrl": "6818-myq-kaplan",
  "events": [
   "7650",
   "7680",
   "7738",
   "7748",
   "7806",
   "7810",
   "7967"
  ],
  "mc_events": [
   "7648",
   "7734"
  ]
 },
 {
  "Name": "Sean O&#039;Connor",
  "Bio": "<p>After starting his stand up career in New Jersey, Sean moved to New York and quickly<br />\nbecame one of the city&#039;s favorite new comics, being featured in the NY Post as one of<br />\nNew York’s Top 20 Comics to Watch and filmed his Half Hour Special for Comedy<br />\nCentral.</p>\n<p>In addition to working as a staff writer on “Sports Show with Norm MacDonald” at<br />\nComedy Central, Sean was a producer for “Upload with Shaquille O’neal”. He is currently<br />\ndeveloping a pilot with Julian McCullough for Comedy Central.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/sean_o_connor_pic_5.16.13.jpg",
  "PerformerId": "6816",
  "SortOrder": 150,
  "ExcludeFromList": false,
  "id": "6816",
  "pageUrl": "6816-sean-o039connor",
  "events": [
   "7645",
   "7660",
   "7699",
   "7914"
  ],
  "mc_events": []
 },
 {
  "Name": "Ahmed Bharoocha",
  "Bio": "<p>Ahmed Bharoocha is quickly becoming a household name amongst comics and comedy fans alike.   In 2012, he was selected for New Faces in the Just For Laughs Montreal Comedy Festival. In 2013 he was featured on Comedy Central’s new stand-up show &quot;Adam Devine’s House Party.&quot; His sketch group, Dead Kevin, was featured on Tosh.0, ComedyCentral.com and named by LAWeekly as one of the top comedy acts to watch.</p>\n<p>In 2009, Ahmed was handpicked by David Letterman’s Eddie Brill to perform in the Great American comedy festival, and in 2010 he won the Magner’s Comedy Festival.  He has been a regular in several other notable fests including Glasgow, Boston Comedy Fest, Seattle Comedy Fest, RIOT LA, Bridgetown Comedy Fest and many others.</p>\n<p>Currently he performs regularly at LA’s top comedy clubs: The Comedy Store, The Improv and the Laugh Factory.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/ahmed_.jpg",
  "PerformerId": "6425",
  "SortOrder": 150,
  "ExcludeFromList": false,
  "id": "6425",
  "pageUrl": "6425-ahmed-bharoocha",
  "events": [
   "7734",
   "7804",
   "7805",
   "7915",
   "7952",
   "8635"
  ],
  "mc_events": [
   "7679"
  ]
 },
 {
  "Name": "Andy Haynes",
  "Bio": "<p>Andy Haynes was born in the shadows of Mt. Rainier in the wilds of the Pacific Northwest, raised on salmon and caffeine. He now lives in Los Angeles, where he works as comedian, and writer.</p>\n<p>He has performed on Late Night with Jimmy Fallon and the New Faces showcase at the Montreal Just for Laughs Festival, along with numerous other clubs, colleges, and festivals. Numerous means any number.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/andy_haynes_photo.jpg",
  "PerformerId": "6804",
  "SortOrder": 150,
  "ExcludeFromList": false,
  "id": "6804",
  "pageUrl": "6804-andy-haynes",
  "events": [
   "7652",
   "7665",
   "7730",
   "7796",
   "7804",
   "7918"
  ],
  "mc_events": []
 },
 {
  "Name": "Shane Mauss",
  "Bio": "<p>In 2013 Shane Mauss has had his fifth appearance on Conan, recorded his first one hour special which will be out in early 2014, performed his solo show for a full month in the world&#039;s largest comedy festival The Edinburgh Comedy Festival, and just recorded a TV spot in Australia at The Just For Laughs: Stand-Up Series at The Sydney Opera House.</p>\n<p>Originally from La Crosse, WI, Shane Mauss moved to Boston in 2004 (at the supple, tender age of 23) to pursue his childhood dream of becoming a standup comedian. In less than three years, Shane caught his big break when he was awarded Best Standup Comic at HBO&#039;s US Comedy Arts Festival in 2007.</p>\n<p>Comedy Central Presents: Shane Mauss debuted in 2010 and was accompanied by his first CD Jokes To Make My Parents Proud with Comedy Central Records, which was named in the Top 10 Albums of 2010 by Punchline Magazine.</p>\n<p>Shane&#039;s other TV credits now include two appearances on Conan on TBS, three appearances on Late Night with Conan O&#039;Brien, an appearance on Jimmy Kimmel Live!, Comedy Central&#039;s Live at Gotham, Showtime&#039;s Comics Without Borders, two appearances on BBC&#039;s The World Stands Up, and in what is easily his strangest television appearance to date: Playboy TV&#039;s Night Calls.</p>\n<p>Shane has been in several comedy festivals around the world including The Just For Laughs Festival Comedy Festival in Montreal, Sydney &amp; Chicago, The Bridgetown Comedy Festival in Portland, OR, The Comedy Central South Beach Comedy Festival, The Cat Laughs Comedy Festival in Kilkenny, Ireland, The Sydney Comedy Festival, and The Aspen Rooftop Comedy Festival.</p>\n<p>You may also know him as a regular on The Bob and Tom Show, Sirius Radio, Pandora, Spotify or podcasts such as WTF, You Made It Weird, Doug Loves Movies, Keith and The Girl or as co-host of The Double Date Podcast.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/922215_10151573163889871_1401201246_o_1.jpg",
  "PerformerId": "6280",
  "SortOrder": 150,
  "ExcludeFromList": false,
  "id": "6280",
  "pageUrl": "6280-shane-mauss",
  "events": [
   "7652",
   "7692",
   "7746",
   "7911",
   "7951"
  ],
  "mc_events": []
 },
 {
  "Name": "Jay Larson",
  "Bio": "<p>Jay Larson is a stand up comedian and writer.  BORING! No but he&#039;s really funny guys, come on, listen!  Jay&#039;s unique perspective and original voice have been Jay&#039;s calling card since doing the prestigious Montreal Comedy Festival in 2005.  Since then he has been a regular at Bridgetown Comedy Festival, had his own half hour special on Comedy Central, performed at SXSW, and has made 5 Late night appearances.  While most people see stand up comedians as Joke tellers, Jay sees himself as more of a storyteller.  He cemented himself as a storyteller by performing one single story on Conan in 2013.  The response was amazing and the YouTube video of the set went viral.  Jay attributes his storytelling success to his extremely popular podcast, The CrabFeast.  This conversational storytelling podcast has a cult following that grows weekly.  Released every Toozdee at TheCrabFeast.com, Jay&#039;s podcast has featured some of comedy&#039;s best story tellers and comics.  He is currently in development with NBC Universal Studios, and hopes to put his storytelling onto the silver screen so he never has to prove himself through a BIO again.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/524644_10200612388365104_2023088941_n.jpg",
  "PerformerId": "6810",
  "SortOrder": 150,
  "ExcludeFromList": false,
  "id": "6810",
  "pageUrl": "6810-jay-larson",
  "events": [
   "7667",
   "7668",
   "7680"
  ],
  "mc_events": []
 },
 {
  "Name": "Brendon Walsh",
  "Bio": "<p>Originally from Philadelphia, PA, Brendon Walsh established himself as a comedian in Austin, TX.  In 2004, he won the “Funniest Person In Austin” contest, and that same year also appeared on ABC’s “Jimmy Kimmel Live” as his original character, “Scary Monster” (a terrible monster stand up comedian).  In 2005 and 2006, Brendon was voted “Best Stand-Up Comedian” in the Austin Chronicle’s “Readers Poll”.  In 2006 he appeared on Comedy Central’s “Premium Blend” and on season 4 of NBC’s “Last Comic Standing.”  In 2007, he won the $10,000 grand prize on the comedy stage in an internet contest at Famecast.com, beating thousands of other people for the prize money and title of “Famecast Comedy Fenom”.  Brendon was featured in the “New Faces” Showcase at the 2008 Just For Laughs comedy festival in Montreal where he was recognized as one of the breakout performers, returning in 2010 and 2012 to record standup performances for HBO.</p>\n<p>In 2009, Brendon moved to Los Angeles where he can be regularly seen performing at the likes of Largo, the Upright Citizens Brigade Theater, Improv, Comedy Store as well as several alternative rooms. His TV credits also include being the first stand up to appear on TBS’ CONAN, and Comedy Central’s John Oliver’s New York Standup Show. Since moving to LA, Brendon has sold two scripted vehicles to star in and co-write.  In 2010 he sold “Crowded Apartment” to Spike.  Most recently Brendon has been writing the pilot of “Walsh,” a half hour narrative for Comedy Central, and he recorded his Comedy Central Stand Up Presents: The Half Hour special, which premiered in May, 2012 as the highest rated episode of the season. In 2013, Brendon performed at the Melbourne Comedy Festival, appeared on IFC’s &quot;MARON,&quot; FX’s &quot;LEGIT,&quot; and Comedy Central’s &quot;@MIDNIGHT,&quot; and is currently headlining across America.  His debut CD will be released in 2014.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/brendon032.jpg",
  "PerformerId": "6834",
  "SortOrder": 150,
  "ExcludeFromList": false,
  "id": "6834",
  "pageUrl": "6834-brendon-walsh",
  "events": [
   "7639",
   "7675",
   "7737",
   "7743"
  ],
  "mc_events": []
 },
 {
  "Name": "Amber Tozer ",
  "Bio": "<p>Amber Tozer is a stand up comic, writer, and actress living in Los Angeles.  She has built a Twitter following of over 35K users, and her witty tweets have been featured on shows such as Jimmy Fallon, and Ellen among others. She co-created #nitTWITS, a Twitter-based web series, which features writers and performers from SNL, Modern Family, The Office, and Conan. Amber has written for Cartoon Network&#039;s animated sketch series MAD, and Adult Swim&#039;s Moral Orel. Tozer has also made appearences on Last Comic Standing, and in the Montreal Just for Laughs Festival. She recently inked a development deal with FOX ADHD for an animated series based on her life!</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/ambertozer.jpg",
  "PerformerId": "6608",
  "SortOrder": 175,
  "ExcludeFromList": false,
  "id": "6608",
  "pageUrl": "6608-amber-tozer-",
  "events": [
   "7621",
   "7650",
   "7687",
   "7752",
   "7811",
   "7916"
  ],
  "mc_events": []
 },
 {
  "Name": "Auggie Smith",
  "Bio": "<p>Auggie has appeared on Comedy Central and is a frequent guest on the Bob &amp; Tom Radio Show. In 2010, he became the first comic to win both the Seattle and San Francisco Comedy Competitions in the same year. When Auggie takes the stage, audiences across the country quickly realize that they’re in for an evening of riveting, take-no-prisoners stand-up comedy. During Auggie’s set, pop culture and political targets are dissected piece by piece into intelligently written manic rants. His seamless rapid fire style has developed a loyal following across the country. He has spent most of the last two decades keeping a constant road schedule honing his craft and creating a truly memorable, relevant, and constantly evolving live experience.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/auggiesmith.jpg",
  "PerformerId": "6857",
  "SortOrder": 175,
  "ExcludeFromList": false,
  "id": "6857",
  "pageUrl": "6857-auggie-smith",
  "events": [
   "7658",
   "7690",
   "7702",
   "7734",
   "7746",
   "7808"
  ],
  "mc_events": [
   "7722"
  ]
 },
 {
  "Name": "Tony Camin",
  "Bio": "<p>Tony has appeared on Late Night with Conan O&#039;Brien, Jimmy Kimmel Live, Real Time with Bill Maher, and lots of other shows that have been cancelled. He&#039;s has performed at The Just For Laughs Festival in Montreal as well as The HBO US Comedy Arts Festival in Aspen, as well as the Melbourne Comedy festival in Australia. As an in-demand writer of awesome &quot;comedic&quot; humor, Tony has written on programs for NBC, VH1, and Comedy Central. All of which have been cancelled. He&#039;s is also a co-creator, and performer of the hit off -Broadway play, The Marijuana-Logues, and was recently seen as a ‎correspondent on The Media Project for IFC.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/_dsf0829nnnttt.jpg",
  "PerformerId": "5938",
  "SortOrder": 175,
  "ExcludeFromList": false,
  "id": "5938",
  "pageUrl": "5938-tony-camin",
  "events": [
   "7628",
   "7679",
   "7694",
   "7915"
  ],
  "mc_events": [
   "7703"
  ]
 },
 {
  "Name": "Mark Normand",
  "Bio": "<p>Mark Normand is a smart, fun-loving comedian based in New York City. So far in 2014, Mark is set to appear on NBC’s Last Comic Standing, and his Comedy Central Presents: THE HALF HOUR and his debut CD will be premiere this summer! </p>\n<p>Mark has previously appeared on Comedy Central’s @MIDNIGHT, TBS’s CONAN, Comedy Central’s INSIDE AMY SCHUMER, MTV Other’s INSIDE JOKE, Comedy Central’s JOHN OLIVER’S NEW YORK STAND UP SHOW, and won the 2013 Caroline&#039;s March Madness competition, beating out 63 other comedians. This is a shocker for all of us but he was also voted Village Voice&#039;s &quot;Best Comedian of 2013&quot;, I know right? Quit bragging!!!</p>\n<p>Mark was born and raised in New Orleans, LA surprisingly to two normal parents. As a kid he spent most of his time shooting short films and wetting the bed. Mark started doing comedy right after college and quickly moved to New York. Mark now does comedy clubs and colleges across the country and has been involved in many festivals including Portland, Seattle, DC, Boston, and was featured as a New Face at the Montreal Comedy Festival, where he recorded a set for Canadian TV. In NYC Mark now runs two comedy shows and two podcasts in NYC, “Hot Soup” a weekly show, “We&#039;re all Friends Here”, a live show also recorded as a podcast, and &quot;Tuesdays with Stories!”, a podcast from Stand Up NY Labs.</p>\n<p>More annoying accolades: Mark was named one of Comedy Central’s Comics To Watch for the 2011 New York Comedy Festival. Mark was also named to Esquire’s “Best New Comedians 2012”, Splitsider’s “Top 10 Up and Coming Comedians on Each Coast”, and Time Out New York’s “21 New York Comedy Scene Linchpins”. </p>\n<p>Mark still lives in New York City. </p>\n<p>Check him out at marknormandcomedy.com</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/mark-normand4074-2.jpg",
  "PerformerId": "6822",
  "SortOrder": 175,
  "ExcludeFromList": false,
  "id": "6822",
  "pageUrl": "6822-mark-normand",
  "events": [
   "7624",
   "7746",
   "7796",
   "7912",
   "7918"
  ],
  "mc_events": []
 },
 {
  "Name": "Dwight Slade",
  "Bio": "<p>Part man, part ageless boy; comedian Dwight Slade has the privilege of being a comedy legend in American stand up.  The winner of the 2008 Boston Comedy Festival, Slade combines an intelligent, raging voice of justice with the snickering attitude of a high school prankster. He gives the impression of a man on a journey who enjoys nothing more than making fun of everything along the way.</p>\n<p>The 90’s found Dwight moving into new arenas of creativity.  Radio station KXL-AM billed him as “The Northwest’s Most Dangerous Mind” as he became a noted talk radio personality who used humor instead of rage to engage listeners.  He released two comedy CD’s on Humor Ink recordings, \"Weird State,\" and “Shut-up.”</p>\n<p>Slade’s feature film debut came in 2000 in the movie “Inconceivable,” which enjoyed a run on Showtime and Lifetime.  Slade also co-starred in the gritty family drama, “My Way Home” which won the Platinum Award at the 2001 Houston International Film Festival. Since then, Slade has made appearances in three feature films including the soon to be released James Westby film, “Rid Of Me.”</p>\n<p>In 2002, Slade became the first stand-up to make appearances at the three major North American Comedy Festivals: Aspen, Chicago and Montreal.  On the heels of his performances, Slade signed a development deal with Warner Brothers Television.  Slade was chosen to appear on HBO’s “Best of the US Comedy Arts Festival” and made an appearance on Comedy Central’s Premium Blend.</p>\n<p>Slade’s stand-up has gained international stature after earning a five star review from Scotland’s Minister of Culture at the prestigious Edinburgh Fringe Festival and appearances at the Montreal Just For Laughs Festival.   He followed this with a tour in Afghanistan performing for US Troops, a tour of Israel. After a stellar performance at the 2008 Comedy Festival in Las Vegas, Slade was chosen to appear on a Tonight Show feature. </p>\n<p>Slade’s comedy special “Right &amp; Raunch” is now available on DVD.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/dwightslade.jpg",
  "PerformerId": "6864",
  "SortOrder": 175,
  "ExcludeFromList": false,
  "id": "6864",
  "pageUrl": "6864-dwight-slade",
  "events": [
   "7688",
   "7740",
   "7808",
   "7915"
  ],
  "mc_events": []
 },
 {
  "Name": "Ryan Sickler",
  "Bio": "<p>If the adage is true — that tragedy plus time equals comedy — then Ryan Sickler has paid his dues on the left side of the equation.  Born in Baltimore, Ryan lost his father when he was 16, was thrown into the street by his mother and after that, bounced from one relative to another.  It was finally a great-aunt who gave him the chance to get back on his feet and when he did, he did it like he meant it.</p>\n<p>Ryan worked, saved, finished school, packed all his stuff into garbage bags and drove to Los Angeles to follow his dream of being a comic. And while his early years might have seemed rocky, that tumultuous childhood gave him both fodder for material and armor against the relentless onslaught that is life as a standup comic.</p>\n<p>His television appearances include Comedy Central’s Tosh.O, Live At Gotham, Cutman and The Late Late Show.  Ryan is also an informed sports fan and appeared as a regular on Fox Sports.  He has written for his hometown Baltimore Ravens on NFL.com and for Joan Rivers.</p>\n<p>Beyond standup, Ryan Sickler is an engaging storyteller.  You can catch him every Tuesday on his podcast, The CrabFeast.  Inspired by his hometown, the show celebrates the things Ryan loves most — storytelling, family, friends and comedy.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/emailable_headshot.jpg",
  "PerformerId": "6092",
  "SortOrder": 175,
  "ExcludeFromList": false,
  "id": "6092",
  "pageUrl": "6092-ryan-sickler",
  "events": [
   "7668",
   "7679",
   "7749"
  ],
  "mc_events": []
 },
 {
  "Name": "David Smithyman",
  "Bio": "<p>Failing to ever fulfill his true potential as a child actor, David Smithyman moved from Australia to New York City in 2004. Since then, he has performed in numerous showcases for IFC, MTV, and Comedy Central, in addition to representing NBC, first as a finalist in 2013&#039;s Stand Up For Diversity competition in Los Angeles, and then as a touring member of Stand Up NBC&#039;s national college tour. Currently, he works helping kids write their own stand-up at Gotham Comedy club as part of the Kids ’n Comedy program.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot_19.jpg",
  "PerformerId": "6476",
  "SortOrder": 175,
  "ExcludeFromList": false,
  "id": "6476",
  "pageUrl": "6476-david-smithyman",
  "events": [
   "7689",
   "7913",
   "7951",
   "7967",
   "8631"
  ],
  "mc_events": []
 },
 {
  "Name": "Ian Karmel",
  "Bio": "<p>Ian Karmel is a homegrown Portland comedian whose style zig-zags between the eclectic and the universal. He is currently a writer and roundtable regular on E!’s &quot;Chelsea Lately.&quot;  In 2013, Ian was invited to the prestigious Just for Laughs Festival in Montreal, where he was a breakout stand up in the New Faces category. Ian’s unique perspective helped him win the 2011 Funniest Person in Portland, 2010 Portland Amateur Comedy Competition, and has given him the opportunity to perform at the Moontower Comedy Festival, Bridgetown Comedy Festival, Bumbershoot, Portland’s Helium Comedy Club, Philadelphia’s Helium Comedy Club, Minneapolis&#039; Acme Comedy Club, Austin’s Cap City Comedy Club, Seattle’s Comedy Underground, and various clubs in Los Angeles. Ian’s other television credits include IFC’s Portlandia and the Travel Channel’s Best Sandwich in America, as well as a post-game analyst and commentator for the Portland Trailblazers.  His training includes The Groundlings and the Upright Citizens Brigade, and he is a regular contributor for the Portland Mercury. He currently lives in Los Angeles.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/ian_karmelheadshot.jpg",
  "PerformerId": "6824",
  "SortOrder": 175,
  "ExcludeFromList": false,
  "id": "6824",
  "pageUrl": "6824-ian-karmel",
  "events": [
   "7645",
   "7646",
   "7648",
   "7667",
   "7783",
   "7807"
  ],
  "mc_events": []
 },
 {
  "Name": "Hampton Yount",
  "Bio": "<p>Hampton was born in Virginia, started comedy in DC, aged four years, and now lives in Los Angeles. Hampton won the DC Improv Comedy Competition in 2008 and other lesser important comedy contests in VA. He’s been a recurring presence at the Bridgetown Comedy Festival, South By Southwest, The DC Comedy Festival and the Bentzen Ball Comedy Festival, and was a semi-finalist at the Laughing Skull Festival, and was recently named one of Esquire’s best new stand up comedians of 2012. Hampton was previously a creative consultant on Rob Dyrdek&#039;s Fantasy Factory(MTV), a writer for Loiter Squad (Adult Swim) and Upload with Shaq (TruTV) and is currently a creative consultant on Ridiculousness on MTV, and wrote on Chris Hardwick’s pilot Hardwired (Comedy Central). Hampton has appeared on the G4 Network, done contributing writing for Chelsea Lately, and performed his stand up to millions of listeners on the Bob and Tom Radio Show and the Nerdist Podcast. Most recently, Hampton appeared on ComedyCentral.com for Comedy Central’s Comics To Watch at the NY Comedy Festival in 2012, and on Adam Devine’s House Party (Comedy Central) in 2013. </p>\n<p>Hampton also makes a webcomic with his brother Clay Yount: <a href=\"http://www.robandelliot.com\">www.robandelliot.com</a>.  It has an awesome fanbase and has been a critics&#039; favorite.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/hampton_yount.jpg",
  "PerformerId": "6825",
  "SortOrder": 175,
  "ExcludeFromList": false,
  "id": "6825",
  "pageUrl": "6825-hampton-yount",
  "events": [
   "7625",
   "7663",
   "7749",
   "7796",
   "7805",
   "8635"
  ],
  "mc_events": []
 },
 {
  "Name": "Mary Mack",
  "Bio": "<p>Folk humorist and comedian Mary Mack is a favorite on radio shows and podcasts around the country, including Marc Maron&#039;s WTF Podcast, The Bob and Tom Show, and American Public Media&#039;s WITS live show and podcast.  Her comedy (spotted with occasional mandolin or clarinet outbursts) has  been seen in the Vancouver Comedy Fest, The Andy Kaufman Awards, Montreal’s Just For Laughs Festival, and the San Francisco Sketch Fest as one of &quot;The Dozen&quot; up and coming headliners designated by the festival.  She is a main voice on Fox&#039;s new late night ADHD cartoon &quot;Golan the Insatiable.&quot;  Mack divides her time among Los Angeles,  Minneapolis, and a camper in the woods in Northern Wisconsin.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/mary_mack.jpg",
  "PerformerId": "7566",
  "SortOrder": 175,
  "ExcludeFromList": false,
  "id": "7566",
  "pageUrl": "7566-mary-mack",
  "events": [
   "7689",
   "7698",
   "7708",
   "7915",
   "7916"
  ],
  "mc_events": [
   "7650"
  ]
 },
 {
  "Name": "James Davis",
  "Bio": "<p>James is a stand-up comedian, writer, and actor. James was named one of the “New Faces” at the prestigious Just For Laughs Festival in Montreal in 2012, and can recently be seen in the new hit show &quot;Real Husbands of Hollywood&quot; on BET. He is also a round table regular on &quot;Chelsea Lately.&quot;</p>\n<p>James is the darling of Funny Or Die, and has written, directed, and starred in massive hits for the site, with “Baracka Flacka Flames” reaching 8 million views. James is the go-to impressionist for Barack and Kobe, and has created many of his own original characters.  He is currently developing The James Davis Show for E!, which is being produced by Funny Or Die and Will Ferrell’s production company Gary Sanchez Productions. He also just shot six episodes of Russell Simmon’s All Def Digital YouTube Channel, and is a regular on “Wild n Out” and Lil Duval’s ‘Ain’t That America’. Both premiered on MTV in 2013.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/jamesdavis_superserious.jpg",
  "PerformerId": "6839",
  "SortOrder": 175,
  "ExcludeFromList": false,
  "id": "6839",
  "pageUrl": "6839-james-davis",
  "events": [
   "7699",
   "7703",
   "7730",
   "7733"
  ],
  "mc_events": [
   "7694"
  ]
 },
 {
  "Name": "Billy Wayne Davis",
  "Bio": "<p>Since getting his start in his hometown of Nashville, TN, Billy Wayne Davis has performed in virtually every corner of the United States. He has appeared on TruTV and written for NFL on FOX. His festival credits include the Bridgetown Comedy Festival, the Laughing Skull Comedy Festival, Bumbershoot, and Sketchfest in San Francisco. His Rooftop Records release, Billy Wayne Davis, was featured on Sirius XM and named one of Paste Magazine&#039;s Top Ten comedy albums of 2012</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/billy-wayne-davis-4205-4.jpg",
  "PerformerId": "6029",
  "SortOrder": 175,
  "ExcludeFromList": false,
  "id": "6029",
  "pageUrl": "6029-billy-wayne-davis",
  "events": [
   "7623",
   "7699",
   "7737",
   "7951",
   "8633"
  ],
  "mc_events": []
 },
 {
  "Name": "Andy Erikson",
  "Bio": "<p>Andy was hit in the head by a bird as a kid, and that’s how she got her powers. Soon after, she decided to be a comedian. In 2009 she was voted MVP at the Aspen Rooftop College Comedy Festival, and that same year she was a semi-finalist for the Andy Kaufman Award.  In 2013, she was a finalist at The Great American Comedy Festival. Her favorite thing about comedy is making friends.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/image_3.jpg",
  "PerformerId": "6284",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "6284",
  "pageUrl": "6284-andy-erikson",
  "events": [
   "7706",
   "7730",
   "7751"
  ],
  "mc_events": []
 },
 {
  "Name": "Kellen Erskine",
  "Bio": "<p>Kellen Erskine was a finalist of the San Francisco International Comedy Competition. Recently, he was featured in a Reader&#039;s Digest article entitled &quot;Comics You Haven&#039;t Heard of . . . Yet.&quot; Kellen also appeared on season 7 of NBC&#039;s &quot;America&#039;s Got Talent,&quot; and now he opens regularly for Frank Caliendo.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot_3_0.jpg",
  "PerformerId": "6766",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "6766",
  "pageUrl": "6766-kellen-erskine",
  "events": [
   "7623",
   "7752",
   "7919"
  ],
  "mc_events": []
 },
 {
  "Name": "Bri Pruett",
  "Bio": "<p>Bri Pruett is a stand-up comic and improviser from Portland, Oregon.  She’s appeared at the Bridgetown Comedy Festival and the All Jane No Dick comedy festival.  She was recently named one of the &quot;Top 5 Funniest Comedians in Portland&quot; by Willamette Weekly.  In the fall of 2013, Bri was one of 35 comics selected from 1,300 applicants to perform in the Seattle International Comedy Competition.</p>\n<p>For eight years she’s worked with Action/Adventure Theater, a non-profit independent theater and black box venue that produced an original sketch show called &quot;Making Sex&quot; (in which The Portland Mercury said Bri showed, ”razor sharp comic timing”). She’s been the comedy sidekick and director and head writer for &quot;Late Night Action with Alex Falcone,&quot; a live, talk/variety show.</p>\n<p>She is a regular host and performer at Curious Comedy Theater and a regular player with improv singing-ensemble, Pipes.  Bri is the semi-weekly host of Curious Comedy’s Saturday Night showcase of Portland comics and special guests.  She is a regular MC for the Funhouse Follies Burlesque troupe.  She also writes a regular column for the Portland Mercury on sex and dating in Portland called, &quot;Let&#039;s Do It with Bri Pruett.&quot;</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/bricomedy10.jpg",
  "PerformerId": "6527",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "6527",
  "pageUrl": "6527-bri-pruett",
  "events": [
   "7694",
   "7706",
   "7746",
   "7810",
   "7811"
  ],
  "mc_events": [
   "8579"
  ]
 },
 {
  "Name": "Melissa Villasenor",
  "Bio": "<p>From Los Angeles, stand-up comedian and voice impressionist Melissa Villasenor is best known from Season 6 of &quot;America&#039;s Got Talent.&quot; She&#039;s done voices for &quot;Adventure Time&quot; and &quot;Family Guy.&quot; Her four song EP, &quot;Leap,&quot; is out on iTunes. Last year, her one person show &quot;Melissa!&quot; had a two month run at the Steve Allen Theater in Hollywood. It was directed and produced by comedian Ron Lynch.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/384251_513533271999012_1690821256_n.jpg",
  "PerformerId": "5998",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "5998",
  "pageUrl": "5998-melissa-villasenor",
  "events": [
   "7638",
   "7675",
   "7740",
   "7741",
   "7804",
   "7809"
  ],
  "mc_events": []
 },
 {
  "Name": "Randy Liedtke",
  "Bio": "<p>Originally from Oregon and now living in Los Angeles, Randy Liedtke was named one of Comedy Central's Comics to Watch in 2013. You may have seen him on IFC's Maron, Cartoon Network's Adventure Time, or heard his award winning podcast The Bone Zone that he co-hosts with Brendon Walsh.  Lou Dobbs said he is \"beyond council\".</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/randyliedtke.jpg",
  "PerformerId": "7580",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "7580",
  "pageUrl": "7580-randy-liedtke",
  "events": [
   "7675",
   "7685",
   "7915",
   "7918"
  ],
  "mc_events": []
 },
 {
  "Name": "Nick Rutherford",
  "Bio": "<p>Nick Rutherford is a comedian hailing from Thousand Oaks, CA.  He was honored to be a &quot;Fresh Face Of Comedy&quot; at the Just for Laughs Festival in Montreal, and was recently named one of the &quot;Top Ten Up and Coming Comics on the West Coast&quot; by Splitsider Magazine.   </p>\n<p>Nick  recently made his motion picture debut at Sundance in the feature &quot;Toy&#039;s House&quot; starring Nick Offerman and Megan Mullaly, and will be in the upcoming comedy &quot;Intramural&quot; premiering at SXSW. </p>\n<p>He has written for Adult Swim&#039;s &quot;Loiter Squad&quot; and currently writes at FOX for the animated shows &quot;Axe Cop&quot; and the upcoming &quot;Major Lazer.&quot;</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/rutherfordpress.jpg",
  "PerformerId": "6371",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "6371",
  "pageUrl": "6371-nick-rutherford",
  "events": [
   "7628",
   "7645",
   "7658",
   "7741",
   "7914"
  ],
  "mc_events": []
 },
 {
  "Name": "Dave Anderson",
  "Bio": "<p>A nationally touring comedian, Dave Anderson has performed at the country’s premier comedy clubs, including the world famous Improv in Los Angeles. He has appeared on numerous television shows such as: “Star Search,” Showtime’s “Comedy Club Network,” and “An Evening at the Improv.” His comedy is heard around the world on Sirius and XM satellite radio. Most recently Dave was a contributing writer for the “Tonight Show with Jay Leno.”<br />\nDave is currently an Emmy award winning co-host of the long running morning television talk show “AM Northwest” on KATU TV and co- host of the  ”Mark and Dave Show” on AM 860 KPAM radio in Portland.</p>\n<p>Dave’s unique ability to blend clean, intelligent material with audience interaction has made him a favorite at corporate events and college campuses across America.</p>\n<p>The audience plays a major role in Dave’s show. He has an amazing ability to turn ordinary conversations into hilarious comedy routines while remaining clean and inoffensive. The Oregonian dubbed him “The quickest wit around.” The San Francisco Examiner said he was, “relaxed, likeable, and funny . . .” Willamette Week said, “He ad- libs better than most comedians write.” Because of his quick wit and audience rapport, no two shows are ever exactly alike.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/dave_anderson_photo.jpg",
  "PerformerId": "7823",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "7823",
  "pageUrl": "7823-dave-anderson",
  "events": [
   "7808"
  ],
  "mc_events": []
 },
 {
  "Name": "Dan Levy",
  "Bio": "<p>As a sophomore at Emerson College, Dan was chosen to compete at the HBO US Comedy Arts Festival in Aspen, CO, where he won the title of Funniest College Comedian. </p>\n<p>Since then, Dan has been seen at the Montreal Just For Laughs Comedy Festival numerous times, NY Comedy Fest, SF Sketch Fest, and has made TV appearances on Comedy Central’s “Premium Blend,” “Comedy Central Presents,” “The Late Late Show,” “Chelsea Lately,” and “@Midnight.” He has also hosted several cancelled MTV shows and starred in a bunch of un-aired pilots. His Comedy Central album “Congrats on Your Success” released in 2012, debuted in the top 3 on ITUNES. </p>\n<p>Currently, Dan lives in Los Angeles with his wife and baby Abe where he is writing on the FOX sitcom MULANEY and collecting sneakers. His wife would like him to stop with the sneakers.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/img_1635-1.jpg",
  "PerformerId": "7581",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "7581",
  "pageUrl": "7581-dan-levy",
  "events": [
   "7698",
   "7745"
  ],
  "mc_events": [
   "7639"
  ]
 },
 {
  "Name": "Art Krug",
  "Bio": "<p>Art Krug is an enigma, which is defined in the dictionary as: “a German built enciphering machine made for commercial use and later adapted for military use”. He is also a very funny comedian. Art Krug also writes about himself in the third person…like now for instance. He has appeared on television (Showtime, commercials), comedy club and college stages, boats, buses, and picnic tables since the ’80s. And people keep asking him back. So that’s good.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/art_8x10ish.jpg",
  "PerformerId": "7824",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "7824",
  "pageUrl": "7824-art-krug",
  "events": [],
  "mc_events": [
   "7808"
  ]
 },
 {
  "Name": "Chris Locke",
  "Bio": "<p>Chris Locke is a stand up comedian, actor, and writer from Toronto, Canada. He performs stand up all over Canada and the U.S. at festivals, in comedy clubs, and independent shows. He was voted &quot;Best Stand Up 2012.&quot;</p>\n<p>Chris just finished performing as a headliner, one of the 42 for this year’s JFL42 festival in Toronto. Other comedy festivals of note that he has performed at are: Just For Laughs in Montreal,  SF Sketchfest in San Francisco, the Bridgetown Comedy Festival in Portland, and NXNE.</p>\n<p>With his unique style of stand up, Chris has opened for comedians such as Todd Barry, Hannibal Burress, Eugene Mirman, Pete Holmes, Todd Glass, and toured opening for Kyle Kinane. </p>\n<p>Chris has appeared on many television shows and is most recognized for his regular appearances on &quot;Showtown&quot; on MTV Canada. He has also appeared on &quot;The LA Complex&quot; on CTV and the CW, &quot;Scare Tactics&quot; on Much Music, &quot;Cock&#039;d Gunns&quot; on Showcase, &quot;Match Game&quot; and &quot;The Jon Dore Television Show&quot; on The Comedy Network, and has lent his distinct voice to CBC’s Radio One.</p>\n<p>Chris was also a key producer of one of Toronto&#039;s most well known weekly comedy shows, &quot;Laugh Sabbath,&quot; which took place at The Rivoli. His monthly Laugh Sabbath show with co-host Aaron Eves called, &quot;Let&#039;s Get Hot!&quot; ran for six years and introduced a combination of alternative and mainstream comedy to downtown audiences. The show featured recurring character pieces by Nathan Fielder, Kathleen Phillips, and Brian Barlow, as well as abstract comedy by artist Jon McCurley.</p>\n<p>Chris has written and performed in countless comedy shorts. They have been screened at Just For Laughs, TIFF, NFB&#039;s World of Shorts, CIFF (Calgary International Short Film Festival) and at live shows. His &quot;These Moments Too&quot; series which he co-produced with Nathan Fielder was a best of 2006 pick in NOW magazine.<br />\nHis success in comedy shorts has lead him to hosting and curating a night of independent comedy shorts for CFC&#039;s annual Worldwide Short Film Festival, which he did for Three years.</p>\n<p>In sketch comedy Chris’s sketch troupe with Brian Barlow called, &quot;The Gurg,&quot; was nominated for the prestigious Tim Sim’s Encouragement Fund in 2003, which lead to appearances on &quot;The Cream Of Comedy&quot; on Comedy Network and &quot;The Toronto Show.&quot; His other sketch troupe, Dinkus, which also featured Graham Wagner, Michael Balazo, Aaron Eves, Brian Barlow, was critically acclaimed and performed in New York, Montreal, and the Toronto Sketch Comedy Festival two years in a row.</p>\n<p>His written humor has been published in The Grid weekly, and ION magazine.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/chris_locke_colour_2.jpg",
  "PerformerId": "5889",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "5889",
  "pageUrl": "5889-chris-locke",
  "events": [
   "7646",
   "7740",
   "7746"
  ],
  "mc_events": [
   "7624"
  ]
 },
 {
  "Name": "Bryan Cook",
  "Bio": "<p>Bryan Cook is a writer and comedian based in LA.  Cook is the host and creator of Competitive Erotic Fan Fiction, presented every month at the esteemed Nerdmelt Theater in LA, as well as all over the US. In 2012, he was featured as an opening act on Kyle Kinane’s Great Mistakes Tour, and has performed at the SF Sketchfest, Bridgetown Comedy Fest, Riot LA, and Bumbershoot Festival. Bryan is a contributor to McSweeney’s and was most recently a staff writer on E!’s “Fashion Police”.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/bryan_cook.jpg",
  "PerformerId": "6379",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "6379",
  "pageUrl": "6379-bryan-cook",
  "events": [
   "7641",
   "7667",
   "7678",
   "7703",
   "7918"
  ],
  "mc_events": [
   "7646"
  ]
 },
 {
  "Name": "Susan Rice",
  "Bio": "<p>Susan Rice has never followed the rules where keeping quiet is concerned.  A chatterbox as a child, Rice turned her quirky sense of humor into her life long dream of making people laugh.  </p>\n<p>In 1983 Susan took the jump from professional actress to stand up comic. She moved to Los Angeles and soon found her self appearing on  Evening at the Improv,  Comedy Central as well as George Schlatter&#039; s  Comedy Club.  </p>\n<p>Rice has worked in every venue possible from bars to opening for Jerry Seinfeld, Paula Poundstone, and Rich Shydner.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/photo2.jpg",
  "PerformerId": "7825",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "7825",
  "pageUrl": "7825-susan-rice",
  "events": [
   "7808"
  ],
  "mc_events": []
 },
 {
  "Name": "Jensen Karp",
  "Bio": "<p>Jensen Karp accidentally found himself with a million dollar record deal at age 19 under the moniker Hot Karl on Interscope Records, where he released songs with Kanye West, Redman, Fabolous, Mya and Will.I.Am. Since his time as a rapper, he’s went on to find himself working in professions a little more fitting for his passion for comedy, opening pop culture art galleries (Gallery1988) and writing for “WWE Raw,” FunnyOrDie &amp; “The Howard Stern Show.” He was also Creative Director at the YouTube channel JASH, where he co-wrote and produced the web series &quot;The ArScheerio Paul Show.&quot; </p>\n<p>He recently appeared on the Yahoo/E! Network show “Burning Love&quot; and has collaborated with “Breaking Bad,” “LOST” and “The Academy Awards” on marketing initiatives  and campaigns. He produces and performs in two reoccurring shows in Los Angeles: &quot;Baby Talk w/ Dan Levy&quot; at the NerdMelt Theater and &quot;The Live Read&quot; at UCB.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/clipperpic.jpg",
  "PerformerId": "7590",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "7590",
  "pageUrl": "7590-jensen-karp",
  "events": [
   "7639"
  ],
  "mc_events": [
   "7645"
  ]
 },
 {
  "Name": "Laurie Kilmartin",
  "Bio": "<p>Laurie Kilmartin was a finalist on Last Comic Standing and has appeared on CONAN and Jimmy Kimmel Live. She is the co-author of the NYT bestseller &quot;Sh*tty Mom&quot; and is currently a staff writer on CONAN.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/kilmartin_dion-1.jpg",
  "PerformerId": "7828",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "7828",
  "pageUrl": "7828-laurie-kilmartin",
  "events": [
   "7672",
   "7734",
   "7916"
  ],
  "mc_events": []
 },
 {
  "Name": "Janet Varney",
  "Bio": "<p>Janet Varney is a comedian, actor, writer and producer. She spent seven wonderful years hosting TBS&#039;s &quot;Dinner and a Movie,” recurred on HBO&#039;s Entourage, was a series regular on the beloved E! and Yahoo series Burning Love seasons 1 and 3, and has made guest appearances in hit shows including How I Met Your Mother, Key and Peele, Psych, Bones, on the panel of Chelsea Lately, as a regular co-host on HuffPost Live, and has appeared in films such as Still Waiting, Drillbit Taylor and Judy Moody and the Not Bummer Summer. She is also the voice for the titular character on Nickelodeon&#039;s hit series The Legend of Korra. Janet is the host of the popular Nerdist podcast The JV Club and the co-founder, creative director and producer of SF Sketchfest, the San Francisco Comedy Festival, now in its 14th year.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/janet_headshot_2013.jpg",
  "PerformerId": "7820",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "7820",
  "pageUrl": "7820-janet-varney",
  "events": [
   "7645"
  ],
  "mc_events": [
   "7676"
  ]
 },
 {
  "Name": "Shane Torres",
  "Bio": "<p>Shane Torres is a comedian originally from Texas, but started comedy in Portland, Oregon. In the six years he has been performing stand up, he has made some serious mistakes in his personal life, but has done OK in comedy. He was lucky enough to perform in the very first Bridgetown Comedy Festival and New Orleans Comedy and Arts Festival in his first year and second year of comedy. In 2012 he was chosen as on of Comedy Central&#039;s Comics to Watch and also competed in The Seattle International Comedy Competition.  2013 turned out to be a great year for Shane performing and winning The Funniest Person in Portland contest as well as being chosen by his peers as one of The Willamette Week&#039;s top 5 comics. He also took the stage at Seattle&#039;s Bumbershoot Festival that year. After all that he performed at the prestigious Montreal Just For Laugh&#039;s Comedy Festival as New Face where GQ called him best newcomer in an article where they mentioned much more famous comedians that Shane admires greatly. He really hopes you come out to see him and enjoy the show.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/i0000zhk9nzg8pzc.jpg",
  "PerformerId": "5742",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "5742",
  "pageUrl": "5742-shane-torres",
  "events": [
   "7667",
   "7753",
   "7805"
  ],
  "mc_events": [
   "7740"
  ]
 },
 {
  "Name": "Byron Bowers",
  "Bio": "<p>Described by LA Weekly as “a comic who’s got big ideas and big plans to go big places,” Byron Bowers is a stand-up comedian and actor that has toured nationally with Dave Chappelle, Hannibal Buress, John Caparulo, and Eric Andre and The Eric Andre Show Live. </p>\n<p>He has appeared on the Eric Andre Show on Adult Swim, Comcast TV, and Comedy Central. His stand-up cable debut was on Comedy Central&#039;s &quot;Adam Devine&#039;s House Party&quot; and he can also be seen on the reboot of BET&#039;s &quot;Comic View&quot;. He has won the Big Sky International Comedy Competition and was named by LA Weekly as a “Comedy Act to Watch in 2013”. Byron was featured as New Face at the prestigious Just for Laughs Comedy Festival in 2013.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/byron_bowers_photo.jpg",
  "PerformerId": "6805",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "6805",
  "pageUrl": "6805-byron-bowers",
  "events": [
   "7624",
   "7632",
   "7701",
   "7743",
   "7805"
  ],
  "mc_events": []
 },
 {
  "Name": "Sean Flannery",
  "Bio": "<p>The easiest way to describe Sean Flannery is: he&#039;s attended the wrong wedding (twice). That mostly sums it up.</p>\n<p>On stage, he shares wild, hilarious stories, while showing multimedia from the events: photos, videos, voicemails and more. He recently combined many of these stories into a sold-out, critically-acclaimed one man show, called &quot;Never Been to Paris,&quot; about the last 10 times he nearly killed himself by accident.</p>\n<p>He is also the creator and host of &quot;The Blackout Diaries,&quot; a show where comics plus &#039;real&#039; people (cops, priests, teachers, etc) share true drinking stories and answer questions from the audience.</p>\n<p>He has been named the best comic in Chicago by several publications and his live multimedia shows<br />\nroutinely sellout. He was a featured New Face at Just For Laughs Comedy Festival (Montreal)<br />\nand made his television debut last year, on Comedy Central&#039;s, ”Mashup”.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/seanflannery_headshot.jpg",
  "PerformerId": "6144",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "6144",
  "pageUrl": "6144-sean-flannery",
  "events": [
   "7693",
   "7698"
  ],
  "mc_events": [
   "7742",
   "7914"
  ]
 },
 {
  "Name": "Michael Busch",
  "Bio": "<p>Michael Busch is an actor/writer/producer originally from Mentor, Ohio. He is a regular performer at The Upright Citizens Brigade Theatre in Los Angeles and has also produced multiple shows including The Midnight Show and Nick's Big Talk Show with Nick Thune. Michael has written &amp; produced online content for sites including CC Studios, Above Average, College Humor, Nacho Punch, and Funny or Die. His acting credits include Human Giant, Community, Conan, Pretty Little Liars, and a series of Alltel commercials.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/michaelbusch.jpg",
  "PerformerId": "7773",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "7773",
  "pageUrl": "7773-michael-busch",
  "events": [
   "7741"
  ],
  "mc_events": []
 },
 {
  "Name": "Joselyn Hughes",
  "Bio": "<p>Joselyn Hughes is a Los Angeles based writer and performer. She was recently named one of “18 Funny Women You Should Be Following on Twitter” by the Huffington Post, nominated for the National Lampoon Twitter Awards, featured as one of the “30 Under 30: Comedians You Should Watch” by Splashlife and Funny or Die, and included in Jane Dough&#039;s &quot;30 under 35 Comedians to Watch.&quot;</p>\n<p>She has performed at festivals, clubs, and colleges all over the country. She was a nominee for the 2008  ECNY “Emerging Comic” award, and has been featured in the New York Post, Comedy Smack, MySpace and Atom.com. </p>\n<p>Joselyn has appeared on &quot;Chelsea Lately,&quot; &quot;Tosh.0,&quot; MTV&#039;s &quot;Failosophy,&quot; VH1 and various national commercials. She also has written for Comedy Central,  MTV, VH1, Hello Giggles, and the Huffington Post. Her web series &quot;DIY, Dammit!&quot; can be seen on the Nerdist Channel.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/387.jpeg",
  "PerformerId": "6205",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "6205",
  "pageUrl": "6205-joselyn-hughes",
  "events": [
   "7622",
   "7632",
   "7742",
   "7809",
   "7815",
   "8579"
  ],
  "mc_events": []
 },
 {
  "Name": "Troy Conrad",
  "Bio": "<p>An award winning filmmaker, comic, writer, and producer, the projects Troy has produced, directed have views in the millions.  He is creator and co-executive producer of the improvised stand-up show, Set List: Stand-Up Without A Net, currently airing on Sky Atlantic in the UK, as well as live in Los Angeles, the Comedy Cellar in New York City, and touring festivals worldwide.   He is the executive producer of The David Feldman Show on KPFK Pacifica Radio, and Director of the award winning film, “Runyon:  Just Above Sunset,&quot; starring Eddie Pepitone.  His new show, Prompter, is another way of making solo improvisation a meaningful experience for performers and audiences.</p>\n<p>Having completed the writing programs at Second City Los Angeles Conservatory, iO West, and UCB Theatre,  he continues to create, write, and produce innovative new shows for stage and television.  As a comic, he performed at comedy clubs throughout the U.S., and festivals including Montreal, Dublin, Calgary, Vancouver, Edinburgh, Melbourne, Sydney, Austria, and London - as well as skeptic and atheist conferences throughout the world. Troy moved from Phoenix to Los Angeles in 2003 for the good soil to grow creative projects.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/troy_conrad_pic.jpg",
  "PerformerId": "7802",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "7802",
  "pageUrl": "7802-troy-conrad",
  "events": [],
  "mc_events": [
   "8635",
   "7661"
  ]
 },
 {
  "Name": "Karinda Dobbins",
  "Bio": "<p>Motor City native Karinda Dobbins was born into a politically active family of gifted storytellers and sharp wits. Her worldview was shaped by their accounts of protest, civil rights and empowerment, weighty subjects that were always leavened with humor. Whenever she heard the grownups laughing long past her bedtime, she took that as her cue to sneak out of her room and eavesdrop while they entertained themselves with Richard Pryor records. She not only listened, she learned, developing a relaxed style for delivering pungent commentary.</p>\n<p>Responding to a dare from a girlfriend who challenged her to try making the crowd laugh at an open mic, Karinda finally took the stage at Woody’s Café in Oakland, and killed. Sure, she tried to fill the seats with supportive family and friends, and true, she had no competition since nobody else had signed up for stage time, but everybody, from the show’s host to strangers in the audience, was amazed that she was able to do 15 funny minutes of stand-up material her first time onstage. (She’d shrewdly spent a month writing her act in preparation, never anticipating she’d be put under pressure to perform all of it at once.) </p>\n<p>Spurred on by the enthusiastic feedback, Karinda decided to see where comedy would take her and began honing her craft at more venues. To date, she has appeared at the Michigan Womyn’s Music Festival (MichFest); performed at Bay Area comedy clubs such as Tommy T’s, the Punch Line and Cobb’s; and headlined at San Francisco’s legendary Purple Onion. Karinda recently made her primetime national television debut on NickMom Night Out, a series of stand-up comedy showcases on Nickelodeon and she has opened for Greg Proops and W. Kamau Bell.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/karindadobbins.jpg",
  "PerformerId": "8015",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "8015",
  "pageUrl": "8015-karinda-dobbins",
  "events": [
   "7711",
   "7733",
   "8579",
   "8632"
  ],
  "mc_events": []
 },
 {
  "Name": "Derek Smith",
  "Bio": "<p>Derek Smith is a stand up comic originally from Oklahoma, now living in Chicago.  He was a part of the 2013 Just For Laughs Festival in Chicago, and is a cast member of The Lincoln Lodge.</p>\n<p>Despite being a bag of vices and complaints, he remains likable and lovable, like a smart, irritated teddy bear who makes poor life decisions. He’s been described as disgusting and smart. He could probably write this generation’s definitive dick joke in his sleep. He probably will, but only in between being a hundred kinds of funny, intelligent, and captivating.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/derek_smith.jpg",
  "PerformerId": "6735",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "6735",
  "pageUrl": "6735-derek-smith",
  "events": [
   "7654",
   "7685",
   "7688",
   "7706",
   "7742",
   "7914"
  ],
  "mc_events": []
 },
 {
  "Name": "Karl Hess",
  "Bio": "<p>Karl is a stand-up comedian and actor that was chosen as a New Faces at the Just For Laughs Montreal Festival in 2010 and as a recipient of the Rooftop Comedy&#039;s 2011 Silver Nail Award, which awards a select group of emerging comedians each year. Karl has also performed for the last three years at the Bridgetown Comedy Festival in Portland, and was a finalist at the Laughing Skull Comedy Festival in 2010. He is currently a writer on MTV&#039;s &quot;Ridiculousness&quot;.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/karl_hess_hs_2.jpg",
  "PerformerId": "6646",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "6646",
  "pageUrl": "6646-karl-hess",
  "events": [
   "7689",
   "7697",
   "8633"
  ],
  "mc_events": [
   "7706"
  ]
 },
 {
  "Name": "Bryan Safi",
  "Bio": "<p>Bryan Safi is a writer and performer living in Los Angeles. He is the co-host of the popular podcast \"Throwing Shade,\" which tackles lady issues and gay issues and treats them with much less respect than they deserve. He is the host/writer/co-creator of Current TV's “That's Gay.” He was also staff writer at The Ellen DeGeneres Show, for which he won an Emmy Award, has written for Joan Rivers on Fashion Police, and before that, was a staff writer at the comedy website \"Funny or Die.\" He is a regular performer at the Upright Citizens Brigade Theatre in Los Angeles.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/bryansafi.jpg",
  "PerformerId": "7894",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "7894",
  "pageUrl": "7894-bryan-safi",
  "events": [
   "7644"
  ],
  "mc_events": []
 },
 {
  "Name": "Dave Stone",
  "Bio": "<p>Based in Los Angeles by way of Atlanta, Dave made his television debut on “The Late Late Show with Craig Ferguson” in 2013, and in the same year was selected to the prestigious “New Faces” showcase at the Just For Laughs Comedy Festival in Montreal, as well as being named one of the “12 Comics to Watch” by L.A. Weekly Magazine. </p>\n<p>Dave can also be heard voicing several characters on Adult Swim’s hit animated series “Squidbillies” on the Cartoon Network and was a co-founding member of the nationally acclaimed “Beards of Comedy Tour”, who released their sophomore album “Cardio Mix” on Comedy Central Records in 2011. Since 2008, Dave has spent 175+ days a year on the road, sharing stages with some of the industry’s brightest stars, such as Brian Regan, Patton Oswalt, Maria Bamford, Marc Maron, Kyle Kinane and John Mulaney. Dave’s laid back and self-deprecating style make him a hit with a wide variety of audiences, transcending age, race, class, gender, height and weight.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/dave_-_low-res_headshot.jpg",
  "PerformerId": "6325",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "6325",
  "pageUrl": "6325-dave-stone",
  "events": [
   "7622",
   "7691",
   "7697",
   "7745"
  ],
  "mc_events": [
   "7916"
  ]
 },
 {
  "Name": "Mark Forward",
  "Bio": "<p>From the start, comedian Mark Forward was a breakout talent. He was a finalist for the Phil Hartman Award for Best Up &amp; Coming Stand-up and Yuk Yuk’s Funniest New Comic in the year 2000. He kept on winning. He won the Canadian Comedy Award for Best Stand-up Newcomer in 2005 and the Homegrown Comic Competition at his first appearance at the prestigious Just For Laughs Festival in Montreal in 2006. In 2008 he won his second Canadian Comedy Award for Best Writing on a Series (The Jon Dore Television Show) and in 2012, he won his third Canadian Comedy Award, this time for Best Taped Live Performance (The Late Late Show with Craig Ferguson). This year he received two Canadian Comedy Award-nominations for Best Male Stand-up (his third nomination in this category) and Best Taped Live Performance and was nominated for NOW Magazine’s Best of Toronto Award for Best Male Stand-up.</p>\n<p>Forward is currently shooting his third season of &quot;Mr. D.&quot; He is a staff writer and plays the recurring character Mr. Leung on the hit CBC series. He wrapped production on the feature film &quot;No Stranger Than Love&quot; where he plays a principal role opposite Alison Brie, Justin Chatwin and Colin Hanks and is was featured on John Oliver’s New York Stand-Up Show (Comedy Central) and Just For Laughs: All Access (The Comedy Network) for which he received a Canadian Comedy Award-nomination.</p>\n<p>For two seasons, Forward was on the writing staff of &quot;The Jon Dore Television Show&quot; (The Comedy Network/IFC) and played a variety of characters on the show. </p>\n<p>Forward performs at festivals and headlines at clubs across the country including multiple appearances at the Just For Laughs Festival, the Ha!ifax ComedyFest and the Ottawa Blues Festival. </p>\n<p>He has appeared on The Late Late Show with Craig Ferguson (CBS), John Oliver New York Stand-Up show (Comedy Central) and starred in his own stand-up special Comedy Now! (CTV, The Comedy Network). He has made guest appearances on a number of television shows including Just for Laughs (CBC) for which he received a Canadian Comedy Award-nomination, Living in Your Car (TMN), Doc (PAX), The Newsroom (CBC) and Degrassi: The Next Generation (CTV). Selected film credits include The Rocker with Rainn Wilson, Josh Gad and Christina Applegate, Puck Hogs and Breakfast with Scott with Tom Cavanagh.</p>\n<p>Awards + Accolades<br />\n2013 Canadian Comedy Award-Nominee- Best Male Stand-up<br />\n2013 Canadian Comedy Award-Nominee-Best Taped Live Performance-Just for Laughs<br />\n2012 Canadian Comedy Award-Nominee-Best Male Stand-up<br />\n2012 Canadian Comedy Award Best Taped Live Performance -The Late Late Show<br />\n2011 NOMINATION: Canadian Comedy Award-nominee for Best Male Stand-up<br />\n2010 NOMINATION: Canadian Comedy Award-nominee for Best Taped Live Performance-Just For Laughs<br />\n2008: Canadian Comedy Award Best Writing Series-The Jon Dore Television Show<br />\n2006 WIN: Just For Laughs Homegrown Comic Competition<br />\n2005 WIN: Canadian Comedy Award for Best Stand-up Newcomer</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/rsz_2mark_forward_headshot.jpg",
  "PerformerId": "6614",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "6614",
  "pageUrl": "6614-mark-forward",
  "events": [
   "7624",
   "7658",
   "7743",
   "7913"
  ],
  "mc_events": []
 },
 {
  "Name": "Erin Gibson",
  "Bio": "<p>Erin Gibson is an expert at mixing social commentary, political satire, and frank sexual talk into nice, neat little comedy packages. Based in Los Angeles, she currently writes and directs for Funny or Die and co-hosts the award winning comedy podcast \"Throwing Shade\", which is now a web series on Funny or Die and an international touring live show. </p>\n<p>As an actress and comedian, she’s been seen on Chelsea Lately, The Kroll Show, Parks and Rec, Community, Key and Peele, and clip shows galore, but it was her stint as host and writer of \"Modern Lady\" on CurrentTV that she became involved in the fun world of gender politics. </p>\n<p>Please do not startle her. She will scream.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/eringibson.jpg",
  "PerformerId": "7893",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "7893",
  "pageUrl": "7893-erin-gibson",
  "events": [
   "7644"
  ],
  "mc_events": []
 },
 {
  "Name": "Erin McGathy",
  "Bio": "<p>Erin McGathy is a comedian, writer, and inspiration* living all of the dreams in Los Angeles. As a Navy Kid who moved around a lot, she's willing to do just about anything to make you like her. She's like, SO much fun, you guys!!!</p>\n<p>Erin has proudly performed at the UCB theatre since 2007 with Harold and Maude teams, in sketch shows, variety shows and in other charmingly unclassifiable performances. She is the creator and host of THIS FEELS TERRIBLE: The Love Show, a UCBTLA live show since 2010 and podcast since 2012 (feralaudio.com).</p>\n<p>When she's not doing comedy related things she's making \"Ugly Cakes\" for buddies and mediocre paintings for cold hard cash.</p>\n<p> *JK. What if someone really described herself as an \"inspiration\"???</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/erinmcgathy.png",
  "PerformerId": "7896",
  "SortOrder": 200,
  "ExcludeFromList": false,
  "id": "7896",
  "pageUrl": "7896-erin-mcgathy",
  "events": [
   "7741",
   "7783",
   "7811"
  ],
  "mc_events": [
   "7674"
  ]
 },
 {
  "Name": "David Foster",
  "Bio": "<p>It’s possible David Foster is the only comedian from New York who’s appeared on HBO, MTV, and Showtime, has a Masters degree in Traditional Chinese Medicine, was arrested seven times as an adolescent, speaks Spanish fluently, performed &quot;Mama Said Knock You Out&quot; at his Bar-Mitzvah, has a black belt in karate and a daily meditation practice… though it’s true, you never know who else is out there. If that wasn’t too much to digest then you’re ready for David’s uniquely cerebral brand of humor. </p>\n<p>Born and raised in New York, David is one of the country&#039;’s funniest up and coming philosophers posing as a stand-up comic. In spite of his juvenile experimentation with graffiti, marijuana, and shoplifting he was a straight-A student, always on the honor roll. Around the legally transformative age of 18 he straightened out his act, and shortly thereafter discovered his act on stage. </p>\n<p>Success and recognition came quickly. His popular Manhattan public access talk show grabbed the attention of MTV, and by his fourth year in comedy he’d been featured on HBO, Showtime and MTV - many of his segments still being aired on VH-1’s Best Pranks. He won the 2011 Boston Comedy Festival’s New York Competition and was first runner up in the Comix at Foxwoods’ 2012 “Last Comix Standing” contest. He also consistently scripts one of the most popular philosophical blogs on stand-up comedy, davidfostercomedyblog.com. </p>\n<p>On stage David dissects the root causes of his anxieties and tells stories of how his adolescence staunchly contrasted with what his Jewish mother had envisioned for him. Philosophically he dissects the human stream of consciousness, criticizes our educational and medical systems, and refutes cynical perspectives, which is unique to what we hear from most stand-ups. While it’s become common for comedians to make fun of things like spiritual faith, hip hop white guys, and natural forms of medicine, David brilliantly conveys the opposite perspectives with a hilarious and unique charisma. Refreshing to listen to and an absolute pleasure to watch, his career has progressed reasonably fast.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/d_foster_copy.jpg",
  "PerformerId": "5805",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "5805",
  "pageUrl": "5805-david-foster",
  "events": [
   "7687",
   "7692",
   "7911",
   "7919"
  ],
  "mc_events": []
 },
 {
  "Name": "Nathan Brannon",
  "Bio": "<p>Nathan takes the audience on an unexpected ride full of witty stories, clever punch lines, and amusing shadow puppets. He brings smiles and hilarious anecdotes to the stage every time he grabs the microphone. Nathan also added this sentence because he wanted a higher word count.</p>\n<p>Nathan was named one of the &quot;Top 5 Funniest&quot; of Portland  by the Willamette Week in 2013, Portland&#039;s Funniest Person for 2012, and just opened for Comedian Dave Chappelle throughout Oregon. Last summer, he released his first comedy album, entitled &quot;I Black Out&quot;. He has participated in comedy festivals all over the country, as well as opened for national headliners such as Dave Chappelle, Matt Braunger, Maria Bamford, Arj Barker, Rob Schneider, Bert Kreischer, Larry Miller, and more. Nathan was also seen in NBC’s new series, “Grimm”. Nathan is now seeking a funnier way to end this paragraph.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/nathan_brannon.jpg",
  "PerformerId": "6074",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "6074",
  "pageUrl": "6074-nathan-brannon",
  "events": [
   "7667",
   "7690",
   "7701",
   "7808"
  ],
  "mc_events": []
 },
 {
  "Name": "Charlie Rohrer",
  "Bio": "<p>Charlie Rohrer dropped out of college to tell jokes. Comedy just seemed more viable than a bachelor&#039;s degree in Fine Arts. Growing up the black sheep of an enormous Irish family in the South Suburbs of Chicago, his comedy mostly comes from self-reflection, tales from his awkward childhood, and his unique view on everyday life. </p>\n<p>He co-producers a very successful, independent show in Chicago called &quot;Congrats on Your Success,&quot; and has performed at Zanie’s, Chicago Underground Comedy, Gilda’s Laughfest, and more.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/charlierohrer.jpg",
  "PerformerId": "6203",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "6203",
  "pageUrl": "6203-charlie-rohrer",
  "events": [
   "7692",
   "7737",
   "7911"
  ],
  "mc_events": [
   "7730"
  ]
 },
 {
  "Name": "Daniel Van Kirk",
  "Bio": "<p>Daniel Van Kirk is a comedian and actor living in Los Angeles. He is an active member of both the stand-up and sketch communities, working with UCBLA, Funny or Die, College Humor, Nerdist Industries, Yahoo Sketchy, and the Earwolf comedy podcast network. Daniel has showcased his characters at numerous theaters and festivals around the country including South by Southwest, The Montreal Just For Laughs Festival, SF Sketchfest, Riot LA, &amp; YouTube's, \"Comedy Week.\"</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/dvk.jpg",
  "PerformerId": "7518",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "7518",
  "pageUrl": "7518-daniel-van-kirk",
  "events": [
   "7703"
  ],
  "mc_events": [
   "7638"
  ]
 },
 {
  "Name": "Emily Maya Mills",
  "Bio": "<p>Emily Maya Mills is an actor, writer and stand-up comic based in Los Angeles. She&#039;s been seen on Parks and Recreation, Ellen, Childrens’ Hospital, Key and Peele, Harry&#039;s Law, Crash &amp; Bernstein, Comedy Bang Bang and The Birthday Boys, as well as many of television’s most humiliating commercials.</p>\n<p>A San Francisco native, Emily attended Emerson College and has been a regular performer at the Upright Citizens Brigade Theatre in Los Angeles since 2006. In 2013, her one woman show, God Hates Figs, received glowing reviews from the LA Weekly and played to sold out audiences over a six month run. Her three-woman sketch group, Birds of Prey, won Best Sketch Group in Punchline Magazine and she has been named an “Up-and-Coming Comedienne You Should Be Laughing At” by TheFrisky.com, &quot;2013&#039;s Comics to Watch&quot; by SOmagazine.com, and a “Funny Female to Follow on Twitter” by the Huffington Post. She holds a PhD in parallel parking. </p>\n<p>Emily Maya Mills was once a spokesmodel for cherry tomatoes and has a cat-like dog who walks like a pony.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/emilymartinimills.jpg",
  "PerformerId": "6659",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "6659",
  "pageUrl": "6659-emily-maya-mills",
  "events": [
   "7638",
   "7658",
   "7741",
   "7804",
   "7815",
   "7952"
  ],
  "mc_events": []
 },
 {
  "Name": "Greg Santos",
  "Bio": "<p>Greg Santos is a Cuban with the gift of looking Jewish.  Greg is a regular host at the American Comedy Co in San Diego, The Westside Comedy Theatre in Los Angeles and has hosted and featured for many comedians including Chris Kattan (SNL), Chris Franjola (Chelsea Lately), Brody Stevens (HBO, CONAN), Michael Kosta (Comedy Central, Fox Sports), Dan St. Germain (Comedy Central), Owen Benjamin (Comedy Central, Sullivan &amp; Sons); Taylor Williamson (America&#039;s Got Talent), and many others he doesn&#039;t feel like name dropping.  Greg was also selected to perform in the 2014 RIOT LA Alternative Comedy Festival.</p>\n<p>Greg is part of the sketch group Tunguska Yacht Club, whose work has been featured by Funny or Die, Huffington Post Comedy, Nerdist.com, Men’s Humor, You Tube What’s Popular, What The Funny, and countless Eastern European sites he cannot understand. Tunguska Yacht Club was a finalist in the 2012 International Songwriting Competition in the category of Comedy and they lost to the beautiful Garfunkel and Oates. Tunguska Yacht Club is currently making 12 exclusive videos for Marlon Wayans’s new company, WhatTheFunny.com and they were also cast in a pilot presentation by Marlon Wayans for TBS.</p>\n<p>Greg co-wrote, co-produced, and participated in a Publisher’s Clearing House Prank on his best friend, Reed Hahn, which was featured on MTV’s Prank’d Season 2, TRU TV’s Top 20 Most Shocking Pranks (2010), TRU TV’s Top 20 Funniest Big Check, No Money (2013), and TRU TV’s World’s Dumbest (2013).</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/westside_comedy_theatre.jpg",
  "PerformerId": "5987",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "5987",
  "pageUrl": "5987-greg-santos",
  "events": [
   "7708",
   "7711",
   "7918"
  ],
  "mc_events": [
   "7665"
  ]
 },
 {
  "Name": "Mary Van Note",
  "Bio": "<p>Mary Van Note is a stand-up comedienne of the weird variety.  She is the creator and star of the award winning Independent Film Channel web series &quot;The Mary Van Note Show: Gavin Really Wants Me.&quot;  She is a SF Weekly Masterminds grant recipient, a seven-time SF Sketchfest performer, and an Andy Kaufman Award Semi-Finalist. The San Francisco Bay Guardian called her a “Zine-Queen Comedian” as she regularly makes zines, crafts and mini-comics.  Her specialties are stick-figures and cross-stitch.  She also posts regularly on her personal style and comics blog at <a href=\"http://maryvannote.com/blog/\">http://maryvannote.com/blog/</a></p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/469317_10150585290237945_1579035027_o.jpg",
  "PerformerId": "6762",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "6762",
  "pageUrl": "6762-mary-van-note",
  "events": [
   "7651",
   "7663",
   "7674",
   "7685",
   "7692",
   "7912"
  ],
  "mc_events": []
 },
 {
  "Name": "Richard Bain",
  "Bio": "<p>Richard Bain started doing standup in North Carolina in 2003 and then moved to Portland, Oregon in 2005. After becoming one of Portland’s favorite comedians he decided to move to Los Angeles in 2011. When he’s not on stage making you laugh, he’s probably making videos with his friends better known as Decision Makers Penthouse. Their videos have been featured as Will Ferrell’s favorites on funnyordie.com, and Bain starred in one that was featured on The Tonight Show with Conan O’Brien. Richard has performed at the Laughing skull fest, Bumbershoot, and the LA Riot festival. He recently was featured in a Dead Kevin sketch for comedy central.com.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/screen_shot_2012-07-18_at_8.06.53_pm.png",
  "PerformerId": "6110",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "6110",
  "pageUrl": "6110-richard-bain",
  "events": [
   "7625",
   "7658",
   "7711",
   "7752",
   "7967"
  ],
  "mc_events": []
 },
 {
  "Name": "Bob Khosravi",
  "Bio": "<p>Bob Khosravi was born a baby, which his mother appreciated. A storyteller hailing from Austin, Texas Bob has performed all across the country as well as been a featured performer in the Moontower Comedy Festival, the Art Outside Comedy Festival, and was selected to compete in the San Francisco International Comedy Competition. An Austin favorite, Khosravi&#039;s comedy has been described as playful with a subtle sense of dark.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/photo.png",
  "PerformerId": "5856",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "5856",
  "pageUrl": "5856-bob-khosravi",
  "events": [
   "7663",
   "7691",
   "7710",
   "7743"
  ],
  "mc_events": []
 },
 {
  "Name": "Will Weldon",
  "Bio": "<p>Will Weldon is a comedian who currently resides in Los Angeles, California, home to such luminaries as Jeremy Piven and that&#039;s pretty much it. He has performed on such well known Los Angeles comedy shows as The Meltdown with Jonah and Kumail, Put Your Hands Together, and the now defunct (what a great word) Holy Fuck! He has toured across the country, as well as appearing at both the Bridgetown and Montreal Comedy festivals, where he was invited to perform on a “Best of the Fest” showcase. He has been written about in the kinds of online comedy magazines only other comedians ever read, and was catfished by someone he met on Twitter. Try to keep that last thing a secret, though.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/squish_face.jpg",
  "PerformerId": "5867",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "5867",
  "pageUrl": "5867-will-weldon",
  "events": [
   "7624",
   "7678",
   "7703",
   "7919"
  ],
  "mc_events": [
   "7708"
  ]
 },
 {
  "Name": "Jade Catta-Preta",
  "Bio": "<p>Jade Catta-Preta was one boney baby, born in Sao Paulo, Brazil, then later raised in Virginia to ensure a future in comedy. She travels the country featuring for Bill Burr, Bobby Lee and Kevin Nealon, and is a paid regular at The Comedy Store, The Improv and the Laugh Factory. She recently filmed an improvised FOX pilot directed by Dan Mazer and produced by Ron Howard as well as an eight episode arc for next season of Showtime&#039;s &quot;Californication.&quot; You can catch her along side Steve Rannazzisi in &quot;Daddy Knows Best&quot; and the upcoming season of Nuvo&#039;s &quot;Standup and Deliver.&quot; Like the 1995 David Caruso porno thriller of the same name, Jade takes herself very seriously.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/photo_9_0.jpg",
  "PerformerId": "6674",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "6674",
  "pageUrl": "6674-jade-catta-preta",
  "events": [
   "7645",
   "7665",
   "7913",
   "8633",
   "8635"
  ],
  "mc_events": []
 },
 {
  "Name": "Anthony Lopez",
  "Bio": "<p>Anthony Lopez has written for the Gotham Independent Film Awards, performed at Bumbershoot, Bridgetown, and is the co-host of the &quot;Free Chips and Salsa&quot; show at Action/Adventure Theater. Hailing from Portland Oregon, Anthony Lopez has been called &quot;One of the Comics to Watch&quot;  by the Portland Mercury, and he&#039;s had the privilege of featuring for such acts as Nick Kroll and The Whitest Kids You Know. Anthony has performed at UCB East, The Knitting Factory in NY, and the Tacoma Comedy Club and The Comedy Underground in Washington. He is regular host at Helium Comedy Club and other clubs in the Northwest. He spins long form stories with short one liners about everything from family to movies, comic books, drinking, and religion.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/anthony_headshot-2.jpg",
  "PerformerId": "6271",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "6271",
  "pageUrl": "6271-anthony-lopez",
  "events": [
   "7646",
   "7660",
   "7697",
   "7912"
  ],
  "mc_events": [
   "7658",
   "7728"
  ]
 },
 {
  "Name": "Jim Hickox",
  "Bio": "<p>As one of the founding members of the revered Denver troupe The Grawlix, Jim was pivotal in the rise of the now revered Denver comedy scene.  No matter the show, Jim always leaves an impression with his quick wit and inventive approach to stand-up; audiences have never seen anything like it. The integration of his laptop into his act gives him unprecedented access to innovate and explore comedy, both the old tropes and the avant-garde. It&#039;s as funny as it is ingenious.  Jim is a headliner at Comedy Works in Denver and works around the country. In 2012 he performed for a month at the Edinburgh Fringe Festival. Most recently he performed at the inaugural High Plains Comedy Festival in Denver.</p>\n<p>He is unrepresented, and really needs something cool to happen soon.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/me_la_2013.jpg",
  "PerformerId": "6275",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "6275",
  "pageUrl": "6275-jim-hickox",
  "events": [
   "7665",
   "7708",
   "7737",
   "7748"
  ],
  "mc_events": []
 },
 {
  "Name": "Amy Miller",
  "Bio": "<p>Voted Portland&#039;s #1 Comedian in 2013 by a jury of her peers, aside from the cover of Willamette Week, Amy Miller has also been seen featuring for Maria Bamford, and at the following comedy places: San Francisco Sketchfest, Noise Pop Festival, SF Punchline, Cobb’s Comedy Club, Harvey’s Comedy Club Portland, Helium Comedy Club, The All Jane No Dick Festival, The Siren Nation Festival, Laugh Your Asheville Off, Mississippi Studios Portland, and as a regular headliner at the original Purple Onion. A lead producer/ host/ wrangler in Sylvan Productions, Amy produced a successful Oakland show series that featured Hannibal Buress, Moshe Kasher, Kyle Kinane, Rory Scovel and more.</p>\n<p>Amy Miller gets on stage to tell jokes, and you’re all like, well she doesn’t look funny at ALL. I hope she doesn’t blow this! Maybe I should go for a smoke break? 2 minutes in, your pants have been charmed off by her rosy cheeks and a delicate balance of self-deprecation and ego. 5 minutes in, you start to feel sad for her and sometimes feel the need to go “AWWW” out loud in the middle of her set or, occasionally “YOU’RE ADORABLE.” 10 minutes in you’re not sure if you want to have wild sex with her, or have her pretend to be your mom and tuck you into bed at night while lightly stroking your hair and singing You Are My Sunshine because she’s also an excellent singer. Any exposure above 15 minutes and your head is just a chaotic swirl of love feelings and a crippling fear of eventual heartbreak and rejection at the end of which you decide you should just be best friends. It’s fun!</p>\n<p>She has a podcast called &quot;Sorry About Your Dad.&quot; It’s about dad stuff.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/amymiller2_1.jpg",
  "PerformerId": "5730",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "5730",
  "pageUrl": "5730-amy-miller",
  "events": [
   "7625",
   "7689",
   "7805"
  ],
  "mc_events": [
   "7717",
   "7710"
  ]
 },
 {
  "Name": "Jesse Elias",
  "Bio": "<p>Jesse Elias is a comedian forged in the infernal flames of San Francisco. He draws creative inspiration from music and literature of the 19th century and cartoons and candy of the 1990s. Over the course of 2012 and 2013 he has performed in festivals such as Bridgetown, Outside Lands, LA Riot, and SF Sketchfest. He has written for the new season of &quot;The Eric Andre Show,&quot; currently airing on Adult Swim. Jesse is also proud of his many gross victories as a Competitive Erotic Fan Fiction writer, available via podcast on nerdist.com.  Jesse learned everything he knows about being funny by studying the comedies of the ancient masters Plautus and Terrence.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/jesse-medium.jpg",
  "PerformerId": "6536",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "6536",
  "pageUrl": "6536-jesse-elias",
  "events": [
   "7623",
   "7646",
   "7651",
   "7919"
  ],
  "mc_events": []
 },
 {
  "Name": "Sean Donnelly",
  "Bio": "<p>When he’s not catching a nap with his bulldog, Rickles, Sean can be found headlining clubs all over New York, including Caroline&#039;s, Gotham, Stand Up NY, and The Stand. He has appeared on MTV’s World of Jenks and The Late Show with David Letterman. Sean was a Comic Stand-Off finalist at the 2010 Magners Comedy Festival, performed at the Bridgetown Comedy Festival in 2011 and 2012, was a semi-finalist in the 2012 Boston ComedyFestival competition, and performed at Comedy Central’s 2013 South Beach Comedy Festival. Sean was a Montreal Just For Laughs “New Face” in 2013.  He co-hosts the podcast &quot;My Dumb Friends&quot; with fellow comedian Dan St. Germain and hosts a weekly show at Alligator Lounge in Brooklyn. Sean can be seen regularly on the TruTV series &quot;World’s Dumbest&quot; and on the first season of &quot;Adam Devine’s House Party&quot; on Comedy Central.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/sean_donnelly_2.jpg",
  "PerformerId": "6004",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "6004",
  "pageUrl": "6004-sean-donnelly",
  "events": [
   "7685",
   "7691",
   "7699",
   "7703"
  ],
  "mc_events": []
 },
 {
  "Name": "Eliza Skinner",
  "Bio": "<p>Eliza Skinner is originally from Richmond, VA and started her performing career as an unnamed child revolutionary in a local production of Evita. She is now a stand-up comedian and regular performer at the Upright Citizens Brigade Theater in New York and LA. Most recently, Eliza was a writer and performer on Totally Biased with W Kamau Bell, produced by Chris Rock. She has performed in festivals all over the world including RiotLA, SXSW, Bridgetown, the NY Comedy Festival and the Edinburgh Fringe, and was named by Patton Oswalt as a notable &quot;up and coming&quot; comedian. She has also written for Fashion Police with Joan RIvers, Glamour, Showtime, Cracked, and many other publications and websites. Many of her original videos have become viral hits online, and RuPaul once called her “She-larious!” so....  <a href=\"http://www.elizaskinner.com\">www.elizaskinner.com</a></p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/elizanew2-2.jpg",
  "PerformerId": "6609",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "6609",
  "pageUrl": "6609-eliza-skinner",
  "events": [
   "7646",
   "7652",
   "7667",
   "7671",
   "7739",
   "7741",
   "7809",
   "7918"
  ],
  "mc_events": []
 },
 {
  "Name": "Matt Ingebretson",
  "Bio": "<p>Matt Ingebretson is a writer and comedian. He performs all over LA and was featured on the standup compilation album, &quot;Holy Fuck.&quot; He has written for the Soup, the Onion, Funny or Die, and MTV. Also, he&#039;s worried his bio is too short so he tacked on this sentence to make it seem more substantial.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/matt_ingebretson_promo.jpg",
  "PerformerId": "5894",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "5894",
  "pageUrl": "5894-matt-ingebretson",
  "events": [
   "7912",
   "7919",
   "8633"
  ],
  "mc_events": [
   "7660"
  ]
 },
 {
  "Name": "Janine Brito",
  "Bio": "<p>JANINE BRITO is a stand up comic, and was a writer and on-air correspondent on the critically acclaimed FX series, Totally Biased with W. Kamau Bell, produced by Chris Rock. </p>\n<p>Janine started doing standup comedy in St. Louis and has performed at clubs and theaters throughout the US and Hong Kong. She is the winner of the 2009 SF Women&#039;s Comedy Competition, and recipient of Rooftop Comedy&#039;s 2010 Silver Nail Award. Praised by 7x7 Magazine as &quot;one of SF&#039;s more daring voices&quot; and one of &quot;the 7 funniest people in town,&quot; she was named the 2011 “Best Comedian with a Message” by the East Bay Express. Her recent festival appearances include Sketchfest, the Bridgetown Comedy Festival and the Glasgow International Comedy Festival.</p>\n<p>W. Kamau Bell calls her “a sarcastic, snarky smart bomb of comedy funk straight from the 80&#039;s,” and the SF Weekly says she’s “a mean lesbian,” but she’s pretty sure that they mean it in a good way.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/janinebrito_jenmaler012_small.jpg",
  "PerformerId": "6696",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "6696",
  "pageUrl": "6696-janine-brito",
  "events": [
   "7623",
   "7658",
   "7678"
  ],
  "mc_events": []
 },
 {
  "Name": "Megan Koester",
  "Bio": "<p>Megan Koester is a writer and comedian (obviously) who resides in Los Angeles (somewhat less obviously). A columnist for VICE, she co-produces Entitlement, a monthly comedy show with other VICE scribes which has had the pleasure to host such notables as Neil Hamburger, Marc Maron, Kyle Kinane, Maria Bamford, Kurt Braunohler and Andy Kindler (who she collaborated with on her &quot;How Not to Be a Stand-Up Comedian&quot; article for VICE). She&#039;s performed at SF Sketchfest, the Hollywood Improv, the SF Punchline, Tomorrow!, The Grawlix, Chicago Underground Comedy, and countless other shows across this great land we call America. She has her very own track on the Holy F**k Live Comedy album, which you can listen to on Spotify if you&#039;re so inclined. She&#039;ll GLADLY do any podcast she&#039;s asked to, up to and including Terrified, Lady to Lady and The Fogelnest Files. She USED to be a staple of those Huffington Post &quot;Women You Should Follow on Twitter&quot; lists until she started making a big stink about them being patronizing; she&#039;s also one third of the all-female (sorry) sketch group Blessed. A Witstream contributor, she&#039;s been featured on Splitsider and is finding it very hard to continue writing this bio in the third person. Most importantly, she has the distinction of being the first person to eat a 6&#039;&#039; flatbread Veggie Delight Subway sandwich on stage, a fact she&#039;ll take to her cold, lonely grave. You can follow her on Twitter at <a href=\"http://www.twitter.com/bornferal\">http://www.twitter.com/bornferal</a>.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/koester-146-8.jpg",
  "PerformerId": "6402",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "6402",
  "pageUrl": "6402-megan-koester",
  "events": [
   "7624",
   "7678",
   "7753",
   "7815"
  ],
  "mc_events": [
   "7918"
  ]
 },
 {
  "Name": "James Ball",
  "Bio": "<p>Dry, dark, and delightful, this Canadian comic has performed his laidback brand of one-liner standup on stages across Canada and in the UK. </p>\n<p>Watching him, you may be reminded of The Far Side, smooth jazz, and a book of insane haiku. </p>\n<p>Credits include Just For Laughs, the Halifax Comedy Festival, the Manchester Comedy Festival, and the Blue Bridge Comedy Festival. His half-hour Comedy Now TV special continues to air across Canada a little too frequently for his comfort. You can also hear him on XM Satellite radio from time to time. </p>\n<p>James was born and raised in Victoria BC, made his standup debut in Tokyo, and did his first paid gig in Alberta. He lives in Victoria today where he works in media and performs &amp; produces comedy shows up and down Vancouver Island. This is his first appearance in the States. </p>\n<p>Tall yet approachable, James is thrilled to be at Bridgetown. Ask him about motorcycles, the Toronto Raptors, his favorite podcasts, and Victoria&#039;s best microbrewed beers. He knows things.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/james_ball_-_headshot_.jpg",
  "PerformerId": "6305",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "6305",
  "pageUrl": "6305-james-ball",
  "events": [
   "7641",
   "7656",
   "7730",
   "7743"
  ],
  "mc_events": []
 },
 {
  "Name": "Sean Jordan",
  "Bio": "<p>Sean Jordan is a stand up comedian originally from Sioux Falls SD.  Sean started into comedy after seeing only one stand up show.  Getting his start in Sioux Falls after winning a local comedy contest, Sean became one of the house emcees at the comedy club in town.  This gave Sean the chance to perform 3-4 times a week for years on end.  That opportunity allowed Sean to grow as a comedian at a very rapid rate while at the same time giving him all the stage time needed to develop a healthy confidence while telling jokes.  </p>\n<p>After going as far as he could in Sioux Falls, Sean decided to move to Portland OR.  Quickly after moving he hopped right into the local scene advancing to the finals of the 2011 and 2012 Portland comedy competitions.  Sean was also voted one of Funny or Die and Splashlife magazines “30 Under 30” comedians to watch in 2011.  You have heard him as a repeat guest on Doug Bensons podcast “Doug Loves Movies” as well as “The Benson Interruption.”   You also may have seen him on Rooftop Comedy as a featured performer.  </p>\n<p>He has participated in the Bridgetown Comedy Festival the last 4 years running as well as the Bumbershoot Comedy and Arts Festival for the last 2.  The easy and comfortable style of Sean is sure to put any audience member in the right frame of mind to enjoy a stand up show and also provide them with a memorable experience to keep them coming back.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/flightclub.jpg",
  "PerformerId": "6408",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "6408",
  "pageUrl": "6408-sean-jordan",
  "events": [
   "7621",
   "7650",
   "7752"
  ],
  "mc_events": [
   "8696",
   "7667"
  ]
 },
 {
  "Name": "David Cope",
  "Bio": "<p>David began performing stand up open mic in Portland, Oregon. It was way more fun than his call center job so he stuck with it. After living and performing in Portland and Seattle he moved to New York City. During his time there he was a semi finalist on Last Comic Standing 2010, nabbed the motion capture role of Jay Norris in Grand Theft Auto V, and co-produced The Hot Soup Comedy Show at the Upright Citizens Brigade Theater. His better half moved to L.A., so he did too and now engaged like proper adults they live together in Hollywood where he continues to write and perform comedy. David is a regular at The Portland Bridgetown Comedy Festival and The New York Underground Comedy Festival. He’s the co-creator and producer of No Pun Intendo, Nerdmelt Theater’s first in-house comedy video game competition and produces The Call Of The Blade, a gaming review web series featuring L.A. comedians.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/0711.jpg",
  "PerformerId": "6151",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "6151",
  "pageUrl": "6151-david-cope",
  "events": [
   "7672",
   "7750"
  ],
  "mc_events": [
   "7967"
  ]
 },
 {
  "Name": "Randy Mendez",
  "Bio": "<p>At the ripe young age of thirty-something, Portland comic Randy Mendez thought it&#039;d be the perfect time to go to college and to start a family. At the same time.</p>\n<p>Some years later now he&#039;s about to graduate and he&#039;s almost fully taught his three-year-old daughter to yell &quot;Fart!&quot; in public spaces. After taking third in the search for Portland&#039;s Funnies Person, the Portland Mercury described Randy as having &quot;a disarming, ebullient stage presence that calls to mind listening to a slightly manic, very inappropriate friend share stories about his fucked-up day.&quot; Randy is way too happy about the wrong parts of that statement.</p>\n<p>Randy has previously been seen at the Seattle International Comedy Competition, Helium Comedy Club, Funny Over Everything, They Mystery Box Show, No Pun Intendo, and many other shows that didn&#039;t pay well, but promised would look great in a bio.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshotlowres.jpg",
  "PerformerId": "6409",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "6409",
  "pageUrl": "6409-randy-mendez",
  "events": [
   "7680",
   "7689",
   "7751"
  ],
  "mc_events": [
   "7913"
  ]
 },
 {
  "Name": "Lance Paullin",
  "Bio": "<p>Lance Paullin is a loveable white guy with pretty, black lady hair living in the slums of Los Angeles where he tells PRETTY DECENT jokes and acts for television/cinema films. He&#039;s never been arrested; therefore, he has no prior arrests. He&#039;s a good guy. He wrote this specifically for you.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/bridgetown.jpg",
  "PerformerId": "5774",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "5774",
  "pageUrl": "5774-lance-paullin",
  "events": [
   "7652",
   "7653",
   "7692",
   "7708"
  ],
  "mc_events": []
 },
 {
  "Name": "Carolyn Busa",
  "Bio": "<p>Carolyn Busa has performed on stages all over Philadelphia and New York City, as well as the Ladies are Funny Festival, the Bridgetown Comedy Festival, the Women in Comedy Festival, and the She-Devil Comedy Festival. She is the proud mother/co-creator of Laughs on Fairmount, one of Philly&#039;s longest running open mics.</p>\n<p>Carolyn’s awkwardly, disarming stage presence will charm your figurative pants off.  She continually hosts and features throughout the tri-state area; and contributes to local sketch and theater productions. She may have even unsuccessfully auditioned for &quot;America&#039;s Next Top Model.&quot; Twice.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot_15.jpg",
  "PerformerId": "6315",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "6315",
  "pageUrl": "6315-carolyn-busa",
  "events": [
   "7672",
   "7679",
   "7691",
   "7710"
  ],
  "mc_events": []
 },
 {
  "Name": "Casey Ley",
  "Bio": "<p>Casey Ley’s comedy is silly. And smart. And dirty. And dark. And handsome. It’s a lot like him actually.  So it is also self-centered and flakey and relatively promiscuous.  He is the creator and host of the popular San Francisco comedy game show &quot;Tonic Trivia&quot; and stand-up show &quot;Some People Like Us.&quot;  He and his shows have appeared in comedy festivals like SF Sketchfest, Moontower Festival in Austin, TX, on the radio on the relatively popular NPR station, and he has shared the stage with comics you know like Hannibal Buress, Doug Benson, Laura Kightlinger and some other people you&#039;ve heard of if you like comedy.  The readers of SF Weekly voted him best comic in San Francisco in 2012 (which had nothing to do with his homosexuality), and in 2013 he was runner-up in The Advocate Magazine&#039;s Next Great Queer Comedy competition (which was wholly the result of his homosexuality).  Apparently he just wasn&#039;t quite gay enough.  Last year, at least.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/caseyley.jpg",
  "PerformerId": "6157",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "6157",
  "pageUrl": "6157-casey-ley",
  "events": [
   "7678",
   "7698",
   "7740",
   "7750",
   "8631"
  ],
  "mc_events": [
   "7632"
  ]
 },
 {
  "Name": "Vince Averill",
  "Bio": "<p>Vince Averill is a Los Angeles based comedian. He has toured throughout North America and appeared on Comedy Central.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/vinceheadshot.jpg",
  "PerformerId": "6717",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "6717",
  "pageUrl": "6717-vince-averill",
  "events": [
   "7697",
   "7912",
   "7951"
  ],
  "mc_events": [
   "7698"
  ]
 },
 {
  "Name": "Peggy O&#039;Leary",
  "Bio": "<p>Peggy O&#039;Leary is a stand up comedian based out of New York, but comes from the burbs of Philly, and thats very important for you to know.  Peggy tells jokes and stories about her fat girl past, her &quot;My Girl&quot; upbringing (minus the bee stings), and being completely weirded out about men and sex.  She performed at The Women in Comedy Festival in Boston and The Jersey City Comedy Festival, both in 2013. </p>\n<p>Her sketch group BLEAK! Comedy has performed all over the east coast, was featured at the Austin Sketch Festival, The National Comedy College Festival and performed BLEAK! Comedy: STOMACHTOWN at the UCB theatre in NYC.  Her stand up can be seen all over NYC at The Creek and The Cave, UCBTheatre, EastVille Comedy Club, The Village Lantern, and many bars and apartments all over the outer boroughs.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/peggy-oleary-6999-13-2.jpg",
  "PerformerId": "6058",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "6058",
  "pageUrl": "6058-peggy-o039leary",
  "events": [
   "7654",
   "7663",
   "7680"
  ],
  "mc_events": [
   "7699"
  ]
 },
 {
  "Name": "Aaron Weaver",
  "Bio": "<p>Aaron Weaver started doing stand-up in Chicago in 2008, with a point-of-view so specific, so original, and so hilarious that the rest of the Chicago comedy scene quickly took notice. He rapidly became one of Chicago’s most heralded stand-ups, due to his custom brand of absurd soulfulness and his way of exploring all the smartest and stupidest thoughts that go through all of our heads. Aaron has performed regularly at every comedy club, showcase, and pancake house in Chicago, including the Laugh Factory, Zanies, and The Lincoln Lodge. He has also performed at the TBS Just For Laughs Festival (twice), as well as the Boston Comedy Festival.  Since moving to LA in 2013, he was named one of Comedy Central’s “Comics to Watch” by making it to the final round of their nationwide Up Next competition. Aaron’s positive stage persona is a breath of fresh air, particularly if you like breathing things that are really, really funny.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/aaron_weaver_head_shot1.jpg",
  "PerformerId": "6159",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "6159",
  "pageUrl": "6159-aaron-weaver",
  "events": [
   "7641",
   "7695",
   "7738"
  ],
  "mc_events": []
 },
 {
  "Name": "Kiran Deol",
  "Bio": "<p>Kiran Deol is an LA based standup and performer born in Britain and raised in Boca Raton, Florida. She performs in venues across LA including Meltdown, The Improv, and anywhere that will have her really.  Credits include MODERN FAMILY, GREYS ANATOMY, WEEDS, PARENTHOOD, and NEWSROOM. Film credits include a lead in the independent feature film FARAH GOES BANG, which debuted at the Tribeca Film Festival in April 2013 and won the first-ever Nora Ephron Award.  </p>\n<p>Before standup, Kiran began her career as a filmmaker.  Her first short film, WOMAN REBEL, was a documentary about women rebel soldiers in Nepal that was broadcast by HBO, shortlisted for an Oscar, and nominated for an Emmy.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/kiran_pic.jpg",
  "PerformerId": "6162",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "6162",
  "pageUrl": "6162-kiran-deol",
  "events": [
   "7622",
   "7628",
   "7809"
  ],
  "mc_events": [
   "7692"
  ]
 },
 {
  "Name": "Kristine Levine ",
  "Bio": "<p>Kristine Levine has been seen on IFC&#039;s &quot;Portlandia,&quot; and regularly tours with Doug Stanhope. She is a delight.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/600475_10200837691937142_519375149_n.jpg",
  "PerformerId": "6723",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "6723",
  "pageUrl": "6723-kristine-levine-",
  "events": [
   "7671",
   "7687",
   "7699",
   "7750",
   "7808",
   "8579"
  ],
  "mc_events": []
 },
 {
  "Name": "Kristin Manna",
  "Bio": "<p>Kristin is one of six kids. Her dad likes to get married. She drinks orange juice with everything. She is a horrible speller. Kristin has performed at Eastville Comedy Club, Gotham Comedy Club, Greenwich Village Comedy Club, UCBEast, and various clubs in NYC.  Kristin has been featured in the She Devil Woman&#039;s Comedy Festival. She also produces and writes her web series &quot; Awkwardly Charming&quot;. Most recently, you may have seen Kristin eating pancakes in an IHOP commercial.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/img_0325.jpg",
  "PerformerId": "6337",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "6337",
  "pageUrl": "6337-kristin-manna",
  "events": [
   "7637",
   "7710",
   "7951"
  ],
  "mc_events": [
   "7745"
  ]
 },
 {
  "Name": "Kimberly Clark",
  "Bio": "<p>Originally from Syracuse, New York, Kimberly was born the daughter of a preacher father and a prim and proper mother who stressed the importance of writing thank you notes. She was a reserved and well-behaved child in public, but at home was the official family jester. In college, Kimberly realized she had the ability to make people laugh without deliberately being funny. Peers and professors all became victims of this under-cover clown’s unexpected bites of tasteful humor-laced wit that was always well timed. After graduating from Arizona State University, Kimberly headed further West to Los Angeles, where she worked in TV production, most notably the last two seasons of the Drew Carey Show. She&#039;s performed stand up at clubs, on Lopez Tonight in April of 2011 and at The Maine Comedy Festival and The Boston Comedy Festival.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/kim_again_0.jpg",
  "PerformerId": "6795",
  "SortOrder": 250,
  "ExcludeFromList": false,
  "id": "6795",
  "pageUrl": "6795-kimberly-clark",
  "events": [
   "7641",
   "7701",
   "7815",
   "7916"
  ],
  "mc_events": []
 },
 {
  "Name": "Gabriel Rutledge",
  "Bio": "<p>Since abandoning his successful pizza delivery career in 2000, Gabriel&#039;s talent, hard work, and lack of a fall back plan have made him into one of North America&#039;s finest touring comics.</p>\n<p>A past winner of the prestigious Seattle International Comedy Competition, Gabriel has made television appearances on Comedy Central&#039;s Live at Gotham, the nationally syndicated Comedy.TV, and Nickelodeon&#039;s Nickmom Night Out.</p>\n<p>He is also a frequent guest on the Bob and Tom radio show, heard in over 150 cities.</p>\n<p>Gabriel has performed at the HBO/TBS Comedy Festival in Las Vegas, the Laughing Skull Comedy Festival in Atlanta, and The Great American Comedy Festival held in Johnny Carson&#039;s home town of Norfolk Nebraska.</p>\n<p>He has made at least 4 people pee their pants.</p>\n<p>Gabriel&#039;s has released two albums; &quot;Sometimes Laughter Hurts&quot; and &quot;Breeder&quot; that can be heard on Sirius Satellite Radio, 24/7 Comedy Radio, and wherever you want if you buy one. Rutledge makes his home in one of the great entertainment capitals of the world; Olympia Washington.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/plaid_shirt_small.jpg",
  "PerformerId": "6174",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "6174",
  "pageUrl": "6174-gabriel-rutledge",
  "events": [
   "7680",
   "7704",
   "7738",
   "7752"
  ],
  "mc_events": []
 },
 {
  "Name": "Sean Green",
  "Bio": "<p>A Bethlehem, PA native Sean Green has brought his East Coast sensibilities to the Los Angeles comedy scene. Known for his brazenly honest story telling, Sean isn’t afraid to share the hilarious episodes that perpetuate his personal life. An open book policy also applies to Sean’s educated acerbic takes on current events in the world. Sean is a founding member of Los Angeles’ hottest underground comedy club &quot;The Comedy Garage&quot; and can be found performing at the Improv Olympic, The Improv, UCB Theater and 3 Clubs. Sean was one of the stars in ‘The Comedy Garage‘ documentary now on Hulu. Besides his work as a standup and MC, Sean hosts a weekly podcast called &quot;The Green Room&quot; for the syndicated 24/7 Comedy.com network. Sean’s other past projects include programs on Live Video.com, National Lampoon Radio, LA Talk Radio.com, Comedy Nation, Spike TV, Set List at the Comedy Central Stages and at the Montreal Comedy Festival. Sean also recently acted in Def Jam recording artist Wax’s music video &quot;Dispensary Girl.&quot; Sean has combined his love of sports and comedy in his NFL picks column for MTV&#039;s &quot;Guy Code&quot; and by co-hosting the Sports Gambling Podcast. </p>\n<p>Check out Sean’s debut stand up comedy CD,  &quot;Sean Green The Whiskey Dick.&quot; Sean&#039;s latest appearance can be seen on the Hulu Original featuring Jay Mohr titled &quot;Money Where Your Mouth Is.&quot;</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot_new.jpg",
  "PerformerId": "6352",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "6352",
  "pageUrl": "6352-sean-green",
  "events": [
   "7665",
   "7730",
   "7738",
   "7745",
   "8635"
  ],
  "mc_events": []
 },
 {
  "Name": "Will Miles",
  "Bio": "<p>Will Miles is a New York stand up comedian.  After focusing on improvisation for two years at Chicago&#039;s ImprovOlympic, he began stand up comedy in 2007, and has been steadily working since he began.  After performing in the local stand up scene for a couple of years in Chicago, his first work came in the opportunity to feature for Hannibal Buress on his &quot;My Name Is Hannibal&quot; Tour. He is a regular at clubs, working the Midwest and East Coast. Aside from his stand up, Miles won runner up in Break.com&#039;s national &quot;Better Way Video&quot; contest and is a regular contributor on Chicago Public Radio&#039;s &quot;The Morning Amp&quot; radio show hosted by Brian Babylon and Molly Adams.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/image_6.jpg",
  "PerformerId": "6474",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "6474",
  "pageUrl": "6474-will-miles",
  "events": [
   "7641",
   "7685",
   "7701"
  ],
  "mc_events": [
   "7652"
  ]
 },
 {
  "Name": "Rob Gleeson",
  "Bio": "<p>Rob is an LA based stand up comedian. In addition to doing sets around Los Angeles, he regularly tours the college market where occasionally during his shows two kids seated in the back will start making out. They either find Rob&#039;s act to be incredibly erotic or insufferably boring. His acting work includes national commercials and roles on shows like &quot;How I Met Your Mother&quot; and &quot;Ben &amp; Kate.&quot; Currently, he recurs on the third season of Showtime&#039;s &quot;House of Lies.&quot;</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/gleeson.jpg",
  "PerformerId": "6189",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "6189",
  "pageUrl": "6189-rob-gleeson",
  "events": [
   "7646",
   "7697",
   "7750",
   "8631"
  ],
  "mc_events": []
 },
 {
  "Name": "Johan Miranda",
  "Bio": "<p>Johan Miranda is a Peruvian American comedian that has established himself in the Bay Area comedy scene. San Francisco Magazine exemplified him as a comedian you should know you about He performs at all the major comedy clubs in Northern California, including San Francisco Punchline, Sacramento Punchline, Cobbs Comedy Club, Rooster T Feathers, &amp; San Jose Improv, and has been featured in SF Sketchfest &amp; Santa Cruz Fringe Festival. He currently produces &amp; hosts the popular bimonthly Laugh Function, Berkeley’s longest running comedy showcase. He recently recorded a mini comedy DVD taping entitled “Ready to Bomb”, which award winning Bay Area comedy blog Courting Comedy called “a capsule of undeniable promise”</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/johanmirandaheadshot_0.jpg",
  "PerformerId": "5976",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "5976",
  "pageUrl": "5976-johan-miranda",
  "events": [
   "7621",
   "7693",
   "7711"
  ],
  "mc_events": [
   "7691"
  ]
 },
 {
  "Name": "Steve Gillespie",
  "Bio": "<p>Hailing from Minneapolis, where after receiving a degree in something or other, Steve became really bored and started telling jokes into a microphone. He first began honing his craft at the Acme Comedy Club, and has quickly emerged as a fast-rising talent in one of the strongest and most competitive comedy scenes in the country. Metromix Magazine named Steve one of the top comedians in the Twin Cities.</p>\n<p>Steve has been on the road non-stop for the past five years, appearing in some of the best comedy clubs in the country, including opening appearances for Kyle Kinane, Rory Scovel, Dave Attell, Tom Green, Harland Williams, Jim Breuer, Gilbert Gottfried, and Doug Benson.</p>\n<p>In 2010, he performed at the Laugh Your Asheville Off Comedy Festival, and in 2011 he appeared in the prestigious Boston Comedy Festival. In 2012, Steve was named a finalist in CMT&#039;s Next Big Comic Award. His first comedy album, &quot;Stever Fever,&quot; produced by Rooftop Records, came out in 2013, and was named one of the top ten albums of 2013 by Comedy-Reviews.com . This past March he performed at Gilda&#039;s Laughfest, where he was named runner-up for the Best of the Midwest.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/steve_6.jpg",
  "PerformerId": "6354",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "6354",
  "pageUrl": "6354-steve-gillespie",
  "events": [
   "7665",
   "7695",
   "7748"
  ],
  "mc_events": []
 },
 {
  "Name": "Caroline Bassett",
  "Bio": "<p>Caroline Bassett is a young comic from Austin, Texas who intertwines bizarre storytelling with sardonic observational jokes.  She was a finalist in the 2013 Funniest Person in Austin Contest.  As a downstairs neighbor once asked her, &quot;Do you dance in the shower?&quot;</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/1476023_10202546314805722_1681958827_n_0.jpg",
  "PerformerId": "6647",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "6647",
  "pageUrl": "6647-caroline-bassett",
  "events": [
   "7654",
   "7692",
   "7730",
   "8631"
  ],
  "mc_events": [
   "7746"
  ]
 },
 {
  "Name": "Rojo Perez",
  "Bio": "<p>Rojo Perez is a New York based comedian. He grew up in Puerto Rico, which helped him form the humor you see in him today. After moving to Florida for college, he began doing stand up at the age of 20 in local clubs and small café’s in Central Florida. Since moving to the Northeast, Rojo has become a regular in the NY comedy scene and can usually be seen performing at The Creek and The Cave. He has also performed at Caroline’s, The Comedy Studio, The Improv, the UCB theaters and many other clubs around the US. He has appeared on &quot;Keith and The Girl&quot; and has been featured at the New York Comedy Festival and at the inaugural LA Riot Comedy Festival. His future plans include one day earning enough money that relatives will ask to borrow and continuing to spread laughter regardless of race, religion and gender.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/rojo-perez-111.jpg",
  "PerformerId": "5845",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "5845",
  "pageUrl": "5845-rojo-perez",
  "events": [
   "7679",
   "7753",
   "7912"
  ],
  "mc_events": [
   "7749"
  ]
 },
 {
  "Name": "Ivan Hernandez",
  "Bio": "<p>Ivan Hernandez is a comic living in San Francisco. He likes food and some social issues and comic books. He has performed at the SF Sketchfest, Bridgetown Comedy Festival, Litquake, Supercon comic convention, International Cannabis and Hemp Expo, Sacramento Comedy Festival, SF Comedy and Burrito Festival, and plenty of other places. Boars, Gore, and Swords, the show he co-hosts with fellow comedian Red Scott, is a member of the Boing Boing podcast network. He produces Give Me Fiction, a monthly prose storytelling show in the basement of Lost Weekend Video. SF Weekly has described him as “masterfully sarcastic.”</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/1097002_10100994426128925_500000302_o.jpg",
  "PerformerId": "6363",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "6363",
  "pageUrl": "6363-ivan-hernandez",
  "events": [
   "7622",
   "7752",
   "7806"
  ],
  "mc_events": []
 },
 {
  "Name": "Rebecca O&#039;Neal",
  "Bio": "<p>Rebecca O&#039;Neal is a Chicago based stand up comedian and writer/editor whose work can be read on/in Vanity Fair Magazine, Gawker.tv, Splitsider.com, The Rumpus, Death and Taxes Magazine, and more.  </p>\n<p>Since she began stand up comedy in early 2012, Rebecca has performed at Portland&#039;s 2013 Bridgetown Comedy Festival, Chicago Underground Comedy, Chicago Women&#039;s Funny Festival 2012 and headlined 2013, Queer Comedy at Zanies, The Comedy Shrine, The Laugh Factory, Zanies Rosemont, The Wasted Plains Rock and Roll Revival, The Ohio Lesbian Festival, Entertaining Julia, NPR&#039;s Brian Babylon&#039;s Bronzeville Comedy Show, Jokes and Notes, The Lincoln Lodge, Navy Pier&#039;s Beer Garden, headlining NERDGASM at The Drop Comedy Club in Southbend, Indiana, and many other showcases in and around Chicago. Rebecca is also one of the newest cast members of the 14th season of Chicago&#039;s historic Lincoln Lodge and a regular guest on Vocalo.org&#039;s morning amp and has appeared as a guest comedy commentator or WBEZ&#039;s Morning Shift with Tony Sarabia.</p>\n<p>She performed in a video for Just For Laughs Chicago 2012 and currently produces a monthly free, BYOB comedy showcase in Chicago called Congrats on Your Success (for which she does the promotion and public relations) that has been featured in/on WBEZ/NPR, The Huffington Post, Vocalo.org, The Chicago Reader, The Red Eye&#039;s Eat Drink Do column, Time Out Chicago, Gapers Block, Chicagoist, LoganSquarist, Chicago Now, ChooseChicago.com, AfterEllen.com and many local blogs and websites. She was also listed as one of the Huffington Post&#039;s 18 Funny Women To Follow on Twitter alongside Mindy Kaling - and in a second feature for Huffington Post Chicago.</p>\n<p>Rebecca O&#039;Neal is a hilariously cerebral and confessional young comic whose urban upbringing on Chicago&#039;s southside coupled with her expansive vocabulary and tendency toward introspection endear her to audiences of all backgrounds. By humorously mining her experiences, she makes the esoteric universal.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/fez_shot.jpg",
  "PerformerId": "5876",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "5876",
  "pageUrl": "5876-rebecca-o039neal",
  "events": [
   "7688",
   "7703",
   "7733",
   "8631"
  ],
  "mc_events": []
 },
 {
  "Name": "Anna Seregina",
  "Bio": "<p>Anna Seregina is a San Francisco-based stand-up comic and performer, described as having the &quot;worst aura.&quot; She was named a &quot;Comic to Watch in 2013&quot; by the SF Weekly, as well an &quot;Emerging Bay Area Comic in 2013&quot; by the Bold Italic. She is a regular performer of the San Francisco-based show &quot;the Business,&quot; and produces the show “Talkies.&quot; </p>\n<p>She has appeared in comedy festivals, hosted music festivals, told stories at storytelling shows, and done weird things on Public Access TV. She starred in Joey Izzo’s &quot;Stepsister,&quot; which screened at San Francisco International and the Cannes Film Festival in 2013. Most facts about her are true. Most truths about her are facts.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/image_17.jpg",
  "PerformerId": "6681",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "6681",
  "pageUrl": "6681-anna-seregina",
  "events": [
   "7680",
   "7694",
   "7710"
  ],
  "mc_events": [
   "7622"
  ]
 },
 {
  "Name": "Brent Flyberg",
  "Bio": "<p>Brent Flyberg wanted his bio to just to be a picture of a wallaroo eating a chocolate chip pancake off a chandelier, but he only gets what he wants occasionally, which makes him an okay guy to be around. He has candy in his pockets almost all the time, and if you ask nicely, he&#039;ll share. His comedy will make you feel good that you&#039;re not him. He has performed at Bumbershoot, Summer Meltdown, and the Melbourne International Comedy Festival. He hates wearing pants.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/btown2.jpg",
  "PerformerId": "6534",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "6534",
  "pageUrl": "6534-brent-flyberg",
  "events": [
   "7641",
   "7693",
   "7704"
  ],
  "mc_events": [
   "7738"
  ]
 },
 {
  "Name": "T.J. Chambers",
  "Bio": "<p>Distributor of high-fives, repository of whiskey, afraid of phones, spiders, and phone-using spiders.  T.J. Chambers is a Los Angeles-based writer and comedian whose work has appeared on NBC, MTV, Lifetime, and other television channels (but let&#039;s be honest we all mostly flip through those three).  As a live performer he has toured the country and graced (seriously, his movements are lithe as hell) every major and minor stage around LA.  Listeners have enjoyed a string of scintillating appearances on podcasts such as Put Your Hands Together, PodCrash, Probably Science, and maybe some others provided they start with &quot;P&quot;, because after all it&#039;s a fun letter with both straight and bendy parts.  Presumably he is also very happy to be making a return to the Bridgetown Comedy Festival, but to be honest we forgot to ask him.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/me_cropped_5.jpg",
  "PerformerId": "5728",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "5728",
  "pageUrl": "5728-tj-chambers",
  "events": [
   "7687",
   "7745",
   "7748",
   "7915"
  ],
  "mc_events": []
 },
 {
  "Name": "Douglas Gale",
  "Bio": "<p>Douglas Gale started doing comedy in Seattle in 2003 where he quickly became one of the newest comics in the scene. In the past few years, his comedy has become more personal. From stories about the time he tried to trade places with his reflection in a mirror (high on mushrooms) to his confusion about what is and is not cheese (arugula = not cheese).</p>\n<p>In the past year, he started expanding beyond straight standup and into the world of storytelling. He has won three Moth StorySLAMs in Seattle and competed in a Moth GrandSLAM in 2014. </p>\n<p>In 2013, he was the winner of the Competitive Erotic Fan Fiction show at Bumbershoot. </p>\n<p>He is currently the producer of the monthly Moth StorySLAM in Seattle</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/1523779_616488551721812_1246745931_o.jpg",
  "PerformerId": "6687",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "6687",
  "pageUrl": "6687-douglas-gale",
  "events": [
   "7632",
   "7672",
   "7679",
   "7811"
  ],
  "mc_events": []
 },
 {
  "Name": "Ester Steinberg",
  "Bio": "<p>Ester began performing stand-up on the high school lunch tables and soon graduated to the campus of New York University. While attending NYU she took full advantage of the city&#039;s thriving comedy scene and quickly became a regular at Caroline&#039;s New Talent Night. Before long she was touring the country and opening up for comedians Own Benjamin, Bobby Collins, and Shawn Pelofsky.</p>\n<p>Now residing in Hollywood, she plays regularly at comedy clubs including Laugh Factory, Comedy Store, and the Improv. She has appeared in Time Out New York Magazine, TBS.com, New York Post, NYU local, and the Jewish Press. She has toured colleges with Nice Jewish Girls Gone Bad, Skidmore College Comedy Festival, Rooftop Comedy&#039;s College Competition (finalist), NYU&#039;s &quot;Make Me Laugh&quot; comedy festival, the Ventura Comedy Festival, and the Laughing Skull Comedy Festival.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/img_2538.jpg",
  "PerformerId": "6800",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "6800",
  "pageUrl": "6800-ester-steinberg",
  "events": [
   "7695",
   "7697",
   "7748"
  ],
  "mc_events": [
   "7951",
   "7911"
  ]
 },
 {
  "Name": "Tony Sam",
  "Bio": "<p>Winner of the 2007 Chicago Comedy Award for Most Innovative Comedian, Sam has been heralded by the press for his ability to make the quirky &quot;hysterical&quot;, and was described as a &quot;stalwart of the emerging Chicago underground comedy scene,&quot; by UR Chicago. Earning his chops at the Chicago Second City Training Center, and IO Chicago (formerly ImprovOlympic), Sam has taken his life experiences and molded them into charming, hilarious, and memorable characters that will have you repeating his lines well after the show. In addition to appearing on the G4 Network&#039;s &quot;Attack of the Show,&quot; he is currently a voice actor, commercial actor, and writer for &quot;Ridiculousness&quot; on MTV.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/tonyarmyjackettheatrical.jpg",
  "PerformerId": "6130",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "6130",
  "pageUrl": "6130-tony-sam",
  "events": [
   "7637",
   "7711",
   "7741",
   "7751"
  ],
  "mc_events": [
   "7804"
  ]
 },
 {
  "Name": "Martin Morrow",
  "Bio": "<p>Martin Morrow is originally from Birmingham, AL where he started doing stand-up, improv, and belonged to an award winning sketch/stand-up hybrid &quot;Tubbi and Martin.&quot; He has performed in clubs, colleges, and festivals all over the country including Atlanta, Austin, Cleveland, Las Vegas, Los Angeles, New Orleans, and New York and has worked with some of the top names in comedy. </p>\n<p>Currently residing in Chicago, IL, Martin has performed in several shows with Second City as a part of their Outreach &amp; Diversity ensemble in addition to being a Second City PUMA scholarship recipient, and has put on several one man shows at The Playground Theater and MPaact Theater, and was a season 13 cast member of the longest running independent comedy showcase the Lincoln Lodge. His work has been featured on the Huffington Post, he was a finalist in the seventh season of the Impress These Apes comedy competition, and he performed in the 2013 TBS Just for Laughs Festival, but Martin is perhaps best known from his work in the 1953 Walt Disney classic Peter Pan as Peter Pan&#039;s shadow.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/mmmhs.jpg",
  "PerformerId": "6690",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "6690",
  "pageUrl": "6690-martin-morrow",
  "events": [
   "7653",
   "7733"
  ],
  "mc_events": []
 },
 {
  "Name": "Mike Lebovitz",
  "Bio": "<p>Mike entered comedy at the tender age of six with clowning classes at the local JCC. He’s been delighting and confounding audiences big and small with his accessibly off-beat brand of humor ever since. A father as well as a fat slob, Mike draws from a broad range of experiences in constructing his act, using outlandish viewpoints and subversive turns of phrase to highlight the inherent absurdity of being. He doesn’t point out life’s quirks; he rolls around and farts on them! A current member of Comedians You Should Know, Chicago’s premiere stand-up comedy collective, Mike is also curator and co-creator of Senorita Weiner&#039;s Top Secret Humor Experiment and Ice Cream Social Club, which is Chicago&#039;s longest-running clandestine comedy show in addition to being the original underground, members-only ice cream social. He is also starting to &quot;make it&quot; on TV where, if you look really closely, when the moon is just right, you may be able to catch a glimpse of tiny Lebo selling little bits of his integrity in order to hawk various products. A &quot;New Face&quot; at the 2013 Montreal Just For Laughs Comedy Festival, Mike has also made funny faces at the 2012 TBS Just For Laughs Festival (Chicago), the 2013 Montreux Comedy Festival (Switzerland) and weirded people out at the 2013 Gilda&#039;s Laughfest in Grand Rapids as well! Fun!</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/lebo_mirror_orig_copy.jpg",
  "PerformerId": "5739",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "5739",
  "pageUrl": "5739-mike-lebovitz",
  "events": [
   "7654",
   "7687",
   "7742",
   "7911",
   "8635"
  ],
  "mc_events": [
   "7688"
  ]
 },
 {
  "Name": "Ben Bizuneh",
  "Bio": "<p>Ben started doing stand-up in Bloomington, Indiana at the Comedy Attic while attending Indiana University. After graduating, he moved to Los Angeles, and can be seen performing wherever anyone will let him. He’s performed at the Limestone Comedy Festival, was a finalist in the Great American Comedy Festival, and has done no other festivals.</p>\n<p>He also makes videos in which he lies to people that have been featured on WorldStarHipHop, College Humor, What’s Trending, and The Bleacher Report. Ben hopes to one day be able to cry on command.</p>\n<p><a href=\"http://benbizuneh.tumblr.com\">http://benbizuneh.tumblr.com</a><br />\n<a href=\"http://youtube.com/lieguys\">http://youtube.com/lieguys</a></p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/picture_0.jpeg",
  "PerformerId": "6134",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "6134",
  "pageUrl": "6134-ben-bizuneh",
  "events": [
   "7637",
   "7693",
   "7701",
   "7914"
  ],
  "mc_events": [
   "7680"
  ]
 },
 {
  "Name": "Opeyemi Olagbaju",
  "Bio": "<p>Opeyemi &quot;Ope&quot; Olagbaju may be a young comic, but his love and commitment to stand up can always be seen on stage.  The OC/LAcomic. has been seen performing at various clubs(Irvine Improv, Ontario Improv, Brea improv, Spectacles Theater, Flappers) and colleges(UCSB, UCFC) throughout southern California.. Ope has  been noted for his observational humor and being able to craft hilarity from his own personal experiences of being an immigrant who assimilated into American culture and society. Through comedy Ope wants like to explore what makes us different and more importantly how these differences make us all the same.  His philosophy is that &quot;No matter where you&#039;re from, finding a way to laugh is a highly important component of the human experience and something we can all relate to. I&#039;m just glad I have been given the opportunity to make people laugh and share in that experience &quot;</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/ope_pic.jpg",
  "PerformerId": "6561",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "6561",
  "pageUrl": "6561-opeyemi-olagbaju",
  "events": [
   "7711",
   "7733",
   "7743"
  ],
  "mc_events": [
   "7748"
  ]
 },
 {
  "Name": "Lisa Best",
  "Bio": "<p>Lisa Best is one of the fresh faces to come out of the strong south Florida comedy scene.</p>\n<p>At the age of 15, Lisa pooped her pants and her classmate Billy Hidges called her a fartball. Since that pivotal moment of clarity and poo, Lisa began her training to turn embarrassing incidents into hilarity. No longer a novice, she skillfully sucks in her audiences with captivating vulnerability and story-telling flare. Now without pooping herself. </p>\n<p>Now 23 years old, Lisa Best currently resides in Los Angeles. She can be seen in Comedy Central&#039;s Dead Kevin sketch, &quot;Hot Girl Fail,&quot; starring in the film &quot;Something Funny,&quot; and also as a guest star in SyFy&#039;s hit Fangasm. She is also the creator and writer of the mockumentary-style webseries, &quot;The Apartment.&quot;</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot.png",
  "PerformerId": "5906",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "5906",
  "pageUrl": "5906-lisa-best",
  "events": [
   "7652",
   "7656",
   "7708",
   "7740",
   "7750"
  ],
  "mc_events": []
 },
 {
  "Name": "Andy Wood",
  "Bio": "<p>In addition to performing standup comedy for the last decade and \"dancing\" in the background of the nightclub scene in Birdemic 2, Andy is a co-founder and producer of the Bridgetown Comedy Festival and one of the guys behind the LA Podcast Festival. His electrical engineering degree has been gathering dust since his last “real” job ended back in ‘05, and the podcast Probably Science that he co-hosts with Matt Kirshen and Jesse Case is his attempt at remedying that while also getting to nit-pick plot points from Gravity.</p>\n<p>Since moving to Los Angeles in 2011, Andy has stayed busy working on shows including E!’s Love You, Mean It with Whitney Cummings and MTV’s Ridiculousness. You can follow him on Twitter @andytwood, and watch for him acting alongside Rob Corddry and Paul Scheer in the upcoming film Jason Nash Is Married on Comedy Central.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/andywood.jpg",
  "PerformerId": "6855",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "6855",
  "pageUrl": "6855-andy-wood",
  "events": [
   "7642",
   "7697",
   "7810"
  ],
  "mc_events": []
 },
 {
  "Name": "Peter McGraw",
  "Bio": "<p>Dr. Peter McGraw, a marketing and psychology professor at the University of Colorado Boulder, is an expert in the interdisciplinary fields of emotion and behavioral decision theory. His research examines the interrelationship of judgment, emotion, and choice, with a focus on consumer behavior and public policy. He is becoming a leading force in moving the science of humor from the niche to the mainstream. The advantage that McGraw has over his predecessors is his ability to conduct state-of-the-art experiments with the help of the team he directs at the Humor Research Lab (aka HuRL).McGraw received a B.A. in psychology and M.Ed. in educational psychology from Rutgers University and an M.S. and Ph.D. in quantitative psychology from The Ohio State University. His post-doctoral training was conducted at Princeton’s Woodrow Wilson School. His work has been covered by the BBC, MSNBC, Scientific American, Wall Street Journal, and the Financial Times. Most recently, McGraw made the 2013 Stylish Scientist List – probably because he likes to rock a sweater vest.</p>\n<p>McGraw is the co-author of The Humor Code: A Global Search for What Makes Things Funny.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/peter-mcgraw.jpg",
  "PerformerId": "7876",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "7876",
  "pageUrl": "7876-peter-mcgraw",
  "events": [],
  "mc_events": []
 },
 {
  "Name": "Christian Van Wade Ricketts",
  "Bio": "<p>Christian is funny and his friends think so too, and so do a bunch of other people who he is not close friends with. He has been in Bridgetown several times and the Comedy &amp; Burrito Festival in San Francisco. He has been doing stand up for 5 years.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/btwon_sbumission_pho.jpg",
  "PerformerId": "6591",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "6591",
  "pageUrl": "6591-christian-van-wade-ricketts",
  "events": [
   "7628",
   "7741",
   "7748",
   "7913"
  ],
  "mc_events": [
   "7625"
  ]
 },
 {
  "Name": "Rob Haze",
  "Bio": "<p>In a short amount of time, Rob Haze has become a rising star in stand up comedy.  The Atlanta native began his stand up journey while studying Political Science at the University of Georgia. There he would host and perform at many talent shows, pageants, and step shows. He went on to win the Athens Last Comic Standing contest. With a sense of humor that is full both of clever wordplay and references to popular culture, there is no wonder why Rob has become a favorite at the Laughing Skull Lounge, Punchline, and Uptown Comedy Corner.  Rob uses his gift to help others as well. In 2012, he won the Autism Laughs charity competition. He also was a writer and star of a (local) sketch comedy show called Cabbagetown. In 2012, Rob began to branch out from the Southeast, and was a finalist in the Bay Area Black Comedy Competition in Oakland, California.  He was a 2013 Finalist in the NBC Stand up for Diversity competition and is currently on their college tour. Rob has opened for many comics including Donnell Rawlins, Hannibal Buress, and most recently Dave Chappelle.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/improvedheadshot.jpg",
  "PerformerId": "5918",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "5918",
  "pageUrl": "5918-rob-haze",
  "events": [
   "7623",
   "7701",
   "7710"
  ],
  "mc_events": [
   "7628"
  ]
 },
 {
  "Name": "Will Smalley",
  "Bio": "<p>Fresh off the factory line with that “new car” smell, Comedian Will Smalley has readily established himself as a powerful voice and innovative joke writer in the Boston comedy scene. Will was a Finalist in the 2012 Boston Comedy Festival, has been featured in the Women In Comedy festival, and is a mainstay in the major comedy clubs and colleges across the Northeast. Will was selected in 2011 to be Comic In Residence and now hosts a monthly show at the renowned Comedy Studio in Cambridge.  Will has also been a writer for MY-TV Network.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/100114_will_029_webres.jpg",
  "PerformerId": "6699",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "6699",
  "pageUrl": "6699-will-smalley",
  "events": [
   "7706",
   "7748",
   "8631"
  ],
  "mc_events": [
   "7687"
  ]
 },
 {
  "Name": "Tom Sibley",
  "Bio": "<p>Tom is a comedian living in Los Angeles, CA. He does two podcasts, one on the WestCast Network called Goof City (which is like Cheers meets Mean Girls) and We Watch Wrestling (a podcast about professional wrestling...seriously) He has appeared on BBC America, FKR.TV&#039;s Law of the Land, and countless television commercials. He currently lives in a makeshift Russian retirement community and thinks dogs are far better than people.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/1393700_631839286867728_1805113915_n.jpg",
  "PerformerId": "6032",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "6032",
  "pageUrl": "6032-tom-sibley",
  "events": [
   "7654",
   "7663",
   "7692",
   "7708"
  ],
  "mc_events": [
   "7685"
  ]
 },
 {
  "Name": "Joel Warner",
  "Bio": "<p>Joel Warner is a former staff writer for Westword, Denver’s alternative newsweekly, and he has also written for Wired, Bloomberg Businessweek, The Boston Globe, Slate, Grantland, and other publications. While he’s exposed dirty cops and tackled city hall corruption with the best of them, he prefers stories about beer-delivering robots, Shaquille O’Neal’s sense of humor, and globe-trotting coffee expeditions gone awry. His work has been recognized by the James Beard Foundation Journalism Awards, the Best American Sports Writing anthology, the Casey Medals for Meritorious Journalism, the Dart Awards for Excellence in Coverage of Trauma, the Magazine Awards of Western Publishing and the AltWeekly Awards, among other honors.A graduate of Haverford College, Warner lives in Denver, Colorado, with his wife, Emily, and their two children, Gabriel and Charlotte. According to the vagaries of the Internet, Warner is an international expert on Swine Flu and one of the leading authorities on Casa Bonita, the over-the-top Mexican restaurant made famous by South Park.</p>\n<p>Warner is the co-author of The Humor Code: A Global Search for What Makes Things Funny.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/joel-warner.jpg",
  "PerformerId": "7877",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "7877",
  "pageUrl": "7877-joel-warner",
  "events": [],
  "mc_events": []
 },
 {
  "Name": "Adam Pasi",
  "Bio": "<p>Adam Pasi is a 33 year old comedian, who attempted and failed to grow up on both coasts and in 3 different countries, on account of his father being in the army.  To cope with being the chubby new kid almost every 3 years, he learned to depend on being funny when it came to making new friends.  While this didn&#039;t have him hoisted upon the shoulders of his classmates, he was able to develop some very meaningful friendships along the way.  </p>\n<p>Fast forward to adulthood (at least according to age) Adam has lived in Portland, Oregon for over a decade, and his sense of humor has led to him being the guy among his friends who tells everyone the usually dumb (yet funny) story of all the foolishness that happened the night before.  This led to him wanting to get on stage and tell anyone he could get to listen, all of the dumb (yet funny) stories about all of the foolishness that&#039;s ever happened to him ever, as well as a few of his observations on life, sexuality, Ke$ha, and pretty much whatever he finds amusing.  All from the perspective of a not quite grown up who claims that &quot;While I haven&#039;t matured to the point where I&#039;m behaving the way a man my age is supposed to, I have managed to build a life that&#039;s capable of withstanding my bullshit&quot; It&#039;s not like he&#039;s lived this outrageously unique adventure that you couldn&#039;t fathom without him explaining it to you. But he has enjoyed the usually dumb (yet funny) life that he&#039;s lived thus far, and he looks forward to enjoying sharing it with people.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/adamshot.jpg",
  "PerformerId": "6702",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "6702",
  "pageUrl": "6702-adam-pasi",
  "events": [
   "7623",
   "7656",
   "7704"
  ],
  "mc_events": [
   "7695"
  ]
 },
 {
  "Name": "Kortney Shane Williams",
  "Bio": "<p>Kortney Shane Williams is an international touring comedian that currently considers Seattle Washington to be his home. He has participated in Comedy Central’s, South Beach Comedy Festival, and has been featured on CBS.com. He was a 2012 Finalist in NBC’s Stand-Up for Diversity Showcase, and has opened for Dave Chappelle.</p>\n<p>Kortney’s unique, personable style of joke telling makes him a must see show. His most recent full length comedy album entitled, “I’m Right about This&quot; is available on iTunes.  He is also a writer and has been featured on Yahoo and FoxSports.com.  He is the founder and editor-in-chief of Comedic Prose, a comedy blog site that is regularly highlighted on Yardbarker. Currently he is working on a children’s comedy book that is slated to be finished in the winter of 2014.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/kortneyshanewilliams_-_headshot1.jpg",
  "PerformerId": "6153",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "6153",
  "pageUrl": "6153-kortney-shane-williams",
  "events": [
   "7672",
   "7680",
   "7689",
   "7733"
  ],
  "mc_events": []
 },
 {
  "Name": "Brian Mitchell ",
  "Bio": "<p>Brian Mitchell is a Jehovah’s Witness turned comedian that loves rejection and knocking on doors. He’s had the privilege of opening for TJ Miller, Louie Anderson and Josh Blue just to name a few. Brian was a finalist in the 2011 Sirius XM Opie &amp; Anthony Car Crash Comedy contest , then in 2012 , he made the finals at the Mangers Comedy Festival, and in 2013 he received second place in Yobi.tv’s funniest sketch contest for “Token Black Guy Infomercial”.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/551205_10100368796575892_874635003_n.jpeg",
  "PerformerId": "6410",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "6410",
  "pageUrl": "6410-brian-mitchell-",
  "events": [
   "7656",
   "7693",
   "7706",
   "7733"
  ],
  "mc_events": [
   "7663"
  ]
 },
 {
  "Name": "Doug Smith",
  "Bio": "<p>Doug Smith was featured as a New Face at the prestigious Montreal Just for Laughs Comedy Festival in 2013 after only four years as a stand-up comic. Since then he has appeared at the Oddball Comedy &amp; Curiosity Festival as well as AXS TV’s &quot;Gotham Comedy Live.&quot;  A regular at NYC clubs and alternative rooms, Doug continues to hone his talent and build his fan base. </p>\n<p>With a unique upbringing as the much younger child in a family of Jehovah’s Witnesses, Doug has plenty to draw from and is quickly becoming one of the sharpest writers in NYC. He has extensive improv training from the Upright Citizens Brigade Theater, and currently co-produces &quot;See You In Hell!,&quot; an award winning stand-up/variety show at The Creek and The Cave in Long Island City.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/dougsmith.jpg",
  "PerformerId": "6413",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "6413",
  "pageUrl": "6413-doug-smith",
  "events": [
   "7622",
   "7746",
   "7751",
   "7916"
  ],
  "mc_events": []
 },
 {
  "Name": "Gabe Dinger",
  "Bio": "<p>Gabe Dinger is a stand-up comedian and improviser from Portland Oregon. The winner of 2006&#039;s CBS Radio Laff Off, and the first runner up in Helium Comedy Club&#039;s 2013 &quot;Portland&#039;s Funniest Person&quot; contest, Gabe has been described by The Portland Mercury &quot;one of Portland&#039;s most reliable comedians.&quot;</p>\n<p>While Gabe was the first comedian in Oregon to perform at the Oregon State Maximum Security Prison, he has also preformed at the Bridgetown Comedy Festival and SF Sketchfest. Along with stand-up and sketch writing, he is also an accomplished improviser. He is an instructor and regular performer at Curious Comedy Theater. He is a co-founder of the improv troupe Whiskey Tango, who have been featured at the Los Angeles Improv Festival,  The Vancouver International Improv Festival, and SF Skechfest.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/gabedinger.jpg",
  "PerformerId": "5783",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "5783",
  "pageUrl": "5783-gabe-dinger",
  "events": [
   "7711",
   "7752",
   "7951"
  ],
  "mc_events": [
   "7747",
   "7721"
  ]
 },
 {
  "Name": "Philip Schallberger",
  "Bio": "<p>Philip Schallberger is Portland’s premier (only?) solo sketch-stand-up-whatever performer. He is a recurring guest in the Bridgetown Comedy Festival, and has recently been a part of the SLC Comedy Carnivale, Seattle Sketchfest, and San Francisco Sketchfest. Phil has been doing live comedy performance since 2007, and has only given up a bunch of times since then. The local papers seem to like what Phil does, and chances are you will as well. So give it a shot. Try Phil today.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/philip-schallberger.jpg",
  "PerformerId": "5951",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "5951",
  "pageUrl": "5951-philip-schallberger",
  "events": [
   "7621",
   "7687",
   "7694",
   "7749"
  ],
  "mc_events": []
 },
 {
  "Name": "Katherine Williams",
  "Bio": "<p>Katherine Williams is a NYC – based stand-up comic, actor and playwright. She graduated from James Madison University in her native Virginia and attended the Atlantic conservatory (founded by David Mamet and William H. Macy) in New York. </p>\n<p>As a stand-up comic, Katherine is a chronic oversharer, from her awkward attempts at intimacy to quieting the paranoid voices in her head. The youngest child from a devout Irish Catholic family, she experiences soul-crushing guilt and constant shame on a near-daily basis.</p>\n<p>Six of her plays have been produced in Manhattan including My Dead Mother is Funnier Than You (Plaidbird Productions) and The Shih Tzu Doesn’t Like Lesbians (On the Leesh Productions).  Her comedic solo show, CALL ME, was accepted into three New York theater festivals in 2010 - 2011, including the Midtown International Theatre Festival. Katherine has performed in the New York Underground Comedy Festival (2009, 2010) and the New York International Fringe Festival (2009, in Meryl Cohn’s sold-out hit, And Sophie Comes Too). Her work has been reviewed by Show Business Weekly and nytheatre.com. She was recently interviewed for Morgan Spurlock’s latest venture, Failure Club, an online series for Yahoo.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot_katherine_williams2_0.jpg",
  "PerformerId": "6163",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "6163",
  "pageUrl": "6163-katherine-williams",
  "events": [
   "7691",
   "7698",
   "7743"
  ],
  "mc_events": []
 },
 {
  "Name": "Nick Cobb",
  "Bio": "<p>Hailing from Memphis, TN, Nick Cobb attended Indiana University where he majored in Psychology and learned to obsess over meaningless nonsense. This led him to work in his first comedy club, aptly named “The Looney Bin.”  It was at a tiny Beale Street bar where Nick won a stand-up competition, was bitten by the comedy bug and moved to New York to pursue The Dream.  While in New York, Nick was seen on Comedy Central’s &quot;Live at Gotham,&quot; VH1’s &quot;Morning Buzz,&quot; AMC’s &quot;Date Night&quot; as well as on NBC’s “Last Comic Standing” where he not only earned a spot in the semi-finals, but was also featured in a montage of comics recognized for having highly original material.  Less than a year ago, Nick took his talents to Los Angeles.  Since moving out West he won the March Madness Competition at the Hollywood Improv, appeared on Comedy Central’s &quot;Inside Amy Schumer,&quot; and had his late night debut on The Late Late Show with Craig Ferguson.  He also recently performed on AXS’s Gotham Comedy Live.  He also played the lead in the espn.com comedic web series “Team Players,” and has been seen in many commercials including Pepsi Max, Asthma.com, Joe’s Crab Shack, Carmax and starred in an e*Trade spot during halftime of the Super Bowl!  When not performing standup, Nick is brooding over that one guy in the crowd who was texting during his act.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/webf_0321.jpg",
  "PerformerId": "5973",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "5973",
  "pageUrl": "5973-nick-cobb",
  "events": [
   "7690",
   "7911",
   "7916"
  ],
  "mc_events": [
   "7689"
  ]
 },
 {
  "Name": "David Zoe Leon",
  "Bio": "<p>David Leon is a Chicago native who began his comedy career in Madison, WI. David has shared the stage with many talented performers such as Emo Phillips, TJ Miller, James Adomian and Joey Diaz. David Leon&#039;s style of comedy, best described by the Onion A.V. club, &quot;plays on the yearning sentimentalist and inner-creep&quot; with a &quot;kid-on-sugar-high stage presence.&quot; With a demented persona and unpredictable topics, David Leon puts on a show that demands intensity and imagination from his audience and leaves a smile in their heart.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/davidleon.jpg",
  "PerformerId": "6629",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "6629",
  "pageUrl": "6629-david-zoe-leon",
  "events": [
   "7693",
   "7704",
   "7737",
   "7806"
  ],
  "mc_events": [
   "7912"
  ]
 },
 {
  "Name": "Joshua Murphy",
  "Bio": "<p>Joshua Murphy is standup comedian and sporadic sketch writer based out of Chicago, Illinois. Though a young comic on the scene, he has quickly moved up in the comedy world with his personal storytelling and socio-political comedy. He was the winner of the 2010 Bloomington Comedy Festival and a performer at the inaugural Limestone Comedy Festival. He was also a writer for the very popular “Fortnightly Show.” And, based on the writing of this bio, it is unnerving how comfortable he is writing in the third person.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/joshuamurphy-web-010.jpg",
  "PerformerId": "5962",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "5962",
  "pageUrl": "5962-joshua-murphy",
  "events": [
   "7679",
   "7690",
   "7694"
  ],
  "mc_events": [
   "7753"
  ]
 },
 {
  "Name": "Tim Hammer",
  "Bio": "<p>Young, fresh, full of life and Totino&#039;s pizza, Tim Hammer&#039;s style revolves around one-liners. Audience members often share his one-liners with their friends, and possibly enemies.</p>\n<p>In 2013, Tim performed at Bridgetown Comedy Festival, was a finalist in the Portland&#039;s Funniest Person Contest, and then a finalist in the Big Sky International Comedy Competition. He has performed at venues such as the Hollywood Improv, Helium Comedy Club, Seattle Comedy Underground, and Applebee&#039;s. </p>\n<p>In 2014, he performed at a Denny&#039;s.</p>\n<p>He does not lip-sync any of his material.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/tumblr_mz0uz62nnx1s46y2co2_1280.jpg",
  "PerformerId": "6727",
  "SortOrder": 300,
  "ExcludeFromList": false,
  "id": "6727",
  "pageUrl": "6727-tim-hammer",
  "events": [
   "7637",
   "7660",
   "7687"
  ],
  "mc_events": [
   "7751"
  ]
 },
 {
  "Name": "Barbara Holm ",
  "Bio": "<p>Originally from Seattle, Barbara Holm has performed at the San Francisco Sketchfest, the Bridgetown Comedy Festival, Bumbershoot Arts festival, and the Women in Comedy Festival in Boston. She has written for IGN, The Portland Mercury, Hahajk, and the Huffington Post. She has been awarded Time Out New York’s Joke of the Week and was named “one of the best things about comedy in 2012″ by the Comedy Bureau. Barbara writes a weekly humor column for The Portland Mercury about social injustice called, &quot;Don&#039;t be a Dick.&quot; </p>\n<p>Her comedy has been described as clever, unique, idiosyncratic, and exuberant. Seattle City Arts Magazine called her a “comedy wizard,” The Seattle Stranger newspaper called her an “adorable wunderkind,” and The Portland Mercury described her as a &quot;joke machine.&quot; She describes herself as, “running away from this question to hide under the desk right now.&quot;</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/x3enbmmmpzslrgjeqoqzs_dzipnybktx7ytxa6hy23wqcqikwjxkcgsvmo7_d9dwgufc5bcymja86prtc8m42it58j4cgom_zbkr3r1yssvtayvr9j5djmcbw73npein4_0.jpg",
  "PerformerId": "6102",
  "SortOrder": 350,
  "ExcludeFromList": false,
  "id": "6102",
  "pageUrl": "6102-barbara-holm-",
  "events": [
   "7648",
   "7679",
   "7734",
   "7807"
  ],
  "mc_events": [
   "7809"
  ]
 },
 {
  "Name": "Natasha Muse",
  "Bio": "<p>Natasha Muse is funny. She began performing in 2001 as “Ginger” at AsiaSF. Her friends claimed she was much too shy to be a good performer, and the fact that they were right didn’t stop her from trying it anyway. But, eventually, she sorta proved them all wrong.</p>\n<p>In 2008, Natasha made the leap from lip-synching to stand-up comedy, and began to create a buzz in the San Francisco comedy scene. Her cerebral wit, whimsical wordplay, and unique perspective on life have earned her the adoration of audiences and the respect of her peers. She’s guaranteed to be at least the second-funniest transexual you know.</p>\n<p>Natasha performs all over the Bay Area, including Cobb’s Comedy, the SF Punchline, Harvey’s, and the Dark Room. She has worked with such people as Wyatt Cenac, Pete Holmes, Ron Lynch, and Laurie Kilmartin.</p>\n<p>In addition to stand-up, Natasha produced and hosted the monthly underground hit “A Funny Night for Comedy” at the Actors’ Theatre, the cult podcast “Too Soon,&quot; and writes and performs with the sketch group Femikaze. She has also been declared &quot;a force to be reckoned with on Twitter.&quot;</p>\n<p>In 2013 the SF Weekly said she was a &quot;Comedian to Watch,&quot; and in 2012 they chose her as &quot;The Funniest Tranny in SF.&quot; </p>\n<p>Natasha has performed in Sketchfest 2013 and 2014, Comedy Day 2012 and 2011, and the first and only SF Comedy and Burrito Festival in 2012. She is also the winner of the 2010 Battle of the Bay competition, Miss Toolbox 2011, and also took home the Miss Photogenic trophy in Model Search 2004.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/natasha_high_res.jpg",
  "PerformerId": "6731",
  "SortOrder": 350,
  "ExcludeFromList": false,
  "id": "6731",
  "pageUrl": "6731-natasha-muse",
  "events": [
   "7688",
   "7710",
   "7807",
   "8632"
  ],
  "mc_events": []
 },
 {
  "Name": "Sachi Ezura",
  "Bio": "<p>Sachi Ezura is a comedian, writer, and producer, who works in development and talent for MTV2. After graduating from Harvard, she chose to disappoint her parents by pursuing a career in comedy. She is a co-writer on the upcoming Girl Code book, available at Urban Outfitters, and has contributed writing to the Huffington Post and Comedy Central Insider. She has produced comedy for the MTV Comedy Showcase, the NY Comedy Festival, Laughter in the Park, Schtick or Treat, the Quarterly Arts Soiree and 50 First Jokes. She co-hosts and produces Sledgehammer, a stand-up open mic at UCB East and Comedy at Alligator Lounge, a free weekly stand-up show. She is also a trained improviser, having completed the Advanced Study program at the Upright Citizens Brigade Theater and has performed improv at the Del Close Marathon and the Chicago Improv Festival. She is half Japanese, 1/4 Puerto Rican, 1/8 Swedish, and 1/8 German; and she is willing to milk those facts for whatever diversity showcases she can get on. She was born and raised in New York City and has cried in most public places across Manhattan (and some parts of Brooklyn!)</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/67874_10100562085767411_60497619_n.jpg",
  "PerformerId": "6118",
  "SortOrder": 350,
  "ExcludeFromList": false,
  "id": "6118",
  "pageUrl": "6118-sachi-ezura",
  "events": [
   "7690",
   "7751"
  ],
  "mc_events": [
   "7637"
  ]
 },
 {
  "Name": "Nick Sahoyah",
  "Bio": "<p>Nick Sahoyah is a writer and comedy producer based out of Seattle, Washington.  In addition to performing at and hosting comedy showcases across Seattle, Nick co-produces the popular weekly comedy night at Scratch Deli on Capitol Hill.  His past production projects include organizing and emceeing the comedy stage at &#039;Mo Wave 2013 (Seattle&#039;s first all queer music and arts festival).  Shortly after, Nick co-produced and hosted Seattle Pride Week&#039;s biggest comedy show, &quot;Out &amp; In&quot; at the Neptune Theater; a benefit in partnership with Gay City Health Project.</p>\n<p>Apart from stand up, Nick produces the cult sketch/sitcom webshow &quot;Monsoon Season&quot; starring Jinkx Monsoon (winner of RuPaul&#039;s Drag Race Season 5), which he directs, co-writes, and co-stars in (<a href=\"http://www.funnyordie.com/monsoonseason\">http://www.funnyordie.com/monsoonseason</a>), and hosts his own podcast, &quot;That&#039;s Provocative! with Nick Sahoyah&quot; (<a href=\"http://www.nicksahoyah.com\">http://www.nicksahoyah.com</a>).</p>\n<p>Nick has previously performed stand up at Bumbershoot Music &amp; Arts Festival (2011/2012), &#039;Mo Wave (2013), Summer Meltdown Festival (2013), and Dallas Comedy Festival (2013).</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/sahoyah.jpg",
  "PerformerId": "5879",
  "SortOrder": 350,
  "ExcludeFromList": false,
  "id": "5879",
  "pageUrl": "5879-nick-sahoyah",
  "events": [
   "7641",
   "7653",
   "7753"
  ],
  "mc_events": [
   "8631"
  ]
 },
 {
  "Name": "Katie Nguyen",
  "Bio": "<p>Katie Nguyen is a Portland-based comedian and vending machine whisperer. She has performed at Curious Comedy Theater, taken part in Dis/orient/ed Comedy, and was a semifinalist in Helium Comedy Club&#039;s Portland&#039;s Funniest Person Contest. Katie’s style can be described as “comedy” and “style.” As an ensemble member at the Brody Theater, Katie performs in a variety of improv, stand-up, and sketch shows, and was once hired to play an Eastern European rhythmic gymnast for a barn full of teachers. Katie also writes sketch, performs, and wears vests with the group Vestivus. From ComedySportz to non-profit fundraisers to Chinese restaurants, Katie’s delighted folks and shamelessly laughed at her own jokes. Watch out for her— she&#039;s very short and easy to lose in crowds.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/tumblr_mxosdqaejf1s46y2co1_1280.jpg",
  "PerformerId": "6686",
  "SortOrder": 350,
  "ExcludeFromList": false,
  "id": "6686",
  "pageUrl": "6686-katie-nguyen",
  "events": [
   "7704",
   "7807",
   "7809",
   "7911"
  ],
  "mc_events": []
 },
 {
  "Name": "Jeff Oliver",
  "Bio": "<p>Jeff Oliver is a filmmaker, comedian, musician and writer. He has previously appeared at the 2012 Bridgetown Comedy Festival and has made appearances on Fox News’ Red Eye with Greg Gutfeld, NPR&#039;s Tell Me More, and on numerous podcasts.</p>\n<p>Jeff is a former writer for the web series The Spicy News and a former guitarist for The Arcadians. He co-directed, wrote and starred in the comedic short film &#039;Meta Feta&#039; which appeared at the DaVinci Days Film Festival in 2010.</p>\n<p>Originally from the Pacific Northwest he currently lives in New York City where he is directing his first feature film ‘A Summer To Discover.’ He is a contributor for Savage Henry Magazine.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/2014_headshot_1-2_web.jpg",
  "PerformerId": "5999",
  "SortOrder": 350,
  "ExcludeFromList": false,
  "id": "5999",
  "pageUrl": "5999-jeff-oliver",
  "events": [
   "7632",
   "7698",
   "7733"
  ],
  "mc_events": [
   "8633"
  ]
 },
 {
  "Name": "Rhiannon Archer",
  "Bio": "<p>Rhiannon Archer is a standup comedian and amateur crooner hailing from Toronto Canada. She has written for television shows such as CBC’s &quot;George Stroumboulopoulos Tonight&quot; and CTV’s new sitcom, &quot;Spun Out.&quot; She has been nominated for 2 Canadian Comedy Award for Best Newcomer and Best Comedy short. </p>\n<p>Rhiannon has been a part of many festivals throughout North America such as Just For Laughs 42, NXNE, Dark Comedy Festival, Boston Women in Comedy, All Jane no Dick, and the Seattle International Comedy Competition.</p>\n<p>She cannot do mathematics under pressure, or tell you anything specific about history prior to 1980&#039;s. She has cats, enjoys sour keys and walking, hates mayo and mushrooms and when her food touches.</p>\n<p>Rhiannon Archer is a stand out in a group of up and coming comics that keep Toronto an epicenter for new talent.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/rhiannonarcher.jpg",
  "PerformerId": "6392",
  "SortOrder": 350,
  "ExcludeFromList": false,
  "id": "6392",
  "pageUrl": "6392-rhiannon-archer",
  "events": [
   "7628",
   "7667",
   "7809"
  ],
  "mc_events": []
 },
 {
  "Name": "Kyle Mizono ",
  "Bio": "<p>Originally from San Francisco, Kyle Mizono is a comedian and one of the last international Beanie Baby collectors. Along with being a regular performer in San Francisco and Los Angeles, her festival performances include Edinburgh Fringe and Portland’s All Jane No Dick festival. Currently, Kyle is the Junior Producer of The Super Serious Show. Her comedy was once described as a “breath of fresh air” but she prefers to be described as a “tall glass of piping hot water.”</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/kyle_mizono_0.jpg",
  "PerformerId": "5755",
  "SortOrder": 350,
  "ExcludeFromList": false,
  "id": "5755",
  "pageUrl": "5755-kyle-mizono-",
  "events": [
   "7653",
   "7702",
   "7809",
   "7815"
  ],
  "mc_events": []
 },
 {
  "Name": "Zak Toscani",
  "Bio": "<p>Zak Toscani is a Portland based comedian who performs regularly in the Pacific Northwest (Helium Comedy Club Portland, Seattle&#039;s Comedy Underground, Bumbershoot, Funny Over Everything). His style melts like an artisan cheese into both the honest and the silly, much like Dom DeLuise&#039;s lasagna recipe.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/5853_570305192056_5104679_n_0.jpg",
  "PerformerId": "5919",
  "SortOrder": 350,
  "ExcludeFromList": false,
  "id": "5919",
  "pageUrl": "5919-zak-toscani",
  "events": [
   "7699",
   "7708",
   "7750"
  ],
  "mc_events": [
   "7697"
  ]
 },
 {
  "Name": "Stephanie Hasz",
  "Bio": "<p>Stephanie has performed at clubs including Zanies and the Laugh Factory; alternative rooms and venues such as the Upright Citizens Brigade Theatre, the Hideout, Chicago Underground Comedy, and The Creek and The Cave; and festivals including the Bentzen Ball, High Plains Comedy Festival, and Crom Fest. The AV Club called her one of “the city’s most exciting up-and-comers,” and Time Out Chicago described her as displaying “a fury and vulnerability rarely seen from female comics.” She has also been featured yelling about things in the Chicago Tribune and the Chicago RedEye.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/stephaniehasz_headshot.jpg",
  "PerformerId": "6312",
  "SortOrder": 350,
  "ExcludeFromList": false,
  "id": "6312",
  "pageUrl": "6312-stephanie-hasz",
  "events": [
   "7653",
   "7691",
   "7783"
  ],
  "mc_events": [
   "7693"
  ]
 },
 {
  "Name": "Danny Felts",
  "Bio": "<p>A spry up-and-comer in the Portland, OR comedy scene, Danny’s comedic style contains elements of storytelling, and surrealism, all in the name of shedding light on the hidden absurdities the universe chooses to dump on him. </p>\n<p>Felts has been featured on the ole TVs a couple times, most notably on IFC&#039;s “Portlandia”, and Oregon Public Broadcasting’s “Art Beat”. He has also performed in the Bridgetown Comedy Festival (2012-13), the Bumbershoot Music and Arts Festival (2012-13), the 2013 Savage Henry Comedy Festival, the 2013 Salt Lake City Comedy Carnivale, and the 2013 Cleveland Comedy Festival, (2013 was a busy year). </p>\n<p>When he is not performing, he can be found editing the wildly popular/masochistic web series The Spicy News, which he is also a contributing writer to. He performs regularly around the Northwest, and can be seen in Portland, OR, Seattle, WA, and occasionally Northern California.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/bio_pic.jpg",
  "PerformerId": "6042",
  "SortOrder": 350,
  "ExcludeFromList": false,
  "id": "6042",
  "pageUrl": "6042-danny-felts",
  "events": [
   "7685"
  ],
  "mc_events": [
   "7621",
   "7806"
  ]
 },
 {
  "Name": "Jordan Casner",
  "Bio": "<p>Originally from McMinnville, Oregon, Jordan Casner has been living and performing comedy in Portland for the last few years. His brand of comedy really isn&#039;t branded yet. But that&#039;s what people are into now, right? One thing that is certain is that his medium for performance is always changing. You might hear a song, you might hear some jokes, you might see him get choked to death in a horse mask. Jordan has performed at the Bridgetown Comedy Festival and has been a guest on shows like Funny Over Everything and The Spicy News.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/tigers.jpg",
  "PerformerId": "6049",
  "SortOrder": 350,
  "ExcludeFromList": false,
  "id": "6049",
  "pageUrl": "6049-jordan-casner",
  "events": [
   "7628",
   "7637",
   "7746"
  ],
  "mc_events": [
   "7654"
  ]
 },
 {
  "Name": "Jackson Banks ",
  "Bio": "<p>A film major at the University of Utah,  Jackson Banks&#039; history is in comedy film making, and he has been doing stand up for a little under two years.  He enjoys visual, surreal joke telling.  He has recently participated in the Seattle International Comedy Competition, Salt Lake City&#039;s One Mic Stand, and Park City&#039;s Egyptian Theater Comedy Showcase.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/jackson-banks-200x300_0.jpg",
  "PerformerId": "5777",
  "SortOrder": 350,
  "ExcludeFromList": false,
  "id": "5777",
  "pageUrl": "5777-jackson-banks-",
  "events": [
   "7653",
   "7694",
   "7702",
   "7753"
  ],
  "mc_events": []
 },
 {
  "Name": "Ryan Singer",
  "Bio": "<p>Ryan Singer is the rarest of breeds: A comic’s comic who electrifies mainstream audiences with material that is both uncompromising and unpretentious.   LaughSpin says, “With his high-energy delivery and unpretentious leanings, there’s not a lot to dislike about comedian Ryan Singer. And it’s not just us saying it: In the last few years, he’s won over audiences headlining the nation’s finer comedy clubs and was hailed by Marc Maron in Rolling Stone as a comedian “who should be big.”</p>\n<p>Both his debut album and sophomore release COMEDY WONDER TOWN were selected as Top 10 Comedy CD’s of the year (2010 &amp; 2012).  He was selected by LA Weekly as one of “10 LA Comics to Watch” for 2014, was mentioned in NY Magazine as a “Comic to Watch,” was one of 4 finalist in CMT’s Next Big Comic Contest, is a frequent guest on the WTF Podcast w/Marc Maron and the Bob &amp; Tom Show, regularly heard on XM/Sirius Satellite Radio, and was a regional finalist in Comedy Central’s Open Mic Fight.  He was the winner of the Golden Shingle Award at the Rooftop Comedy Festival, an award given to the next rising star in comedy.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/ryan_singer_under_1mb.jpg",
  "PerformerId": "6319",
  "SortOrder": 350,
  "ExcludeFromList": false,
  "id": "6319",
  "pageUrl": "6319-ryan-singer",
  "events": [
   "7711",
   "7734",
   "7806",
   "7815"
  ],
  "mc_events": [
   "7915"
  ]
 },
 {
  "Name": "Erin Dewey Lennox",
  "Bio": "<p>ERIN DEWEY LENNOX is a writer / comedian based in Los Angeles, CA.  She has performed at clubs, colleges, and alternative venues in over 30 states and at the Women in Comedy Festival, the Cape Fear Comedy Festival, the Out of Bounds Comedy Festival, and at an impromptu roast of her grandfather.  She has written for ESPN, MTV, NFL Gameday, and McSweeney&#039;s.  She also writes a lot of the commercials you fast forward through.  Erin studied journalism at the University of North Carolina Chapel Hill and drank a lot at football games.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/erinlennox.jpg",
  "PerformerId": "6456",
  "SortOrder": 350,
  "ExcludeFromList": false,
  "id": "6456",
  "pageUrl": "6456-erin-dewey-lennox",
  "events": [
   "7730",
   "7743",
   "7913",
   "7916"
  ],
  "mc_events": [
   "7623"
  ]
 },
 {
  "Name": "Dina Hashem",
  "Bio": "<p>Dina Hashem first tried stand-up by auditioning for the 2010 New Jersey Comedy Festival at Rutgers University. After winning 1st place, she continued to pursue comedy and has since been performing regularly at clubs including Broadway Comedy Club, Caroline&#039;s, The Laughing Devil, Comic Strip Live, and The Stress Factory.</p>\n<p>Dina&#039;s memorable style contrasts a subtle delivery with witty observations and dark musings on her cultural upbringing. She was a semi-finalist in the She-Devil Comedy Festival and Laughing Devil Comedy Festival, and a participant of Gilda&#039;s Laugh Fest and the Jersey City Comedy Festival. Her writing has also been featured on the websites of Comedy Central and Nickelodeon.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/dina-hashem-headshot.jpg",
  "PerformerId": "6640",
  "SortOrder": 350,
  "ExcludeFromList": false,
  "id": "6640",
  "pageUrl": "6640-dina-hashem",
  "events": [
   "7911",
   "7913"
  ],
  "mc_events": [
   "7690"
  ]
 },
 {
  "Name": "Paul Jay",
  "Bio": "<p>Paul Jay used to do comedy in Los Angeles. Now he does it in Portland. He has performed at every Bridgetown Comedy Festival, one Bumbershoot, one Helium, and several podcasts. He recently transitioned from Cat Person to Dog Person and has not figured out how to tell his comedian friends.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/paul_possible_headshot_4.jpg",
  "PerformerId": "6509",
  "SortOrder": 350,
  "ExcludeFromList": false,
  "id": "6509",
  "pageUrl": "6509-paul-jay",
  "events": [
   "7665",
   "7739",
   "7751",
   "7753",
   "8635"
  ],
  "mc_events": []
 },
 {
  "Name": "JoAnn Schinderle",
  "Bio": "<p>JoAnn Schinderle hails from the upper Midwest and despite being a Portlander now, will probably never lose her “hot dish” accent. (Hotdish ingredients include but are not limited to: ground beef, canned vegetables, canned soup, cheese, and tater tots.) For the past year,  JoAnn has been making strides in Portland’s thriving comedy scene by way of stand-up and improv. Recently performing in the All Jane No Dick comedy festival and 2014&#039;s SF Sketchfest, as a stand-up her humor is relatable, snarky, and has a storytelling style that will make you feel like she’s your best friend letting you in on a secret. As an improviser and member of the Curious Comedy House Team ensemble, she creates big characters and will “yes and” the shit out of you. JoAnn’s performed both mediums at venues in Chicago (Second City Training Center) and all around Portland (Curious Comedy Theater, Brody Theater, and Funhouse Lounge.) If you enjoy friendly banter you can follow JoAnn on twitter @joannlizabeth</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/tumblr_mypy0mh21n1s46y2co2_r1_1280.jpg",
  "PerformerId": "5983",
  "SortOrder": 350,
  "ExcludeFromList": false,
  "id": "5983",
  "pageUrl": "5983-joann-schinderle",
  "events": [
   "7704",
   "7738",
   "7807",
   "7912"
  ],
  "mc_events": [
   "7752"
  ]
 },
 {
  "Name": "Todd Masterson",
  "Bio": "<p>Todd Masterson is a writer and comedian who lives with his tiny husband (Todd is 6&#039;7&quot; and his husband is 5&#039;4&quot;) and their little black pug in West Hollywood, CA. Todd is best known as one of the nine writers that went on strike from Fashion Police with Joan Rivers last year. He&#039;s also appeared on Arsenio, as well as written for the Roast of James Franco. Todd produces a monthly show called All That Could Have Been, for writers to read the submission packets they&#039;ve written for shows, but never got the job. He&#039;s opened for Jimmy Fallon on the college circuit and appears all around Los Angeles in several popular shows.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot_2013_1.jpg",
  "PerformerId": "6359",
  "SortOrder": 350,
  "ExcludeFromList": false,
  "id": "6359",
  "pageUrl": "6359-todd-masterson",
  "events": [
   "7654",
   "8631"
  ],
  "mc_events": [
   "7678"
  ]
 },
 {
  "Name": "Molly Fite ",
  "Bio": "<p>Molly Fite is a native of Vancouver, Washington, and has a B.A. in Drama from Bennington College and an M.F.A. in Acting from University of California San Diego. La Jolla Playhouse credits include: The Physicists, Catching Flight, The Adding Machine, Killer Joe, The Skin of Our Teeth, Heart of a Dog,The Labyrinth of Desire, Freedom, New York, and Moliere: A Cabal of Hypocrites. South Coast Repertory: Pride and Prejudice. She has performed at LaMama, H.E.R.E., and The Ensemble Studio Theatre in New York City. </p>\n<p>She performs stand-up, sketch, and improv comedy all over Portland and Los Angeles, and has trained at the Upright Citizens Brigade Theatre, I.O. West, The Groundlings, and Second City. She performs monthly with her sketch team Size Queen at I.O. West, and hosts No Pressure: A Storytelling Show also at I.O West. She recently performed at the all women&#039;s comedy festival All Jane and No Dick in 2013. Her video parody &quot;Not Another Sundance Movie&quot;  has been featured on the Hufffington Post, Usatoday.com,  The New York Post, geektyrant,  and slashfilm.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/fite_amalia-img_3444-09-02-09_15_29_42.jpg",
  "PerformerId": "6745",
  "SortOrder": 350,
  "ExcludeFromList": false,
  "id": "6745",
  "pageUrl": "6745-molly-fite-",
  "events": [
   "7695",
   "7741",
   "7918",
   "8579"
  ],
  "mc_events": [
   "7656"
  ]
 },
 {
  "Name": "Jacob Christopher",
  "Bio": "<p>Half shark alligator, half man, Jacob Christopher has been seen and heard all across the Pacific NW, sharing his stories with the masses. Starting his comedy career in 2010, Jacob has become a regular working comic at Helium and Harveys, and has also been featured in many great Portland showcases such as Midnight Mass, Spicy News, Tonic, Fly Ass Jokes, and more. With his unique story telling, he shares tales of triumph and tragedy, good times and hardships, and takes the audience on an emotional roller coaster that will leave you wanting more. Please keep your arms and legs inside the ride and remain seated until he comes to a full stop. If you are breast feeding or pregnant, you may want to consult a physician prior to hearing him. You can check out his website @ Jacobchristophercomedy.com for upcoming shows and video clips, or look at his pics if you just want to bask in his ginger glory. </p>\n<p>Also, he is a big fan of karaoke.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/portland-photographer-jayesunn-xl4.jpg",
  "PerformerId": "6128",
  "SortOrder": 400,
  "ExcludeFromList": false,
  "id": "6128",
  "pageUrl": "6128-jacob-christopher",
  "events": [
   "7672",
   "7691",
   "7737"
  ],
  "mc_events": [
   "7704",
   "7720"
  ]
 },
 {
  "Name": "Nariko Ott",
  "Bio": "<p>Phoenix escapee, Nariko Ott is the most tenacious thing to crawl out of the desert since that biker dude with the baby shoes from Raising Arizona.  Although not nearly as intimidating.  </p>\n<p>Since moving to Oregon in 2011, Nariko has been named Finalist in both the 2013 “Portland’s Funniest Person” contest and 2012 “Willamette Valley’s Funniest Person” contest.  Always working, Nariko has established himself in the comedy community by regularly hosting at Harvey’s Comedy Club as well as performing at Helium Comedy Club for their “Portland All-Stars” showcases.  He’s written for sketch comedy troupes “Bully Mammoth” and “Dr. Proof’s Whiz Bang Science Super Hour (More Than an Hour).”  Currently he travels as a feature comedian all along the west coast and is the Co-Creator/Producer of “Lex Hilaris” a Comedy &amp; Metal Showcase at the White Owl Social Club in his new hometown of Portland, Oregon.</p>\n<p>Nariko Ott was named in a “Who’s Who” of comedy article in the Portland Mercury (“Comedy Is OK”, August 28th, 2013) saying it best with, “Nariko Ott has decided that comedy can be metal.” A decision he still stands by.  He has very long hair.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot1_2.jpg",
  "PerformerId": "6542",
  "SortOrder": 400,
  "ExcludeFromList": false,
  "id": "6542",
  "pageUrl": "6542-nariko-ott",
  "events": [
   "7656",
   "7665",
   "7704"
  ],
  "mc_events": [
   "7672"
  ]
 },
 {
  "Name": "Curtis Cook",
  "Bio": "<p>Curtis Cook is a comic from Cleveland, Ohio now living in Portland, Oregon.  He has performed in venues and festivals throughout the country, including the Cleveland Comedy Festival, Salt Lake City’s Comedy Carnivale, Bridgetown Comedy Festival, and San Francisco’s Sketchfest.</p>\n<p>Curtis doesn’t like a lot of things, and has been referred to as a “charming nihilist,” “the physical embodiment of insecurity,” and, “an existential crisis on stage.”  Those are almost nice things to say about a person. </p>\n<p>You can follow him on twitter at @Curtis_Cook.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot_-_curtis_cook.jpg",
  "PerformerId": "6276",
  "SortOrder": 400,
  "ExcludeFromList": false,
  "id": "6276",
  "pageUrl": "6276-curtis-cook",
  "events": [
   "7632",
   "7694",
   "7701"
  ],
  "mc_events": [
   "7641"
  ]
 },
 {
  "Name": "Steven Wilber",
  "Bio": "<p>&quot;Offbeat,&quot; &quot;unexpected&quot; and &quot;clever&quot; are just three of literally hundreds of words used to describe the comedy-style stylings of Steven Wilber. Since starting stand-up in 2011, Steven has risen up in the Portland comedy scene to become a frequent performer at arcade bars, anarchist bookstores, Doctor Who-themed seafood restaurants and other typical comedy venues this city has to offer.</p>\n<p>Steven has shared the stage with Chris Hardwick, Mary Lynn Rajskub, Sean Patton and Ron Funches...whether they wanted him to or not. He has performed at Bumbershoot,  the Savage Henry comedy festival, has been featured on Bryan Cook&#039;s Competitive Erotic Fan Fiction podcast, and is a writer for The Spicy News web series.</p>\n<p>He also has over 23,000 Vine followers, which he&#039;s been told is a good thing to include in a bio.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/stevenbridgetownheadshot.jpg",
  "PerformerId": "6215",
  "SortOrder": 400,
  "ExcludeFromList": false,
  "id": "6215",
  "pageUrl": "6215-steven-wilber",
  "events": [
   "7693",
   "7702",
   "7738",
   "7967"
  ],
  "mc_events": [
   "7653"
  ]
 },
 {
  "Name": "Tanner Hodgeson",
  "Bio": "<p>Tanner Hodgeson is a scared little man. He moved to Seattle from Texas three years ago to work as a software developer. He started performing comedy soon after as a way of spreading the nonsense contained inside him. He has performed in Bumbershoot Music &amp; Arts Festival as well as local shows in the Seattle, Tacoma, and Bellingham areas including Comedy, Mystery, and Mutants! and Competitive Erotic Fan Fiction.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/cool.jpg",
  "PerformerId": "6483",
  "SortOrder": 400,
  "ExcludeFromList": false,
  "id": "6483",
  "pageUrl": "6483-tanner-hodgeson",
  "events": [
   "7652",
   "7690",
   "7704"
  ],
  "mc_events": [
   "7743"
  ]
 },
 {
  "Name": "Wilfred Padua",
  "Bio": "<p>Wilfred Padua is a comedian from Seattle, WA. He spent two years in Chicago getting an MFA in Writing only to come back to Seattle to do exactly what he was doing before he left. He has performed at Laff Hole, Bumbershoot Music Festival, and at Summer Meltdown Music Festival. He is also a coproducer of the monthly Seattle showcase, The Good Fun Show.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshot_22.jpg",
  "PerformerId": "6564",
  "SortOrder": 400,
  "ExcludeFromList": false,
  "id": "6564",
  "pageUrl": "6564-wilfred-padua",
  "events": [
   "7621",
   "7690",
   "7695"
  ],
  "mc_events": [
   "7737"
  ]
 },
 {
  "Name": "Scott Losse",
  "Bio": "<p>Scott Losse is a cat owner and stand-up comedian from Seattle, Washington. He has performed at Bumbershoot: Seattle&#039;s Music &amp; Arts Festival, The Seattle International Comedy Competition, Sketchfest, and lots of other places you&#039;ve never heard of. Scott&#039;s stand-up is smart, absurd, and at times dark. You would probably like it. Scott has appeared on Seattle&#039;s Evening Magazine and is the winner of the 2013 Wenatchee Comedy Festival. His cat&#039;s name is Kitty. She&#039;s a real asshole.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/scottlosse1024x816.jpg",
  "PerformerId": "5787",
  "SortOrder": 400,
  "ExcludeFromList": false,
  "id": "5787",
  "pageUrl": "5787-scott-losse",
  "events": [
   "7672",
   "7697",
   "7806"
  ],
  "mc_events": [
   "7919"
  ]
 },
 {
  "Name": "Yogi Paliwal",
  "Bio": "<p>A standup comedian based out of Seattle,Yogi Paliwal has performed around the country at comedy clubs, theaters and festivals including the San Francisco and Seattle Sketch Fest, The Bridgetown Comedy Festival, and at the NBC Standup for diversity Showcase in Seattle. He’s written for IGN and Frank and Funny greeting cards.</p>\n<p>Carl Warmenhoven the manager of the Comedy Underground has said, “He has a youthness about him.” He enjoys the simple things in life, a grilled cheese sandwich, Bob Ross, whittling, and he gets bored writing his own bio.</p>\n<p>If you were to ask Yogi how he would describe his comedy, he would say it’s “Intellectual absurdity.” If you asked him what that means he would say, “My material isn’t smart, but you need to be smart to see how stupid the joke is.”</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/1mb_mg_4142.jpg",
  "PerformerId": "6704",
  "SortOrder": 400,
  "ExcludeFromList": false,
  "id": "6704",
  "pageUrl": "6704-yogi-paliwal",
  "events": [
   "7632",
   "7688",
   "8633"
  ],
  "mc_events": [
   "7750"
  ]
 },
 {
  "Name": "Anatoli Brant",
  "Bio": "<p>Born and raised in former USSR, Anatoli moved to California at age of 23. He started comedy in 2002/2003 in San Francisco. He has performed comedy at the San Jose Improv, Punch Line San Francisco, Flappers Burbank as part of Recovering Communist Tour, and in New York at Gotham, Carolines and Standup NY.</p>\n<p>In 2010, he took third place in Battle of The Bay competition in San Francisco, and in 2013, he was a finalist in the Helium Funniest Person competition in Portland. He produces  Comedy Bull and 7 on 7 at Brody Theater in Portland, OR.</p>\n<p>Regardless of being foreigner - has strong command of English language and fresh and obscure points of view on life in US and in general :).</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/anatolihs.jpg",
  "PerformerId": "5932",
  "SortOrder": 400,
  "ExcludeFromList": false,
  "id": "5932",
  "pageUrl": "5932-anatoli-brant",
  "events": [
   "7688",
   "7753",
   "7912"
  ],
  "mc_events": [
   "7807"
  ]
 },
 {
  "Name": "Monica Nevi",
  "Bio": "<p>Monica Nevi is a native of the Seattle, Washington and the product of a wonderfully humorous family and diverse background. While earning her degree at Seattle University and losing her collegiate basketball player career to injuries, Monica decided to move forward with another untraditional path and pursue her strong interest in stand-up comedy. </p>\n<p>She has performed all over the West Coast, in the 2012 Bridgetown Comedy Festival, and in the 2013 Seattle International Comedy Competition. Monica is a regular at the Tacoma Comedy Club, and a drunk woman once told her she was the &quot;funniest skinny white girl&quot; she had ever seen.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/monicanevi-1084-2_0x3_0-16a_0.jpg",
  "PerformerId": "5806",
  "SortOrder": 450,
  "ExcludeFromList": false,
  "id": "5806",
  "pageUrl": "5806-monica-nevi",
  "events": [
   "7624",
   "7632",
   "7689",
   "7751"
  ],
  "mc_events": []
 },
 {
  "Name": "Kipleigh Brown",
  "Bio": "<p>Kipleigh is an actress/comedienne and Chicago native, now based in LA. Every Sunday night she stars in \"Top Story! Weekly,\" a sketch comedy romp through the headlines presenting a brand new show every week at the iO West theatre in Hollywood (Sundays at 8pm). The Los Angeles Times says \"Catch 'Top Story! Weekly' before ‘Saturday Night Live’ cannibalizes the cast!\" The Examiner says, \"Kipleigh Brown poetically slaps thefaces of any critic that says women ain’t funny.\"</p>\n<p>Kipleigh also performs character-based comedy and has played clubs such as Zanies in Chicago and Vernon Hills and The Laughing Skull in Atlanta. Kipleigh recently played the leading role in the award-winning feature film noir “Yesterday Was A Lie,\" (available on Netflix). Other credits include \"RUR: Genesis,\" “Star Trek: Enterprise,” Disney’s “The Suite Life of Zack &amp; Cody,” and CBS’s “The Magic Door.\" </p>\n<p>Kipleigh’s interests include: listing her interests, androids and relaxing evenings spent outdoors staring at your home. Please make every effort to avoid visiting<br /><a href=\"http://www.kipleigh.com\">www.kipleigh.com</a>.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/kipleigh_grnr2-6a_apr2014.jpg",
  "PerformerId": "7883",
  "SortOrder": 600,
  "ExcludeFromList": false,
  "id": "7883",
  "pageUrl": "7883-kipleigh-brown",
  "events": [
   "7661",
   "7804"
  ],
  "mc_events": []
 },
 {
  "Name": "Demorge Brown",
  "Bio": "<p>Demorge Brown is an LA based performer writer, and director, who curates the monthly comedy happening &quot;Blam! Blam! Blam!&quot; with actor and comic Matt Peters.  He has written for and appeared on stage with the Groundlings and the Upright Citizens Brigade theaters, and was a member of the sketch comedy group &quot;Pretty Ok Ho-Hum Spectacular On Ice&quot;.  He is also an original contributing member of the Channel 101 short film collective.</p>\n<p>Credits include Punk&#039;d, According to Jim, Jimmy Kimmel Live, web shorts shorts Gumbel and Yacht Rock and, most recently finished turns in the Comedy Central Pilot &quot;Crazy House&quot; as well as the Janicza Bravo directed short film &quot;Pauline Alone&quot;.</p>\n<p>He is a staunch Arsenal supporter. He is also a knucklehead and a horse lover whose favorite color is orange. DeMorge is doing the best he can.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/2913.jpg",
  "PerformerId": "7786",
  "SortOrder": 700,
  "ExcludeFromList": false,
  "id": "7786",
  "pageUrl": "7786-demorge-brown",
  "events": [
   "7645",
   "7741",
   "7815"
  ],
  "mc_events": []
 },
 {
  "Name": "Carrie Brownstein",
  "Bio": "<p>Carrie Brownstein is the co-creator, co-writer and co-star of Portlandia as well as an author and musician. She made her television career debut in 2011 with Portlandia, and in 2012 received an Emmy® nomination in the “Outstanding Writing for a Variety Series” category for her work on the series.</p>\n<p>She is a member of the critically acclaimed rock band Sleater-Kinney. Brownstein was named one of the top female electric guitarists by Elle Magazine and Rolling Stone Magazine lists Sleater-Kinney’s song \"Dig Me Out\" – featuring the overdriven riffs of Brownstein – as one of the 50 greatest guitar songs of all time. In 2006, Brownstein earned a spot on Rolling Stone's list of the “25 Most Underrated Guitarists of All-Time\" as their highest-rated female guitarist of all-time.</p>\n<p>Brownstein's writing has appeared in The New York Times, The Believer, Slate and numerous book anthologies on music and culture. She is currently working on a memoir for Riverhead Books.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/carrie-about.jpg",
  "PerformerId": "8716",
  "SortOrder": 900,
  "ExcludeFromList": true,
  "id": "8716",
  "pageUrl": "8716-carrie-brownstein",
  "events": [
   "7676"
  ],
  "mc_events": []
 },
 {
  "Name": "Whitney Streed",
  "Bio": "<p>Whitney Streed is a comedian because if she was not, her incessant punning would have no artistic or monetary value whatsoever. She has opened for the likes of Maria Bamford, Rob Delaney and Jackie Kashian, and closed for JCPenney Portraits, but that was a long time ago. Whitney has performed in clubs, pride festivals and sketchy bars across the Pacific Northwest, as well as festivals including Portland’s Bridgetown Comedy Festival, Seattle SketchFest, and the Salt Lake City Comedy Carnivale. She can be seen playing a feminist in two seasons of IFC’s hit show Portlandia. In addition to doing stand-up, Whitney also produces comedy/variety shows, including the Weekly Recurring Humor Night (running since March 2011) and co-producing the satirical infotainment series known as CHAD Chats. She likes glitter.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/headshotsmaller.jpg",
  "PerformerId": "7785",
  "SortOrder": 900,
  "ExcludeFromList": false,
  "id": "7785",
  "pageUrl": "7785-whitney-streed",
  "events": [
   "7625",
   "7914",
   "8631"
  ],
  "mc_events": [
   "7718"
  ]
 },
 {
  "Name": "Justin Michael",
  "Bio": "<p>Justin Michael is a Los Angeles based writer and performer. He&#039;s a member of the UCB house team Winslow, one half of the sketch comedy duo Tremendosaur and co-host of the Before You Were Funny podcast. He is also the co-creator of Friendship All-Stars of Friendship, a stop-motion animated series he wrote, directed, voiced, and produced for L Studio and Stoopid Buddy. He was a staff writer on Matt Besser&#039;s Comedy Central special, &quot;This Show Will Get You High&quot; and has written/directed/acted for Comedy Central, Nickelodeon, Funny or Die, Above Average, and Adult Swim. If you&#039;d like to continue your relationship beyond this bio follow @heyjustin on twitter.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/justin_michael_headshot.jpg",
  "PerformerId": "7797",
  "SortOrder": 900,
  "ExcludeFromList": false,
  "id": "7797",
  "pageUrl": "7797-justin-michael",
  "events": [],
  "mc_events": [
   "7739"
  ]
 },
 {
  "Name": "Jacob Reed",
  "Bio": "<p>Jacob Reed is Los Angeles based comedian and co-host of the Before You Were Funny Podcast. He has written and directed for Comedy Central, Nickelodeon, Funny or Die and Above Average. His TV writing credits include the Comedy Central sketch special This Show Will Get You High and the Emmy-nominated Night of Too Many Stars. As a performer and teacher at the Upright Citizens Brigade Theatre, he has performed in countless shows and appears weekly with Bangarang, the third longest running house team in UCBTLA history. He is also one half of the sketch group Tremendosaur. Reviewed by LAist as ‘a two-man sketch comedy beast,’ Tremendosaur has had multiple show runs at the UCB and been featured in The Hollywood Reporter, New York Magazine, The Wall Street Journal, and all over the information super internet. Follow Jacob on twitter @jacobreed for complaints directed at major corporations, pictures of cats, and the occasional pithy joke.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/jacobreed.png",
  "PerformerId": "7798",
  "SortOrder": 900,
  "ExcludeFromList": false,
  "id": "7798",
  "pageUrl": "7798-jacob-reed",
  "events": [
   "7739"
  ],
  "mc_events": []
 },
 {
  "Name": "Whiskey Tango",
  "Bio": "<p>Whiskey Tango. Gentlemen… doing gentlemen’s improv. Out of Portland, Oregon, this dapper group of improvisers takes audience suggestions and weaves an elaborate tapestry of scenes, environments, and relationships. With a focus on realism, Whiskey Tango keeps audiences laughing on the edge of their seats.  Show is 25-30 minutes in length and features 4-5 performers. Recently accepted into the 2014 SF Sketchfest, Whiskey Tango has performed at the iO West LA Improv Comedy Festival, the Vancouver International Improv Festival, and are six-time winners of Friday Night Fights (Curious Comedy Theater, Portland OR). They are regular performers and instructors at theaters around Portland, and all around great guys. Collectively they are Whiskey Tango. Individually they are Gabe Dinger, Jed Arkley, Leon Anderson, Nathan Loveless, Samuel De Roest (gentleman on sabbatical) and Jake Michels.</p>\n<p>- Gabe Dinger (Curious Comedy Playas)<br />\n- Jed Arkley (Administration, Curious Comedy Playas, Improv Jones-Providence, RI)<br />\n- Leon Anderson (Curious Comedy Playas, Picture Start-IO West, Private Dancer-Second City LA, April&#039;s Fools, Acme Theater)<br />\n- Nathan Loveless (Curious Comedy Playas, Nate and Nathan, Absolute Improv-University of Oregon, ComedySportz)<br />\n- Samuel De Roest (Curious Comedy Playas)<br />\n- Jake Michels - (Curious Comedy Playas, Impulse, Balrog)</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/all-5-whiskey1_0.jpg",
  "PerformerId": "5811",
  "SortOrder": 900,
  "ExcludeFromList": false,
  "id": "5811",
  "pageUrl": "5811-whiskey-tango",
  "events": [
   "7747"
  ],
  "mc_events": []
 },
 {
  "Name": "Curious Comedy Players",
  "Bio": "<p>The Curious Comedy Players hail from Curious Comedy Theater - the first and only non-profit theater in Portland devoted entirely to the art of comedy. The theater has created more than 40 original sketch, improvised and stand-up comedy productions, regularly hosts touring national artists and produces the All Jane, No Dick Comedy Festival. The Curious Comedy Training Center offers classes and workshops across many comedic disciplines, including improv, sketch writing and stand-up comedy.  </p>\n<p>For more information, visit <a href=\"http://www.curiouscomedy.org\">www.curiouscomedy.org</a>.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/curiouslogo2014.jpg",
  "PerformerId": "8578",
  "SortOrder": 900,
  "ExcludeFromList": false,
  "id": "8578",
  "pageUrl": "8578-curious-comedy-players",
  "events": [
   "7747"
  ],
  "mc_events": []
 },
 {
  "Name": "Shadi Petosky",
  "Bio": "<p>Guest on Mystery Box Show</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/dino_in_space.jpg",
  "PerformerId": "8698",
  "SortOrder": 900,
  "ExcludeFromList": true,
  "id": "8698",
  "pageUrl": "8698-shadi-petosky",
  "events": [
   "7811"
  ],
  "mc_events": []
 },
 {
  "Name": "Andy Andrist",
  "Bio": "<p>When he’s not on the road, his free time is spent marathon running, streamlining vigilante justice, and enriching the lives of farm animals. He also comes from a long and triumphant line of Freemasons, who founded the fair city of Eugene, Oregon. Although he is 1/32 African American, he made the choice long ago to forgo racial material in his repertoire. This triple threat will soon be a licensed real estate salesman, in the hopes of parlaying his selling adventures into comedic gold. Favorite color is yellow.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/r.jpg",
  "PerformerId": "8714",
  "SortOrder": 900,
  "ExcludeFromList": false,
  "id": "8714",
  "pageUrl": "8714-andy-andrist",
  "events": [
   "7677",
   "8633"
  ],
  "mc_events": []
 },
 {
  "Name": "Dax Jordan",
  "Bio": "<p>A Los Angeles native who moved to Portland as a child, Dax recently made the childish move to Silverlake CA, the Portland of Los Angeles. 2013 saw the debut of his first album &quot;Flee From Danger&quot; on Pandora, XM Radio, Spotify and iTunes. He continues to tour the nation, develop television projects and whine endlessly about his divorce. You&#039;ll see.</p>\n",
  "PhotoUrl": "http://bridgetown.festivalthing.com/sites/default/files/images/performers/_mg_5329resize.jpg",
  "PerformerId": "5995",
  "SortOrder": 99999,
  "ExcludeFromList": false,
  "id": "5995",
  "pageUrl": "5995-dax-jordan",
  "events": [
   "7621",
   "7745"
  ],
  "mc_events": [
   "7702",
   "7725",
   "7726"
  ]
 }
]